/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : ParaUser.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 参数存储模块用户接口
** @Instructions : 
**===============================================================================================*/
#ifndef _PARAUSER_H
#define _PARAUSER_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u8 ParaGroupSelfAddrCfgAPI(u16 addr, u8 port)
** @Input     : addr:设置目标设备地址[50,65] port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : 设置成功或失败
** @Function  : 设备序列号参数设置命令处理函数
** @The notes : 通信口设置
**===============================================================================================*/
u8 ParaGroupSelfAddrCfgAPI(u16 addr, u8 port);

/*=================================================================================================
** @Name      : u8 RcvDeviceSerialParaCfgAPI(u8 index, u8 port)
** @Input     : index:参数字段索引号 port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : 设置成功或失败
** @Function  : 设备序列号参数设置命令处理函数
** @The notes : 通信口设置
**===============================================================================================*/
u8 RcvDeviceSerialParaCfgAPI(u8 index, u8 port);

/*=================================================================================================
** @Name      : u8 RcvSystemGenParaCfgAPI(u8 index, u8 port)
** @Input     : index:参数字段索引号 port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : 设置成功或失败
** @Function  : 系统通用参数设置命令处理函数
** @The notes : 通信口设置
**===============================================================================================*/
u8 RcvSystemGenParaCfgAPI(u8 index, u8 port);

/*=================================================================================================
** @Name      : u8 RcvSystemGenParaCfgAPI(u8 index, u8 port)
** @Input     : index:参数字段索引号 port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : 设置成功或失败
** @Function  : 系统硬件参数设置命令处理函数
** @The notes : 通信口设置
**===============================================================================================*/
u8 RcvSystemHWParaCfgAPI(u8 index, u8 port);

/*=================================================================================================
** @Name      : u8 RcvGroupGenParaCfgAPI(u8 index, u8 port)
** @Input     : index:参数字段索引号 port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : 设置成功或失败
** @Function  : 电池组主控通用参数设置命令处理函数
** @The notes : 通信口设置
**===============================================================================================*/
u8 RcvGroupGenParaCfgAPI(u8 index, u8 port);

/*=================================================================================================
** @Name      : u8 RcvGroupHigParaCfgAPI(u8 index, u8 port)
** @Input     : index:参数字段索引号 port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : 设置成功或失败
** @Function  : 电池组主控高级参数设置命令处理函数
** @The notes : 通信口设置
**===============================================================================================*/
u8 RcvGroupHigParaCfgAPI(u8 index, u8 port);

/*=================================================================================================
** @Name      : u8 RcvGroupHWParaCfgAPI(u8 index, u8 port)
** @Input     : index:参数字段索引号 port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : 设置成功或失败
** @Function  : 电池组主控硬件参数设置命令处理函数
** @The notes : 通信口设置
**===============================================================================================*/
u8 RcvGroupHWParaCfgAPI(u8 index, u8 port);

#endif
