/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileDiagMaker.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控故障诊断故障码设置接口模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILEDIAGMAKER_H
#define _PILEDIAGMAKER_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define PERR_SYS_LACK_NOR_G_T       50                  //系统可用电池组不足判断时间(0.1s)
#define PERR_SYS_NO_NOR_G_T         50                  //系统无可用电池组判断时间(0.1s)
#define PERR_SYS_CHG_OP_T           80                  //系统充电功率超限判断时间(0.1s)
#define PERR_SYS_DHG_OP_T           80                  //系统充电功率超限判断时间(0.1s)

#define PERR_SYS_PCS_CANOFF_T       30                  //系统与PCS通讯断线判断时间(1s)
#define PERR_SYS_BCU_CANOFF_T       10                  //系统与BCU通讯断线判断时间(1s)

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//=============================================================================================
//函数名称	: void PileWarCodeMakerTask(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 电池堆告警码检测任务
//注意事项	: 100ms
//=============================================================================================
void PileWarCodeMakerTask(void);

//=============================================================================================
//函数名称	: void PileErrCodeMakerTask(void)
//输入参数	: void 
//输出参数	: void
//函数功能	: 电池堆故障告警码检测任务
//注意事项	: 100ms 
//============================================================================================= 
void PileErrCodeMakerTask(void);

#endif
#endif
