/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileDiagCheck.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控故障诊断故障判定接口模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILEDIAGCHECK_H
#define _PILEDIAGCHECK_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define SMU_WAIT_GCAN_TIME      5       //上电等待主控信息时间(s)

#define PWR_L_OFF_G_CURR        300     //电池组动力线断线正常组电流(0.1A)
#define SUM_VOLT_OFF_V          (3)     //总电压波动范围(0.1V)

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//=============================================================================================
//函数名称	: void PileRcvPcsMsgCountAddAPI(u8 addr)
//输入参数	: void
//输出参数	: void
//函数功能	: 接收到上层充放电设备通讯信息计数自加
//注意事项	: 与PCS通讯接收信息
//=============================================================================================
void PileRcvPcsMsgCountAddAPI(u8 addr);

//=============================================================================================
//函数名称	: void PileRcvGroupMsgCountAddAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: void
//函数功能	: 接收到各电池组主控CAN信息计数自加
//注意事项	: 堆控与堆下电池组主控通讯状态
//=============================================================================================
void PileRcvGroupMsgCountAddAPI(u8 group);

//=============================================================================================
//函数名称	: void CheckRcvPileAddrRepAPI(u8 addr)
//输入参数	: addr:接收到的设备地址
//输出参数	: void
//函数功能	: 堆控设备地址重复冲突检测
//注意事项	: 接收堆控设备地址报文时调用
//=============================================================================================
void CheckRcvPileAddrRepAPI(u8 addr);

//=============================================================================================
//函数名称	: void PileAllCommuExpDiagTask(void)
//输入参数	: void 
//输出参数	: void
//函数功能	: 堆控系统通信断线诊断任务
//注意事项	: 1s周期
//=============================================================================================
void PileAllCommuExpDiagTask(void);

//=============================================================================================
//函数名称	: void PileGroupExpDiagTask(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 电池组异常状态诊断任务
//注意事项	: 100ms
//=============================================================================================
void PileGroupExpDiagTask(void);

//=============================================================================================
//函数名称	: u8 GetPileAddrRepErrFlag(void)
//输入参数	: void
//输出参数	: 0正常 1堆控设备地址重复
//函数功能	: 获取堆控设备地址重复标志
//注意事项	: 
//=============================================================================================
u8 GetPileAddrRepErrFlag(void);

/*=================================================================================================
** @Name      : u8 GetPileRcvSmuMsgFlag(void)
** @Input     : void
** @Output    : 接收到相同电池堆堆控信息标志 0未接收 1接收到
** @Function  : 获取接收到相同电池堆堆控信息标志
** @The notes : 判别是否已有堆控启用
**===============================================================================================*/
u8 GetPileRcvSmuMsgFlag(void);

//=============================================================================================
//函数名称	: u8 GetPRcvGroupMsgFlagAPI(void)
//输入参数	: void
//输出参数	: 接收到主控通讯CAN信息标志(按位表示[0未接收 1接收到])
//函数功能	: 获取接收到主控通讯CAN信息标志
//注意事项	: 包括自身和未激活使能组
//=============================================================================================
u16 GetPRcvGroupMsgFlagAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileGroupCanOffFlag(void)
//输入参数	: void
//输出参数	: 各组主控通讯CAN断线标志(按位表示) 0正常 1断线
//函数功能	: 获取各组主控通讯CAN断线标志
//注意事项	: 包括自身,未激活使能组不上报
//=============================================================================================
u16 GetPileGroupCanOffFlag(void);

//=============================================================================================
//函数名称	: u16 GetPGroupCanOffFlagAPI(void)
//输入参数	: void
//输出参数	: 各组主控通讯CAN断线标志(按位表示) 0正常 1断线
//函数功能	: 获取各组主控通讯CAN断线标志
//注意事项	: 包括自身,未激活使能组不上报
//=============================================================================================
u16 GetPGroupCanOffFlagAPI(void);

//=============================================================================================
//函数名称	: u8 GetPilePcsCanOffFlag(void)
//输入参数	: void
//输出参数	: PCS CAN断线标志  0:正常 1:断线
//函数功能	: 获取堆控系统与PCS CAN断线标志
//注意事项	: 
//=============================================================================================
u8 GetPilePcsCanOffFlag(void);

//=============================================================================================
//函数名称	: u8 GetPileGSumVDiffFlag(void)
//输入参数	: void
//输出参数	: 电池组压差过大标志 0:正常 1:压差过大
//函数功能	: 获取电池组压差过大标志
//注意事项	: 
//=============================================================================================
u8 GetPileGSumVDiffFlag(void);

//=============================================================================================
//函数名称	: u16 GetPileGroupPwrLOffFlag(void)
//输入参数	: void
//输出参数	: 按位表示电池组动力线断线标志 1:断线 0:正常
//函数功能	: 获取电池组动力线断线标志
//注意事项	: 
//=============================================================================================
u16 GetPileGroupPwrLOffFlag(void);

//=============================================================================================
//函数名称	: u16 GetPileGSwhStateErrFlag(void)
//输入参数	: void
//输出参数	: 按位表示电池组接触器状态异常标志 1:异常 0:正常
//函数功能	: 获取电池组接触器状态异常标志
//注意事项	:
//=============================================================================================
u16 GetPileGSwhStateErrFlag(void);

#endif
#endif
