/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileSciHandle.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 串口堆控参数配置处理模块接口
** @Instructions : 
**===============================================================================================*/
#ifndef _PILESCIPARAHD_H
#define _PILESCIPARAHD_H

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "BSPUserAPI.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u16* SciGetPtrPileGenParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写堆控通用参数配置寄存器地址指针
** @Function  : 获取读写堆控通用参数配置寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileGenParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileGenParaCfgRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆堆控通用参数值信息寄存器地址指针
** @Function  : 获取读电池堆堆控通用参数值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileGenParaCfgRO(u8 index);

#endif
#endif
