/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileSciCtrlHd.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 串口控制堆控处理模块接口
** @Instructions : 
**===============================================================================================*/
#ifndef _PILESCICTRLHD_H
#define _PILESCICTRLHD_H

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u16* SciGetPtrPileAuthPwdWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写堆控权限密码信息寄存器地址指针
** @Function  : 获取堆控读写权限密码信息寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileAuthPwdWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileWStateCmdWR(u8 fncCode, u8 sciNum, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 data:写入数据(请求修改有效)
** @Output    : 读权限信息寄存器地址指针
** @Function  : 获取读项目参数信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileWStateCmdWR(u8 fncCode, u8 sciNum, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileWModeCmdWR(u8 fncCode, u8 sciNum, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 data:写入数据(请求修改有效)
** @Output    : 读写工作模式切换命令寄存器地址指针
** @Function  : 获取读写工作模式切换命令寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileWModeCmdWR(u8 fncCode, u8 sciNum, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileSysClrCmdWR(u8 fncCode, u8 sciNum, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 data:写入数据(请求修改有效)
** @Output    : 读写系统清除命令寄存器地址指针
** @Function  : 获取读写系统清除命令寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileSysClrCmdWR(u8 fncCode, u8 sciNum, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileDebugCmdWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写系统调试命令寄存器地址指针
** @Function  : 获取读写系统调试命令寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileDebugCmdWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileAuthPwdRO(u8 index)
** @Input     : index:索引号
** @Output    : 读权限信息寄存器地址指针
** @Function  : 获取读项目参数信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileAuthPwdRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileDebugResultRO(u8 index)
** @Input     : index:索引号
** @Output    : 读系统调试结果信息寄存器地址指针
** @Function  : 获取读系统调试结果信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileDebugResultRO(u8 index);

#endif
#endif
