/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileSciInfoPt.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 串口堆控信息模块指针接口
** @Instructions : 
**===============================================================================================*/
#ifndef _PILESCIINFOPOINT_H
#define _PILESCIINFOPOINT_H

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u16* SciGetPtrPileHisErrRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆历史故障信息寄存器地址指针
** @Function  : 获取读电池堆历史故障信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileHisErrRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileHisEventRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆历史事件态信息寄存器地址指针
** @Function  : 获取读电池堆历史事件信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileHisEventRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileStateInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆状态信息寄存器地址指针
** @Function  : 获取读电池堆状态信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileStateInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileLimitInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆限值信息寄存器地址指针
** @Function  : 获取读电池堆限值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileLimitInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileErrInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆故障告警信息寄存器地址指针
** @Function  : 获取读电池堆故障告警信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileErrInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileIoStateInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆输入输出口状态信息寄存器地址指针
** @Function  : 获取读电池堆输入输出口状态信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileIoStateInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileMainInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆主要数据信息寄存器地址指针
** @Function  : 获取读电池堆主要数据信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileMainInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileCapInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆电量状态信息寄存器地址指针
** @Function  : 获取读电池堆电量状态息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileCapInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileCellCharaInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆单体特征信息寄存器地址指针
** @Function  : 获取读电池堆单体特征总体寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileCellCharaInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileSumVCCharaInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆总压电流特征信息寄存器地址指针
** @Function  : 获取读电池堆总压电流特征信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileSumVCCharaInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileStatistInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池堆统计信息寄存器地址指针
** @Function  : 获取读电池堆统计信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileStatistInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrPileHisCapEnerInfoRO(u8 sciNum, u8 index)
** @Input     : sciNum:端口号 index:索引号
** @Output    : 读电池堆累计电能电量信息寄存器地址指针
** @Function  : 获取读电池堆累计电能电量信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrPileHisCapEnerInfoRO(u8 sciNum, u8 index);

#endif
#endif
