/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileTactics.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控策略控制任务模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILETACTICS_H
#define _PILETACTICS_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
typedef struct 
{
    u8 CtrlGNum;                       //需要控制的电池组数
    u8 CtrlGId[PILE_MAX_G_NUM];        //需要控制的电池组组号
    u16 CtrlFailGroup;                 //控制失败的电池组(按位表示)
}t_SYSCTRL_INFO;

typedef enum
{
    e_CtrlExp_LaOKGroup = 0,        //可用电池组不足
    e_CtrlExp_SumVDiff,             //组压差过大
    e_CtrlExp_UpCOver,              //启动组电流过大
    e_CtrlExp_UpPChgCmd,            //启动预充控制失败(启动)
    e_CtrlExp_UpMainCmd,            //启动主回路控制失败(启动)
    e_CtrlExp_DnPChgCmd,            //断开预充控制失败(启动)
    e_CtrlExp_UpGroupErr,           //启动电池组故障(启动)
    e_CtrlExp_DnCOver,              //停机组电流过大
    e_CtrlExp_DnMainCmd,            //断开主回路控制失败(停机)
    e_CtrlExp_DnGroupErr,           //停机电池组故障(停机)
}e_CtrlExp_Reason;                  //堆控制失败原因

typedef enum
{
    ePEStopReason_SysInt = 0, 		//系统内部急停
	ePEStopReason_ExtCmd = 1, 		//外部命令急停
    
    eBsuEmergStopReason_Fin
}e_BsuEmergStopReason;              //系统紧急停机原因

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//=============================================================================================
//函数名称	: void TacSetPileWorkStateCtrlCmdAPI(u8 cmd)
//输入参数	: cmd:控制命令 0:正常停止 1:正常预充 2:正常启动 3:充电启动 4:放电启动 5:充电停止 6:放电停止 7:紧急停止 8:关机 9:开机
//输出参数	: void
//函数功能	: 设置堆控工作状态切换控制命令
//注意事项	: 
//=============================================================================================
void TacSetPileWorkStateCtrlCmdAPI(u8 cmd);

//=============================================================================================
//函数名称	: void PileSysNorStopCtrlTask(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 电池堆系统正常停机控制任务
//注意事项	: 停机状态100ms调用
//=============================================================================================
void PileSysNorStopCtrlTask(void);

//=============================================================================================
//函数名称	: void PileSysErrStopCtrlTask(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 电池堆系统故障停机(急停)控制任务
//注意事项	: 故障状态100ms调用
//=============================================================================================
void PileSysErrStopCtrlTask(void);

//=============================================================================================
//函数名称	: void PileSysPwrOffCtrlTask(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 电池堆系统关机控制任务
//注意事项	: 关机状态100ms调用
//=============================================================================================
void PileSysPwrOffCtrlTask(void);

//=============================================================================================
//函数名称	: void TacClrPileCtrlErrFlagAPI(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 清除电池堆系统控制异常故障标志
//注意事项	: 
//=============================================================================================
void TacClrPileCtrlErrFlagAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileSysCtrlFailGroup(void)
//输入参数	: void
//输出参数	: 电池堆控制失败的电池组(按位表示):0:正常 1:失败
//函数功能	: 获取电池堆控制失败的电池组
//注意事项	: 
//=============================================================================================
u16 GetPileSysCtrlFailGroup(void);

//=============================================================================================
//函数名称	: u8 GetPileSysStartErrFlag(void)
//输入参数	: void
//输出参数	: 电池堆启动异常标志(每bit表示1个启动异常原因)[0正常,1异常]
//函数功能	: 获取电池堆启动异常标志
//注意事项	: 
//=============================================================================================
u8 GetPileSysStartErrFlag(void);

//=============================================================================================
//函数名称	: u8 GetPileSysStopErrFlag(void)
//输入参数	: void
//输出参数	: 电池堆停机异常标志(每bit表示1个停机异常原因)[0正常,1异常]
//函数功能	: 获取电池堆停机异常标志
//注意事项	: 
//=============================================================================================
u8 GetPileSysStopErrFlag(void);

//=============================================================================================
//函数名称	: u8 GetPileSysEmergStopFlag(void)
//输入参数	: void
//输出参数	: 系统紧急停机标志:0:正常 >0:急停原因
//函数功能	: 获取系统紧急停机标志
//注意事项	: 按位表示系统紧急停机原因:Bit0:系统内部急停 Bit1:外部命令急停
//=============================================================================================
u8 GetPileSysEmergStopFlag(void);

#endif
#endif
