/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileTactInterface.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控策略控制接口模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILETACTINTERFACE_H
#define _PILETACTINTERFACE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define CHECK_CUR_OK_TIMES      (20)        //并网吸合接触器前检测电流安全次数(单位10ms)

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
typedef struct
{
    u8 workGState;                  //电池组工作状态[0初始化,1正常,2故障]
    u8 groupState;                  //电池组总状态[0,9]
    u8 norGNum;                     //正常的电池组数目
    u8 norGroup[PILE_MAX_G_NUM];    //正常的电池组序列
    u8 runGNum;                     //运行的电池组数目
    u8 runGroup[PILE_MAX_G_NUM];    //运行的电池组序列
    u8 sepGNum;                     //需要隔离的电池组数目
    u8 sepGroup[PILE_MAX_G_NUM];    //需要隔离的电池组序列
    u8 sepReason[PILE_MAX_G_NUM];   //隔离电池组相应原因
}t_GROUPSTATE_INFO;

//电池堆内电池组总体保护状态值
typedef enum
{
    ePGPRO_STA_WAIT   = 0,			/*未就绪状态    [电池正常但直流回路未就绪]*/
	ePGPRO_STA_READY   = 1,			/*正常就绪状态  [电池正常且允许充电和放电]*/
	ePGPRO_STA_FULL   = 2,			/*充电截止状态  [电池充满仅允许放电]*/
	ePGPRO_STA_EMPTY  = 3,			/*放电截止状态  [电池放空仅允许充电]*/
	ePGPRO_STA_CHGLIM = 4,			/*充电限制状态  [电池充电异常仅允许放电]*/
	ePGPRO_STA_DHGLIM = 5,			/*放电限制状态  [电池放电异常仅允许充电]*/
	ePGPRO_STA_SYSLIM = 6,			/*充放电限制状态[直流回路正常但不允许充电和放电]*/
	ePGPRO_STA_CHGPRO = 7,			/*充电保护状态  [充电回路断开仅允许放电]*/
	ePGPRO_STA_DHGPRO = 8,			/*放电保护状态  [放电回路断开仅允许充电]*/
	ePGPRO_STA_SYSPRO = 9			/*充放电保护状态[充放电回路均断开系统故障]*/
}e_PileGroupProState;

//电池组动态切除原因值
typedef enum
{
    eSEP_REASON_DIS = 0,        //未激活
    eSEP_REASON_OFF = 1,        //通讯中断
    eSEP_REASON_ISO = 2,        //断路器开路
    eSEP_REASON_ERR = 3,        //电池组故障
    eSEP_REASON_SYSLIM = 4,     //电池组充放电限制
    eSEP_REASON_CHGLIM = 5,     //电池组充电限制
    eSEP_REASON_DHGLIM = 6,     //电池组放电限制
    eSEP_REASON_OTHER = 7,      //其他原因
}e_GSEP_REASON;

typedef enum
{
    FunR_Ok    = 0,
    FunR_Wait  = 1,
    FunR_Fault = 2
}e_Result;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//=============================================================================================
//函数名称	: void PileSetGroupWorkStateCtrlCmdHook(u8 group, u8 cmd)
//输入参数	: group:组号[0,15]  cmd:命令(0:正常停止 1:正常预充 2:正常启动 3:充电启动 4:放电启动 5:充电停机 6:放电停机 7:紧急停机 8:下电关机 9:上电开机)
//输出参数	: void
//函数功能	: 设置控制主控系统工作状态切换控制命令
//注意事项	: 包括发送报文和设置自身所在组
//=============================================================================================
void PileSetGroupWorkStateCtrlCmdHook(u8 group, u8 cmd);

//=============================================================================================
//函数名称	: void PileSetGroupWorkModeCtrlCmdHook(u8 group, u8 cmd)
//输入参数	: group:组号[0,15]  cmd:命令(0:自动 1:手动 2:紧急 5:调试)
//输出参数	: void
//函数功能	: 设置控制主控系统工作模式切换控制命令
//注意事项	: 包括发送报文和设置自身所在组
//=============================================================================================
void PileSetGroupWorkModeCtrlCmdHook(u8 group, u8 cmd);

//=============================================================================================
//函数名称	: void PileSetGroupSysClrCtrlCmdHook(u8 group, u8 cmd)
//输入参数	: group:组号[0,15]  cmd:命令(1:清除当前故障 2:清除当天故障 3:清除故障数目 4:清除运行计时 5:清除累计电量 6:清除故障记录 7:清除事件记录  8:清除故障录波 9:清除数据记录 10:恢复出厂设置 11:消除末端限流 12:消除充放截止)
//输出参数	: void
//函数功能	: 设置控制主控系统清除命令
//注意事项	: 包括发送报文和设置自身所在组
//=============================================================================================
void PileSetGroupSysClrCtrlCmdHook(u8 group, u8 cmd);

//=============================================================================================
//函数名称	: void PileSetGroupUserCtrlCmdHook(u8 group, u8 index, u8 len, u16 *cmd)
//输入参数	: group:组号[0,15] index:起始子索引[0,5] len:子索引长度[1,6] cmd:控制命令
//输出参数	: void
//函数功能	: 设置控制主控用户控制信息命令
//注意事项	: 包括发送报文和设置自身所在组
//=============================================================================================
void PileSetGroupUserCtrlCmdHook(u8 group, u8 index, u8 len, u16 *cmd);

//=============================================================================================
//函数名称	: void PileSetGroupSysDebugCtrlCmdHook(u8 group, u8 index, u8 len, u16 *cmd)
//输入参数	: group:组号[0,15] index:起始子索引[0,7] len:子索引长度[1,8] cmd:调试命令
//输出参数	: void
//函数功能	: 设置控制主控系统调试信息命令
//注意事项	: 包括发送报文和设置自身所在组
//=============================================================================================
void PileSetGroupSysDebugCtrlCmdHook(u8 group, u8 index, u8 len, u16 *cmd);

//=============================================================================================
//函数名称	: void PileBroadAllGroupNorStopCmdHook(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 堆控广播所有电池组正常停机命令
//注意事项	: 发送广播地址(包括发送报文和设置自身所在组)
//=============================================================================================
void PileBroadAllGroupNorStopCmdHook(void);

//=============================================================================================
//函数名称	: void PileBroadAllGroupForcibStopCmdHook(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 堆控广播所有电池组强制停机命令
//注意事项	: 发送广播地址(包括发送报文和设置自身所在组)
//=============================================================================================
void PileBroadAllGroupForcibStopCmdHook(void);

//=============================================================================================
//函数名称	: void PileBroadAllGroupEmergStopCmdHook(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 堆控广播所有电池组紧急停机命令
//注意事项	: 发送广播地址(包括发送报文和设置自身所在组)
//=============================================================================================
void PileBroadAllGroupEmergStopCmdHook(void);

//=============================================================================================
//函数名称	: void PileBroadAllGroupPowerOnCmdHook(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 堆控广播所有电池组上电开机命令
//注意事项	: 发送广播地址(包括发送报文和设置自身所在组)
//=============================================================================================
void PileBroadAllGroupPowerOnCmdHook(void);

//=============================================================================================
//函数名称	: void PileBroadAllGroupPowerOffCmdHook(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 堆控广播所有电池组下电关机命令
//注意事项	: 需多次调用(其他组下电才自身下电),发送广播地址(包括发送报文和设置自身所在组)
//=============================================================================================
void PileBroadAllGroupPowerOffCmdHook(void);

//=============================================================================================
//函数名称	: void PileBroadAllGroupWorkModeCmdHook(void)
//输入参数	: mode:目标模式
//输出参数	: void
//函数功能	: 堆控广播所有电池组切换工作模式命令
//注意事项	: 发送广播地址(包括发送报文和设置自身所在组)
//=============================================================================================
void PileBroadAllGroupWorkModeCmdHook(u8 mode);

//=============================================================================================
//函数名称	: void PileBroadAllGroupUserCmdHook(u8 index, u8 len, u16 *cmd)
//输入参数	: index:起始子索引[0,5] len:子索引长度[1,6] cmd:用户控制命令
//输出参数	: void
//函数功能	: 堆控广播所有电池组设置用户控制信息命令
//注意事项	: 发送广播地址(包括发送报文和设置自身所在组)
//=============================================================================================
void PileBroadAllGroupUserCmdHook(u8 index, u8 len, u16 *cmd);

//=============================================================================================
//函数名称	: void PileBroadAllGroupDebugCmdHook(u8 index, u8 len, u16 *cmd)
//输入参数	: index:起始子索引[0,7] len:子索引长度[1,8] cmd:调试命令
//输出参数	: void
//函数功能	: 堆控广播所有电池组设置调试信息命令
//注意事项	: 发送广播地址(包括发送报文和设置自身所在组)
//=============================================================================================
void PileBroadAllGroupDebugCmdHook(u8 index, u8 len, u16 *cmd);

/*=================================================================================================
 ** @Name      : u8 PileGetUserReqStopStateHook(void)
 ** @Input     : void
 ** @Output    : 请求电池堆停机状态 0:未请求 1:请求
 ** @Function  : 获取用户请求电池堆停机状态
 ** @The notes : 运行状态需要停机
 **===============================================================================================*/
u8 PileGetUserReqStopStateHook(void);

/*=================================================================================================
 ** @Name      : u8 PileGetSysFitStartStateHook(void)
 ** @Input     : void
 ** @Output    : 电池组适合启动状态 0:不适合 1:适合
 ** @Function  : 获取电池组适合启动状态
 ** @The notes : 空闲状态允许启动
 **===============================================================================================*/
u8 PileGetSysFitStartStateHook(void);

//=============================================================================================
//函数名称	: u8 PileCheckInitStateResultHook(void)
//输入参数	: void
//输出参数	: ok:通过 wait等待 fault:异常 
//函数功能	: 判断电池堆开机自检状态结果
//注意事项	: 用户完善
//=============================================================================================
u8 PileCheckInitStateResultHook(void);

//=============================================================================================
//函数名称	: u8 PileCheckIdleStateResultHook(void)
//输入参数	: void
//输出参数	: ok:通过 wait等待 fault:异常
//函数功能	: 判断电池堆空闲状态结果
//注意事项	: 用户完善
//=============================================================================================
u8 PileCheckIdleStateResultHook(void);

//=============================================================================================
//函数名称	: u8 PileCheckStartStateResultHook(void)
//输入参数	: void
//输出参数	: ok:启动完成 wait等待 failed:启动失败
//函数功能	: 判断电池堆启动状态结果
//注意事项	: 用户完善
//=============================================================================================
u8 PileCheckStartStateResultHook(void);

//=============================================================================================
//函数名称	: u8 PileCheckRunStateResultHook(void)
//输入参数	: void
//输出参数	: ok:通过 wait等待 fault:异常
//函数功能	: 判断电池堆运行状态结果
//注意事项	: 用户完善
//=============================================================================================
u8 PileCheckRunStateResultHook(void);

//=============================================================================================
//函数名称	: u8 PileCheckErrStateResultHook(void)
//输入参数	: void
//输出参数	: ok:通过可恢复 wait等待 fault:异常
//函数功能	: 判断电池堆故障状态恢复结果
//注意事项	: 用户完善
//=============================================================================================
u8 PileCheckErrStateResultHook(void);

//=============================================================================================
//函数名称	: u8 PileCheckStopStateResultHook(void)
//输入参数	: void
//输出参数	: ok:停止成功 wait等待 fault:异常
//函数功能	: 判断电池堆停机状态
//注意事项	: 用户完善
//=============================================================================================
u8 PileCheckStopStateResultHook(void);

//=============================================================================================
//函数名称	: u8 PileCheckOffStateResultHook(void)
//输入参数	: void
//输出参数	: ok:关机成功 wait等待 fault:异常
//函数功能	: 判断电池堆关机状态结果
//注意事项	: 用户完善
//=============================================================================================
u8 PileCheckOffStateResultHook(void);

/*=================================================================================================
 ** @Name      : void TacPileWorkModeChangDealHook(u8 befMode, u8 aftMode)
 ** @Input     : befState:前置状态 aftState:后置状态
 ** @Output    : void
 ** @Function  : 电池堆工作模式变换处理函数
 ** @The notes :
 **===============================================================================================*/
void TacPileWorkModeChangDealHook(u8 befMode, u8 aftMode);

#if(1 == PILE_MOR_F_EN)/*使能更多功能*/
/*=================================================================================================
 ** @Name      : u8 TacCheckPileGDebugResultHook(void)
 ** @Input     : void
 ** @Output    : 电池组调试结果状态 0:未调试 1:调试成功 2:非调试模式 3:调试参数错误 4:通讯失败
 ** @Function  : 电池堆调试电池组结果状态
 ** @The notes :
 **===============================================================================================*/
u8 TacCheckPileGDebugResultHook(void);
#endif

#endif
#endif
