/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileStartUp.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控策略控制任务模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILESTARTUP_H
#define _PILESTARTUP_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
typedef struct
{
    u8 CanUseBatNum;                        //能够并网的电池组数目
    u8 CanUseBatGroup[PILE_MAX_G_NUM];      //能够并网的电池组号
}_CAN_PICKUP_GROUP;

typedef struct
{
    u8 ChosePickNum;                        //选择启动的电池数
    u8 ChoseBatGroup[PILE_MAX_G_NUM];       //选择启动的电池组号码
    u8 GroupNoPickReason[PILE_MAX_G_NUM];   //组未并网原因
}_CHOSE_PICKUP_GROUP;

typedef struct
{
    u8 TurnOnCPRStep;                       //吸合预充动作顺序
    u8 TurnOnMPRStep;                       //吸合主接触器动作顺充
    u8 TurnOffCPRStep;                      //断开预充动作顺序
}_PICKUPSYSTEM_CTRL;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//=============================================================================================
//函数名称	: void PileSysStartCtrlTask(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 启动电池堆系统控制任务
//注意事项	: 启动状态10ms调用
//=============================================================================================
void PileSysStartCtrlTask(void);

#endif
#endif
