/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileTactUser.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控策略用户接口模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILETACTUSER_H
#define _PILETACTUSER_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//=============================================================================================
//函数名称	: void PileGOperAuthCtrlTask(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 电池堆各主控操作权限控制任务(确保组权限与堆权限一致)
//注意事项	: 1s
//=============================================================================================
void PileGOperAuthCtrlTask(void);

/*=================================================================================================
** @Name      : void RcvPileWorkStateCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口 [10,12]按钮或内部口
** @Output    : void
** @Function  : 电池堆接收切换工作状态命令处理函数
** @The notes : 通信口或按钮命令
**===============================================================================================*/
void RcvPileWorkStateCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvPileWorkModeCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口 [10,12]按钮或内部口
** @Output    : void
** @Function  : 电池堆接收切换工作模式切换命令处理函数
** @The notes : 通信口或按钮或内部命令
**===============================================================================================*/
void RcvPileWorkModeCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvPileSysClrCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口 [10,12]按钮或内部口
** @Output    : void
** @Function  : 电池堆接收切换工作状态命令处理函数
** @The notes : 通信口或按钮命令
**===============================================================================================*/
void RcvPileSysClrCmdAPI(u8 port);

#if(1 == PILE_MOR_F_EN)/*使能更多功能*/
/*=================================================================================================
** @Name      : void RcvPileDebugOperCmdAPI(u8 index)
** @Input     : index:调试命令索引
** @Output    : void
** @Function  : 电池堆接收切换调试操作命令处理函数
** @The notes : 通信口或按钮命令
**===============================================================================================*/
void RcvPileDebugOperCmdAPI(u8 index);

/*=================================================================================================
** @Name      : void RcvPileDebugAffirmCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口 10:按钮 11:内部
** @Output    : void
** @Function  : 电池堆接收调试确认命令处理函数
** @The notes : 通信口或按钮命令
**===============================================================================================*/
void RcvPileDebugAffirmCmdAPI(u8 port);
#endif

#endif
#endif
