/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileSysState.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控检测各电池组状态任务模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILEGROUPSTATE_H
#define _PILEGROUPSTATE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//=============================================================================================
//函数名称	: void PileSysStateInit(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 系统状态检测模块初始化
//注意事项	:
//=============================================================================================
void PileSysStateInit(void);

//=============================================================================================
//函数名称	: void PileAllGStateCheckTask(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 电池堆检测电池组总状态任务
//注意事项	: 100ms,分析电池组总状态
//=============================================================================================
void PileAllGStateCheckTask(void);

//=============================================================================================
//函数名称	: void PileProStateCheckTask(void)
//输入参数	: void 
//输出参数	: void
//函数功能	: 检测电池堆保护状态任务
//注意事项	: 100ms任务
//=============================================================================================
void PileProStateCheckTask(void);

//=============================================================================================
//函数名称	: void PileChgStateCheckTask(void)
//输入参数	: void 
//输出参数	: void
//函数功能	: 检测电池堆充放电状态任务
//注意事项	: 100ms任务
//=============================================================================================
void PileChgStateCheckTask(void);

//=============================================================================================
//函数名称	: u8 GetPileGCurrCircStateAPI(void)
//输入参数	: void
//输出参数	: 电池组电流环流状态 0:未环流 1环流
//函数功能	: 检测电池堆内部电池组电流环流状态
//注意事项	: 
//=============================================================================================
u8 GetPileGCurrCircStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPileAllGSysStateAPI(void)
//输入参数	: void
//输出参数	: 电池组系统总状态 0初始化 1正常 2故障
//函数功能	: 获取电池堆内电池组系统总状态
//注意事项	: 
//=============================================================================================
u8 GetPileAllGSysStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPileAllGProStateAPI(void)
//输入参数	: void
//输出参数	: 电池组总保护状态 0未就绪 1正常 2充满 3放空 4充电限制 5放电限制 6充放电限制 7充电保护 8放电保护 9充放电保护
//函数功能	: 获取系统电池组总保护状态
//注意事项	: 
//=============================================================================================
u8 GetPileAllGProStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPileNorGroupNumAPI(void)
//输入参数	: void
//输出参数	: 正常无故障的电池组数
//函数功能	: 获取系统正常无故障可用电池组组数目
//注意事项	: 非充放电保护组
//=============================================================================================
u8 GetPileNorGroupNumAPI(void);

//=============================================================================================
//函数名称	: u8 GetPileNorGroupIdAPI(u8 index)
//输入参数	: index:正常组序列索引号
//输出参数	: 正常无故障的电池组组号
//函数功能	: 获取电池堆正常无故障的可用电池组组号
//注意事项	: 非充放电保护组
//=============================================================================================
u8 GetPileNorGroupIdAPI(u8 index);

//=============================================================================================
//函数名称	: u8 GetPileRunGroupNumAPI(void)
//输入参数	: void
//输出参数	: 正在运行的电池组数
//函数功能	: 获取系统电池组运行组数目
//注意事项	: 正常无保护组
//=============================================================================================
u8 GetPileRunGroupNumAPI(void);

//=============================================================================================
//函数名称	: u8 GetPileRunGroupIdAPI(u8 index)
//输入参数	: index:运行组序列索引号
//输出参数	: 正在运行的电池组组号
//函数功能	: 获取电池堆正在运行的电池组组号
//注意事项	: 正常无保护组
//=============================================================================================
u8 GetPileRunGroupIdAPI(u8 index);

//=============================================================================================
//函数名称	: u8 GetPileSepGroupNumAPI(void)
//输入参数	: void
//输出参数	: 需要切除的电池组数
//函数功能	: 获取系统需要切除的电池组数目
//注意事项	: 
//=============================================================================================
u8 GetPileSepGroupNumAPI(void);

//=============================================================================================
//函数名称	: u8 GetPileSepGroupIdAPI(u8 index)
//输入参数	: index:需切除组序列索引号
//输出参数	: 需要切除的电池组组号
//函数功能	: 获取电池堆正在运行的电池组组号
//注意事项	: 
//=============================================================================================
u8 GetPileSepGroupIdAPI(u8 index);

//=============================================================================================
//函数名称	: u8 GetPileSepGroupReasonAPI(u8 index)
//输入参数	: index:需切除组序列索引号
//输出参数	: 需要切除的电池组切除原因
//函数功能	: 获取电池堆需要切除的电池组切除原因
//注意事项	: 
//=============================================================================================
u8 GetPileSepGroupReasonAPI(u8 index);

#endif
#endif
