/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileProtect.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控故障保护控制任务模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILEPROTECT_H
#define _PILEPROTECT_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define	BSU_EXP_PRO_MAX_TIMES       3               //故障保护最大连续保护次数(10min内)

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
typedef enum 
{
    eBsuProSort_ChgLim = 0, //充电限制保护(产生充电限制故障,达到延时后请求保护但不执行保护)
    eBsuProSort_DhgLim = 1, //放电限制保护(产生放电限制故障,达到延时后请求保护但不执行保护)
    eBsuProSort_ChgFst = 2, //充电瞬时保护(产生充电过流4级故障,立即请求保护同时执行保护)
    eBsuProSort_DhgFst = 3, //放电短路保护(产生放电过流4级故障,立即请求保护同时执行保护)
    eBsuProSort_ChgPro = 4, //充电保护(产生充电保护故障且继续充电,先请求保护达到延时后执行保护)
    eBsuProSort_DhgPro = 5, //放电保护(产生放电保护故障且继续放电,先请求保护达到延时后执行保护)
    eBsuProSort_SysPro = 6, //充放电保护(产生充放电保护故障,先请求保护达到延时后执行保护)
    eBsuProSort_SysErr = 7, //系统故障保护(产生系统保护故障或系统状态故障,先请求保护达到延时后执行保护)
    
    eBsuProSort_Num
}e_BsuExpProSort;           //异常保护类型

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//=============================================================================================
//函数名称	: void PileSysProCtrlInit(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 电池堆故障告警保护控制初始化
//注意事项	: 
//=============================================================================================
void PileSysProCtrlInit(void);

//=============================================================================================
//函数名称	: void PileSysProCtrlTask(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 电池堆故障告警保护控制任务
//注意事项	: 100ms
//=============================================================================================
void PileSysProCtrlTask(void);

//=============================================================================================
//函数名称	: void TacClrPileProFlagAPI(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 清除电池堆系统故障告警保护标志
//注意事项	: 
//=============================================================================================
void TacClrPileProFlagAPI(void);

//=============================================================================================
//函数名称	: u8 GetPileAskChgProState(void)
//输入参数	: void 
//输出参数	: 电池堆充电请求保护状态:0:不请求保护 1:请求保护
//函数功能	: 获得电池堆充电请求保护状态
//注意事项	: 
//=============================================================================================
u8 GetPileAskChgProState(void);

//=============================================================================================
//函数名称	: u8 GetPileAskDhgProState(void)
//输入参数	: void 
//输出参数	: 电池堆放电请求保护状态:0:不请求保护 1:请求保护
//函数功能	: 获得电池堆放电请求保护状态
//注意事项	: 
//=============================================================================================
u8 GetPileAskDhgProState(void);

//=============================================================================================
//函数名称	: u8 GetPileAskSysProState(void)
//输入参数	: void 
//输出参数	: 电池堆充放电请求保护状态:0:不请求保护 1:请求保护
//函数功能	: 获得电池堆请求充放电保护状态
//注意事项	: 同时有充电保护和放电保护
//=============================================================================================
u8 GetPileAskSysProState(void);

//=============================================================================================
//函数名称	: u16 TacGetPileHappenProFlagAPI(void)
//输入参数	: void 
//输出参数	: 按位表示电池堆已产生系统保护的故障告警: bit0:充电限制保护 bit1:放电限制保护 bit2:充电异常保护 bit3:放电异常保护 bit4:充电瞬时保护 bit5:放电保护故障保护 (0:正常 1:产生保护)
//函数功能	: 获得电池堆系统产生的故障保护标志 
//注意事项	: 已执行的保护
//=============================================================================================
u16 TacGetPileHappenProFlagAPI(void);

#endif
#endif
