/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CellAFESamp.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 单体电压采样模块
** @Instructions :
**===========================================================================================*/
#ifndef _CellAFESAMP_H
#define _CellAFESAMP_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypedef.h"
#include "PublicInfo.h"
#include "GroupInfo.h"

#if(0 == BMU_BSU_COM_TYPE)/*菊花链单体采样方式*/
/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define AFE_TYPE_CHOICE     (1)     /*AFE类型 0:BF8915A 1:LTC6813  */

#define MAXVOLTNUM          18      /*电池节数*/
#define MAXTEMPNUM          4       /*温度节数*/
#define FILTER_NUM          4       /*滤波次数*/
#define LTC_RD_AD_T         3       /*读1个LTC6813芯片AD需要的时间(菊花链通信时间) 1ms*/
#define LTC_GPIO_CT_AD_BIT  0x0F    /*LTC6813芯片GPIO通道采单体温度AD值对应通道Bit位*/

/*采样参数配置*/
#define CEL_T_TAB_LEN       167     /*电池单体温度表长度(-41~126℃)*/
#define BAL_T_TAB_LEN       167     /*均衡板温温度表长度(-41~126℃)*/

#define MAX_LTC6813_NUM     20      /*菊花链上从件个数*/

#define SAMPE_ERR_TIMES     15      /*采样应答错误超时次数*/

#define CELF_COMP_VOLT      23      /*首节单体补偿电压值 0.1mV*/
#define CELM_COMP_VOLT      23      /*中间单体补偿电压值 0.1mV*/
#define CELE_COMP_VOLT      25      /*尾节单体补偿电压值 0.1mV*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void CellLTC6813Init(void)
** @Input     : void
** @Output    : void
** @Function  : 初始化6813配置寄存器所需的变量
** @The notes :
**===========================================================================================*/
void CellLTC6813Init(void);

/*=============================================================================================
** @Name      : void CellInfoSampleTask(void *p)
** @Input     : *p:形参,任务函数参数需要
** @Output    : void
** @Function  : 单体电压、温度采样任务
** @The notes :
**===========================================================================================*/
void CellInfoSampleTask(void *p);
#endif

/*=============================================================================================
** @Name      : void WriteSampCellVoltHook(u8 ic_Num, u8 num, u16 volt)
** @Input     : ic_Num:第几个从控[0,31]  num:单体电池号 volt:单节电压值 1mv
** @Output    : void
** @Function  : 输出单节电压采样值
** @The notes : 用户将输出值放到单体寄存器保存
**===========================================================================================*/
void WriteSampCellVoltHook(u8 ic_Num, u8 num, u16 volt);

/*=============================================================================================
** @Name      : void WriteSampCellTempHook(u8 ic_Num, u8 num, s16 temp)
** @Input     : ic_Num:第几个从控[0,31] num:单体温度序号[0,3] temp:单节温度值 1℃
** @Output    : void
** @Function  : 输出单体电池温度采样值
** @The notes : 用户将输出值放到单体寄存器保存
**===========================================================================================*/
void WriteSampCellTempHook(u8 ic_Num, u8 num, s16 temp);

/*=============================================================================================
** @Name      : void WriteSampBalanTempHook(u8 ic_Num, u8 num, s16 temp)
** @Input     : ic_Num:第几个从控[0,31] num:均衡板温序号[0,1] temp:均衡板温值 1℃
** @Output    : void
** @Function  : 输出均衡板温温度采样值
** @The notes : 用户将输出值放到单体寄存器保存
**===========================================================================================*/
void WriteSampBalanTempHook(u8 ic_Num, u8 num, s16 temp);

/*=============================================================================================
** @Name      : static void ClrSampCellVoltHook(u8 ic_Num)
** @Input     : ic_Num:第几个从控[0,31]
** @Output    : void
** @Function  : 清除清除指定从控AFE所有单体电压采样值为0
** @The notes : AFE单体电压采样失效或CAN通信中断超时时调用
**===========================================================================================*/
void ClrSampCellVoltHook(u8 ic_Num);

/*=============================================================================================
** @Name      : void ClrSampCellTempHook(u8 ic_Num)
** @Input     : ic_Num:第几个从控[0,31]
** @Output    : void
** @Function  : 清除指定从控AFE所有单体温度和均衡板温温度采样值为0
** @The notes : AFE单体电压温度采样失效或CAN通信中断超时时调用
**===========================================================================================*/
void ClrSampCellTempHook(u8 ic_Num);

/*=============================================================================================
** @Name      : void ClrSampCellResisHook(u8 ic_Num)
** @Input     : ic_Num:第几个从控[0,31]
** @Output    : void
** @Function  : 清除指定从控AFE所有单体内阻采样值为0
** @The notes : CAN通信中断超时时调用
**===========================================================================================*/
void ClrSampCellResisHook(u8 ic_Num);

/*=============================================================================================
** @Name      : void WriteCellVSampFinFlagHook(u8 flag)
** @Input     : flag:完成标志 0未完成 1完成
** @Output    : void
** @Function  : 输出单节电压采样第一遍完成标志
** @The notes : 菊花链或CAN通信接收完成
**===========================================================================================*/
void WriteCellVSampFinFlagHook(u8 flag);

/*=============================================================================================
** @Name      : void WriteCellTSampFinFlagHook(u8 flag)
** @Input     : flag:完成标志 0未完成 1完成
** @Output    : void
** @Function  : 输出单节温度采样第一遍完成标志
** @The notes : 菊花链或CAN通信接收完成
**===========================================================================================*/
void WriteCellTSampFinFlagHook(u8 flag);

/*=============================================================================================
** @Name      : void WriteCellRSampFinFlagHook(u8 flag)
** @Input     : flag:完成标志 0未完成 1完成
** @Output    : void
** @Function  : 输出单体内阻采样第一遍完成标志
** @The notes : CAN通信接收完成
**===========================================================================================*/
void WriteCellRSampFinFlagHook(u8 flag);

/*=============================================================================================
** @Name      : void WriteCellRSampRequireFlagHook(u8 flag)
** @Input     : flag:采集需求标志 0不需要 1需要
** @Output    : void
** @Function  : 输出单体内阻采样需求标志
** @The notes : CAN通信接收修改
**===========================================================================================*/
void WriteCellRSampRequireFlagHook(u8 flag);

/*=============================================================================================
** @Name      : void WriteCellRSampIndexHook(u16 index)
** @Input     : index:电池采集内阻序号
** @Output    : void
** @Function  : 输出单体内阻采样序号
** @The notes : CAN通信接收修改
**===========================================================================================*/
void WriteCellRSampIndexHook(u16 index);

/*=============================================================================================
** @Name      : void WriteAfeStateSampRequireFlagHook(u8 flag)
** @Input     : flag:采集需求标志 0不需要 1需要
** @Output    : void
** @Function  : 输出Afe状态采样需求标志
** @The notes : CAN通信接收修改
**===========================================================================================*/
void WriteAfeStateSampRequireFlagHook(u8 flag);

/*=============================================================================================
** @Name      : u8 GetCellVSampFinFlagAPI(void)
** @Input     : void
** @Output    : 完成标志 0未完成 1完成
** @Function  : 获取单节电压采样第一遍完成标志
** @The notes : 菊花链或CAN通信接收完成
**===========================================================================================*/
u8 GetCellVSampFinFlagAPI(void);

/*=============================================================================================
** @Name      : u8 GetCellTSampFinFlagAPI(void)
** @Input     : void
** @Output    : 完成标志 0未完成 1完成
** @Function  : 获取单节温度采样第一遍完成标志
** @The notes : 菊花链或CAN通信接收完成
**===========================================================================================*/
u8 GetCellTSampFinFlagAPI(void);

//by lxr01202
/*=============================================================================================
** @Name      : void WriteCellRSampFinFlagHook(u8 flag)
** @Input     : flag:完成标志 0未完成 1完成
** @Output    : void
** @Function  : 输出单体内阻采样第一遍完成标志
** @The notes : CAN通信接收完成
**===========================================================================================*/
void WriteCellRSampFinFlagHook(u8 flag);

//by lxr01202
/*=============================================================================================
** @Name      : u8 GetCellRSampRealFinFlagAPI(void)
** @Input     : void
** @Output    : 完成标志 0未完成 1完成
** @Function  : 获取单体内阻采样第一遍完成标志
** @The notes : CAN通信接收完成
**===========================================================================================*/
u8 GetCellRSampRealFinFlagAPI(void);

/*=============================================================================================
** @Name      : u8 GetCellRSampImagFinFlagAPI(void)
** @Input     : void
** @Output    : 完成标志 0未完成 1完成
** @Function  : 获取单体内阻采样第一遍完成标志
** @The notes : CAN通信接收完成
**===========================================================================================*/
u8 GetCellRSampImagFinFlagAPI(void);

/*=============================================================================================
** @Name      : void WriteCellRSampRealFinFlagHook(u8 flag)
** @Input     : flag:完成标志 0未完成 1完成
** @Output    : void
** @Function  : 输出单体内阻实部采样第一遍完成标志
** @The notes : CAN通信接收完成
**===========================================================================================*/
void WriteCellRSampRealFinFlagHook(u8 flag);

/*=============================================================================================
** @Name      : void WriteCellRSampImagFinFlagHook(u8 flag)
** @Input     : flag:完成标志 0未完成 1完成
** @Output    : void
** @Function  : 输出单体内阻虚部采样第一遍完成标志
** @The notes : CAN通信接收完成
**===========================================================================================*/
void WriteCellRSampImagFinFlagHook(u8 flag);

/*=============================================================================================
** @Name      : u8 GetCellRSampFinFlagAPI(void)
** @Input     : void
** @Output    : 完成标志 0未完成 1完成
** @Function  : 获取单体内阻采样第一遍完成标志
** @The notes : CAN通信接收完成
**===========================================================================================*/
u8 GetCellRSampFinFlagAPI(void);

/*=============================================================================================
** @Name      : u8 GetCellRSampRequireFlagAPI(void)
** @Input     : void
** @Output    : 需求标志 0不需要 1需要
** @Function  : 获取单体内阻采样需求标志
** @The notes : 需求查询
**===========================================================================================*/
u8 GetCellRSampRequireFlagAPI(void);

/*=============================================================================================
** @Name      : u16 GetCellRSampIndexAPI(void)
** @Input     : void
** @Output    : 采样内阻序号
** @Function  : 获取单体内阻采样序号
** @The notes : 内阻采样序号查询
**===========================================================================================*/
u16 GetCellRSampIndexAPI(void);

/*=============================================================================================
** @Name      : u8 GetAfeStateSampRequireFlagAPI(void)
** @Input     : void
** @Output    : 需求标志 0不需要 1需要
** @Function  : 获取Afe状态采样需求标志
** @The notes : 需求查询
**===========================================================================================*/
u8 GetAfeStateSampRequireFlagAPI(void);
#endif
