/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : PileInfo.c
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     :
** @Instructions :
**===========================================================================================*/

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypeDef.h"
#include "PublicPara.h"
#include "GroupPara.h"
#include "PilePara.h"
#include "PublicInfo.h"
#include "GroupInfo.h"
#include "PileInfo.h"

#if(1 == PILE_MANAG_EN)
/*=============================================================================================
** @Global variable definition
**===========================================================================================*/
u16 gPSysStateInfo_50[PINDEX50_LEN] =		/*系统状态信息数组*/
{
	0,		/*系统保护状态[0,5]		0:未就绪 1:正常 2:充电截止 3:放电截止 4:充放电限制 5:充放电保护*/
	0,		/*系统工作状态[0,6]		0:开机,1:待命,2:启动,3:运行,4:停机,5:故障 6:关机*/
	0,		/*电池充放电状态[0,2]	0:空闲 1:充电 2:放电*/
	0		/*系统工作模式[0,5]		0:自动 1:手动 2:紧急 5:调试*/
};

u16 gPLimCPInfo_51[PINDEX51_LEN] =			/*电流功率限值数组*/
{
	0,		/*最大允许充电电流限值(PCS充电输入最大电流)[0,10000]0.1A*/
	0,		/*最大允许放电电流限值(PCS放电输出最大电流)[0,10000]0.1A*/
	0,		/*最大允许充电功率限值(PCS充电输入最大功率)[0,10000]0.1kW*/
	0,		/*最大允许放电功率限值(PCS放电输出最大功率)[0,10000]0.1kW*/
};

u16 gPLimVInfo_52[PINDEX52_LEN] =			/*电压限值信息数组*/
{
	0,		/*最大允许充电电压限值(PCS充电截止电压)[0,10000]0.1V*/
	0		/*最大允许放电电压限值(PCS放电截止电压)[0,10000]0.1V*/
};

u16 gPAlarmInfo_53[PINDEX53_LEN] =			/*告警信息数组*/
{
	0,		/*电池组告警信息1*/
	0,		/*电池组告警信息2*/
	0,		/*电池组告警信息3*/
	0		/*电池组告警信息4*/
};

u16 gPFaultInfo_54[PINDEX54_LEN] = 			/*故障信息数组*/
{
	0,		/*系统告警信息1*/
	0,		/*系统告警信息2*/
	0,		/*系统告警信息3*/
	0		/*系统告警信息4*/
};

u16 gPNotesInfo_55[PINDEX55_LEN] = 			/*提示信息数组*/
{
	0,		/*系统提示信息1*/
	0,		/*系统提示信息2*/
	0,		/*系统提示信息3*/
	0		/*系统提示信息4*/
};

u16 gPGroupState_57[PINDEX57_LEN] = 		/*电池组状态信息数组*/
{
	0,		/*激活的电池组(按位表示电池组:0:禁用 1:激活)*/
	0,		/*可用的电池组(按位表示电池组:0:异常 1:可用)*/
	0,		/*运行的电池组(按位表示电池组:0:离线 1:运行)*/
	0		/*故障的电池组(按位表示电池组:0:非故障 1:故障)*/
};

s16 gPSysMainInfo_60[PINDEX60_LEN] =		/*系统整体信息数组*/
{
	0,		/*系统总电压值[0,10000]0.1V*/
	0,		/*系统总电流值[-30000,30000]0.1A*/
	0,		/*系统输出功率值[-30000,30000]0.1kW*/
	0		/*系统外端电压值[0,10000]0.1V*/
};

u16 gPSysCapInfo_61[PINDEX61_LEN] =			/*系统电量信息数组*/
{
	0,		/*电池SOC值[0,1000]0.1%*/
	0,		/*电池SOE值[0,1000]0.1%*/
	0,		/*电池SOH值[0,1000]0.1%*/
	0		/*系统总容量[0,1000]0.1%*/
};

u16 gPVoltCharInfo_62[PINDEX62_LEN] = 		/*电压特征信息(最大值)数组*/
{
	1,		/*单体最大电压组号[1,16]*/
	1,		/*单体最大电压序号[1,400]*/
	0,		/*单体最大电压值[0,5000]1mV*/
	0		/*单体总压平均值[0,10000]0.1V*/
};

u16 gPVoltCharInfo_63[PINDEX63_LEN] = 		/*电压特征信息(最小值)数组*/
{
	1,		/*单体最小电压组号[1,16]*/
	1,		/*单体最小电压序号[1,400]*/
	0,		/*单体最小电压值[0,5000]1mV*/
	0		/*单体平均电压值[0,5000]1mV*/
};

s16 gPTempCharInfo_64[PINDEX64_LEN] = 		/*温度特征信息(最大值)数组*/
{
	1,		/*单体最高温度组号[1,16]*/
	1,		/*单体最高温度序号[1,400]*/
	0,		/*单体最高温度值[-40,125]1℃*/
	0		/*系统平均温度值[-40,125]1℃*/
};

s16 gPTempCharInfo_65[PINDEX65_LEN] = 		/*温度特征信息(最小值)数组*/
{
	1,		/*单体最低温度组号[1,16]*/
	1,		/*单体最低温度序号[1,400]*/
	0,		/*单体最低温度值[-40,125]1℃*/
	0		/*系统环境温度值[-40,125]1℃*/
};

u16 gPSumVCharInfo_66[PINDEX66_LEN] =		/*总压特征信息数组*/
{
	1,		/*最大总压组号[1,16]*/
	0,		/*最大总压值[0,10000]0.1V*/
	1,		/*最小总压组号[1,16]*/
	0		/*最小总压值[0,10000]0.1V*/
};

s16 gPCurrCharInfo_67[PINDEX67_LEN] =		/*电流特征信息数组*/
{
	1,		/*最大电流组号[1,16]*/
	0,		/*最大电流值[-30000,30000]0.1A*/
	1,		/*最小电流组号[1,16]*/
	0		/*最小电流值[-30000,30000]0.1A*/
};

u16 gPStatistTime_70[PINDEX70_LEN] = 		/*时间统计信息数组*/
{
	0,		/*系统运行时长[0,65535]1Hour*/
	0,		/*可充电时间[0,65535]1Min*/
	0,		/*可放电时间[0,65535]1Min*/
	0		/*充放电循环次数[0,65535]1次*/
};

u16 gPStatistErr_71[PINDEX71_LEN] = 		/*故障统计信息数组*/
{
	0,		/*系统单月告警数目[0,65535]*/
	0,		/*系统单月故障数目[0,65535]*/
	0,		/*系统累计告警数目[0,65535]*/
	0		/*系统累计故障数目[0,65535]*/
};

u16 gPStatistCapEner_72[PINDEX72_LEN] =		/*当前能量统计信息数组*/
{
	0,		/*系统剩余电能[0,65535]0.1kWh*/
	0,		/*系统总电能[0,65535]0.1kWh*/
	0,		/*系统单次充电电量[0,65535]1AH*/
	0		/*系统单次放电电量[0,655351]AH*/
};

u32 gPStatistHisCap_73[PINDEX73_LEN] =		/*累计电量统计信息数组*/
{
	0,		/*系统累计充电电量[0,65535]1AH*/
	0		/*系统累计放电电量[0,65535]1AH*/
};

u32 gPStatistHisEner_74[PINDEX74_LEN] =		/*累计电能统计信息数组*/
{
	0,		/*系统累计充电电能[0,65535]0.1kWh*/
	0		/*系统累计放电电能[0,65535]0.1kWh*/
};

u16 gPStatistDhgDeep_75[PINDEX75_LEN] =		/*放电深度统计信息数组*/
{
	0		/*电池组当前放电深度[0,1000] 0.1%*/
};

u16 gPAuthorInfo_80[PINDEX80_LEN] = 		/*权限级别状态信息数组*/
{
	0,		/*当前密码权限H		用户级别:0:普通用户,1:运维用户, 2:高级用户 3:超级用户*/
	0		/*当前密码权限L		启用可写端口:0-4:CAN口 5-9:RS485*/
};

u16 gPDebugResult_82[PINDEX82_LEN] =		/*调试结果状态信息数组*/
{
	0,		/*调试类型	0:从控均衡调试 1:从控接触器调试 2:从控输出干接点调试 3:从控EEPROM读写调试 4:主控内控输出端口调试 5:主控接触器调试 6:主控输出干接点调试 7:主控EEPROM读写调试*/
	0,		/*调试主控编号	0:所有主控 [1,16]:主控编号*/
	0,		/*调试从控编号	0:所有从控 [1,32]:从控编号*/
	0,		/*调试端口号/均衡类型/EEPROM地址	"输出IO/接触器/LED调试:0:所有端口 [1,6]:端口编号;均衡调试:0:禁止均衡 1:主动均衡 2:被动均衡;EEPROM读写调试:[0,65535]:EEPROM地址"*/
	0,		/*调试状态/EEPROM数据类型	"输出IO/接触器/LED调试:0:分 1:合;均衡调试:0:关闭均衡 1:充电均衡 2:放电均衡;EEPROM读写调试:0:8位数据 1:16位数据 2:32位数据"*/
	0,		/*调试写EEPROM参数值低16位	"均衡调试:按位表示开均衡电池;EEPROM读写调试:32位数据低16位"*/
	0,		/*调试写EEPROM参数值高16位	32位数据高16位*/
	0,		/*调试读EEPROM参数值低16位	32位数据低16位*/
	0,		/*调试读EEPROM参数值高16位	32位数据高16位*/
	0		/*调试结果	0:未调试 1:调试成功 2:非调试模式 3:调试参数错误 4：通讯失败*/
};

u16 gPAuthorCtrl_85[PINDEX85_LEN] =			/*权限密码登录信息数组*/
{
	0,		/*权限密码H		用户级别*/
	0		/*权限密码L		密码校对*/
};

u16 gPSysCmdCtrl_86[PINDEX86_LEN] =			/*系统控制命令信息数组*/
{
	0,		/*工作状态控制	0:正常停止 1:正常预充 2:正常启动 3:充电启动 4:放电启动 5:强制停机 6:紧急停机 7:下电关机 8:上电开机*/
	0,		/*工作模式控制	0:自动 1:手动 2:紧急 5:调试*/
	0		/*系统清除命令	1:清除当前故障 2:清除历史故障 3:清除故障数目 4:清除运行计时 5:清除累计电量 6:清除故障记录 7:清除事件记录  8:清除故障录波 9:清除数据记录 10:恢复出厂设置*/
};

u16 gPUserCtrl_87[PINDEX87_LEN] =			/*用户控制命令信息数组*/
{
	0,		/*单体信息触发命令	"每bit(0-退出,1-触发):bit0:单体电压信息触发;bit1:单体温度信息触发;bit2:单体均衡状态信息触发."*/
	0,		/*内部报文转发命令	0-不触发不转发,1-触发内部协议 2-转发内部报文 3-全部触发转发*/
	0,		/*历史故障切换命令	0-最新记录,[1,30]-指定日期记录,91-下一页记录, 92-前一页记录*/
	0		/*历史事件切换命令	0-最新记录,[1,30]-指定日期记录,91-下一页记录, 92-前一页记录*/
};

u16 gPDebugCtrl_88[PINDEX88_LEN] =			/*系统调试命令信息数组*/
{
	0,		/*调试类型	0:从控均衡调试 1:从控接触器调试 2:从控输出干接点调试 3:从控EEPROM读写调试 4:主控内控输出端口调试 5:主控接触器调试 6:主控输出干接点调试 7:主控EEPROM读写调试*/
	0,		/*调试主控编号	0:所有主控 [1,16]:主控编号*/
	0,		/*调试从控编号	0:所有从控 [1,32]:从控编号*/
	0,		/*调试端口号/均衡类型/EEPROM地址	"输出口/接触器调试:0:所有端口 [1,11]:端口编号;均衡调试:0:禁止均衡 1:主动均衡 2:被动均衡;EEPROM读写调试:[0,65535]:EEPROM地址"*/
	0,		/*调试状态/EEPROM数据类型	"输出口/接触器调试:0:分 1:合;均衡调试:0:关闭均衡 1:充电均衡 2:放电均衡;EEPROM读写调试:0:8位数据 1:16位数据 2:32位数据"*/
	0,		/*调试写EEPROM参数值低16位	32位数据低16位*/
	0,		/*调试写EEPROM参数值高16位	32位数据高16位*/
	0		/*调试确认命令	1:确认调试/确认读EEPROM参数 2:确认写EEPROM参数*/
};

/*以下是堆控接收电池组信息*/
u16 gGSysStateInfo_500[PILE_RCV_G_NUM][GINDEX50_LEN] =		/*系统状态信息数组*/
{{
	0,		/*系统保护状态[0,5]		0:未就绪 1:正常 2:充电截止 3:放电截止 4:充放电限制 5:充放电保护*/
	0,		/*系统工作状态[0,6]		0:开机,1:待命,2:启动,3:运行,4:停机,5:故障 6:关机*/
	0,		/*电池充放电状态[0,2]	0:空闲 1:充电 2:放电*/
	0		/*系统工作模式[0,5]		0:自动 1:手动 2:紧急 5:调试*/
}};

u16 gGLimCPInfo_510[PILE_RCV_G_NUM][GINDEX51_LEN] =			/*电流功率限值数组*/
{{
	0,		/*最大允许充电电流限值(PCS充电输入最大电流)[0,10000]0.1A*/
	0,		/*最大允许放电电流限值(PCS放电输出最大电流)[0,10000]0.1A*/
	0,		/*最大允许充电功率限值(PCS充电输入最大功率)[0,10000]0.1kW*/
	0,		/*最大允许放电功率限值(PCS放电输出最大功率)[0,10000]0.1kW*/
}};

u16 gGLimVInfo_520[PILE_RCV_G_NUM][GINDEX52_LEN] =			/*电压限值信息数组*/
{{
	0,		/*最大允许充电电压限值(PCS充电截止电压)[0,10000]0.1V*/
	0		/*最大允许放电电压限值(PCS放电截止电压)[0,10000]0.1V*/
}};

u16 gGAlarmInfo_530[PILE_RCV_G_NUM][GINDEX53_LEN] =			/*告警信息数组*/
{{
	0,		/*电池告警信息1*/
	0,		/*电池告警信息2*/
	0		/*电池告警信息3*/
}};

u16 gGFaultInfo_540[PILE_RCV_G_NUM][GINDEX54_LEN] = 		/*故障信息数组*/
{{
	0,		/*电池故障信息1*/
	0,		/*电池故障信息2*/
	0		/*电池故障信息3*/
}};

u16 gGErrDetail_550[PILE_RCV_G_NUM][GINDEX55_LEN] = 		/*故障定位信息数组*/
{{
	0,		/*定位故障码*/
	0		/*定位故障详情*/
}};

u16 gGPortStateInfo_560[PILE_RCV_G_NUM][GINDEX56_LEN] =		/*输入输出口状态信息数组*/
{{
	0,		/*输入端口回检状态*/
	0,		/*输出端口控制状态*/
	0,		/*内部输入回检状态*/
	0		/*内部输出控制状态*/
}};

s16 gGSysMainInfo_600[PILE_RCV_G_NUM][GINDEX60_LEN] =		/*系统整体信息数组*/
{{
	0,		/*总电压采样值[0,10000]0.1V*/
	0,		/*总电流采样值[-30000,30000]0.1A*/
	0,		/*输出功率值[-30000,30000]0.1kW*/
	0		/*预充电压值[0,10000]0.1V*/
}};

u16 gGSysCapInfo_610[PILE_RCV_G_NUM][GINDEX61_LEN] =		/*系统电量信息数组*/
{{
	0,		/*电池SOC值[0,1000]0.1%*/
	0,		/*电池SOE值[0,1000]0.1%*/
	0,		/*电池SOH值[0,1000]0.1%*/
	0		/*电池组总容量[0,1000]0.1%*/
}};

s16 gGSysCellInfo_620[PILE_RCV_G_NUM][GINDEX62_LEN] = 		/*系统单体信息数组*/
{{
	0,		/*单体总电压值[0,10000]0.1V*/
	0,		/*单体平均电压值[0,5000]1mV*/
	0,		/*单体平均温度值[-40,105]1℃*/
	0		/*系统环境温度值[-40,105]1℃*/
}};

u16 gGVoltCharInfo_630[PILE_RCV_G_NUM][GINDEX63_LEN] = 	/*电压特征信息数组*/
{{
	0,		/*单体最大电压序号[1,400]*/
	0,		/*单体最大电压值[0,5000]1mV*/
	0,		/*单体最小电压序号[1,400]*/
	0		/*单体最小电压值[0,5000]1mV*/
}};

s16 gGTempCharInfo_640[PILE_RCV_G_NUM][GINDEX64_LEN] = 	/*温度特征信息数组*/
{{
	0,		/*单体最高温度序号[1,400]*/
	0,		/*单体最高温度值[-40,105]1℃*/
	0,		/*单体最低温度序号[1,400]*/
	0		/*单体最低温度值[-40,105]1℃*/
}};

u16 gGStatistTime_700[PILE_RCV_G_NUM][GINDEX70_LEN] = 		/*时间统计信息数组*/
{{
	0,		/*系统运行时长[0,65535]1Hour*/
	0,		/*可充电时间[0,65535]1Min*/
	0,		/*可放电时间[0,65535]1Min*/
	0		/*充放电循环次数[0,65535]1次*/
}};

u16 gGStatistErr_710[PILE_RCV_G_NUM][GINDEX71_LEN] = 		/*故障统计信息数组*/
{{
	0,		/*单月告警数目[0,65535]*/
	0,		/*单月故障数目[0,65535]*/
	0,		/*累计告警数目[0,65535]*/
	0		/*累计故障数目[0,65535]*/
}};

u16 gGStatistCapEner_720[PILE_RCV_G_NUM][GINDEX72_LEN] =	/*当前能量统计信息数组*/
{{
	0,		/*电池组剩余电能[0,65535]0.1kWh*/
	0,		/*电池组总电能[0,65535]0.1kWh*/
	0,		/*电池组单次充电电量[0,65535]1AH*/
	0		/*电池组单次放电电量[0,655351]AH*/
}};

u32 gGStatistHisCap_730[PILE_RCV_G_NUM][GINDEX73_LEN] =		/*累计电量统计信息数组*/
{{
	0,		/*电池组累计充电电量[0,65535]1AH*/
	0		/*电池组累计放电电量[0,65535]1AH*/
}};

u32 gGStatistHisEner_740[PILE_RCV_G_NUM][GINDEX74_LEN] =	/*累计电能统计信息数组*/
{{
	0,		/*电池组累计充电电能[0,65535]0.1kWh*/
	0		/*电池组累计放电电能[0,65535]0.1kWh*/
}};

u16 gGStatistDhgDeep_750[PILE_RCV_G_NUM][GINDEX75_LEN] =	/*放电深度统计信息数组*/
{{
	0		/*电池组当前放电深度[0,1000] 0.1%*/
}};

u16 gGAuthorInfo_800[PILE_RCV_G_NUM][GINDEX80_LEN] = 		/*权限级别状态信息数组*/
{{
	0,		/*当前密码权限H		用户级别:0:普通用户,1:运维用户, 2:高级用户 3:超级用户*/
	0		/*当前密码权限L		启用可写端口:0-4:CAN口 5-9:RS485*/
}};

u16 gGCtrlResult_810[PILE_RCV_G_NUM][GINDEX81_LEN] =		/*控制结果状态信息数组*/
{{
	0,		/*粘连检测控制结果	0:自动检测 1:正在检测 2:检测完成*/
	0		/*绝缘检测控制结果	0:自动检测 1:正在检测 2:检测完成*/
}};

u16 gGDebugResult_820[PILE_RCV_G_NUM][GINDEX82_LEN] =		/*调试结果状态信息数组*/
{{
	0,		/*调试类型	0:从控均衡调试 1:从控接触器调试 2:从控输出干接点调试 3:从控EEPROM读写调试 4:主控内控输出端口调试 5:主控接触器调试 6:主控输出干接点调试 7:主控EEPROM读写调试*/
	0,		/*调试主控编号	0:所有主控 [1,16]:主控编号*/
	0,		/*调试从控编号	0:所有从控 [1,32]:从控编号*/
	0,		/*调试端口号/均衡类型/EEPROM地址	"输出IO/接触器/LED调试:0:所有端口 [1,6]:端口编号;均衡调试:0:禁止均衡 1:主动均衡 2:被动均衡;EEPROM读写调试:[0,65535]:EEPROM地址"*/
	0,		/*调试状态/EEPROM数据类型	"输出IO/接触器/LED调试:0:分 1:合;均衡调试:0:关闭均衡 1:充电均衡 2:放电均衡;EEPROM读写调试:0:8位数据 1:16位数据 2:32位数据"*/
	0,		/*调试写EEPROM参数值低16位	"均衡调试:按位表示开均衡电池;EEPROM读写调试:32位数据低16位"*/
	0,		/*调试写EEPROM参数值高16位	32位数据高16位*/
	0,		/*调试读EEPROM参数值低16位	32位数据低16位*/
	0,		/*调试读EEPROM参数值高16位	32位数据高16位*/
	0		/*调试结果	0:未调试 1:调试成功 2:非调试模式 3:调试参数错误 4：通讯失败*/
}};

extern u16 gSysGenParaRO_100[];  			/*系统通用参数设置*/
extern u16 gPSmuGenParaR_102[];  			/*堆控通用参数值*/
extern u16 gGBmuGenPara_102[];  			/*主控通用参数值*/

/*=============================================================================================
** @Static function declaration
**===========================================================================================*/

/*=============================================================================================
** @Interface function definition
**===========================================================================================*/
//=============================================================================================
//函数名称	: u8 GetPileSelfStackIdAPI(void)
//输入参数	: void
//输出参数	: 堆控自身所在电池堆序号[0,9]
//函数功能	: 获取堆控自身所在电池堆序号
//注意事项	: 第几个电池堆号
//=============================================================================================
u8 GetPileSelfStackIdAPI(void)
{
    u8 unit = 0;

    if((gPSmuGenParaR_102[eSmuGenPara102_SmuDev] >= SMU_BAS_DEVADDR))
    {
    	unit = (u8)(gPSmuGenParaR_102[eSmuGenPara102_SmuDev] - SMU_BAS_DEVADDR);
    }
    else
    {
    	unit = 0xff;
    }

    return(unit);
}

//=============================================================================================
//函数名称	: u8 ChangPileGAddrToSIdAPI(u8 addr)
//输入参数	: addr:电池组设备地址[50,65]
//输出参数	: 电池组设备号对应的电池堆序号[0, 9]
//函数功能	: 转化电池组设备地址所在的电池堆序号
//注意事项	:
//=============================================================================================
u8 ChangPileGAddrToSIdAPI(u8 addr)
{
    u16 unit = 0;

    //设备地址有效
    if((addr >= BMU_BAS_DEVADDR) && (addr < SMU_BAS_DEVADDR)
    	&& (gSysGenParaRO_100[eSGenPara100_AllGNum] > 0))
    {
        //计算对应电池堆序号
    	unit = (addr - BMU_BAS_DEVADDR) / gSysGenParaRO_100[eSGenPara100_AllGNum];
    }
    //输入设备地址无效
    else
    {
        //组号无效
    	unit = 0xff;
    }

    return(unit);
}

//=============================================================================================
//函数名称	: u8 ChangPileGIdToGAddrAPI(u8 group)
//输入参数	: group:组号[0,15],0xff:所有组
//输出参数	: 指定电池组对应的设备地址[50,65]
//函数功能	: 转化堆控下指定电池组对应的设备地址
//注意事项	:
//=============================================================================================
u8 ChangPileGIdToGAddrAPI(u8 group)
{
    u16 addr = 0;

    /*所有组返回广播地址*/
    if(0xff == group)
    {
        return(0xff);
    }
    /*组号错误返回最大地址*/
    else if(group >= gSysGenParaRO_100[eSGenPara100_AllGNum])
    {
        return(0xfe);
    }

    //自身主控设备地址超过组数(多个堆内电池组连续编址)
    if(gGBmuGenPara_102[eBmuGenPara102_BmuDev] >= (BMU_BAS_DEVADDR + gSysGenParaRO_100[eSGenPara100_AllGNum]))
    {
    	addr = BMU_BAS_DEVADDR + (GetPileSelfStackIdAPI() * gSysGenParaRO_100[eSGenPara100_AllGNum]) + group;
    }
    else
    {
    	addr = BMU_BAS_DEVADDR + group;
    }

    return(addr);
}

//=============================================================================================
//函数名称	: u8 ChangPileGAddrToGIdAPI(u8 addr)
//输入参数	: addr:电池组设备地址[50,65]
//输出参数	: 电池组设备号对应的组号[0, 15]
//函数功能	: 转化电池组设备地址对应的组号
//注意事项	:
//=============================================================================================
u8 ChangPileGAddrToGIdAPI(u8 addr)
{
    u16 group = 0;

    //设备地址有效
    if((addr >= BMU_BAS_DEVADDR) && (addr < SMU_BAS_DEVADDR)
    	&& (gSysGenParaRO_100[eSGenPara100_AllGNum] > 0))
    {
        //计算对应组号
        group = (addr - BMU_BAS_DEVADDR) % gSysGenParaRO_100[eSGenPara100_AllGNum];
    }
    //输入设备地址无效
    else
    {
        //组号无效
        group = 0xff;
    }

    return(group);
}

//=============================================================================================
//函数名称	: u16 GetPileProStateAPI(void)
//输入参数	: void
//输出参数	: 系统保护状态(0:未就绪 1:正常 2:充电截止 3:放电截止 4:充放电限制 5:充放电保护)
//函数功能	: 获取堆控系统保护状态
//注意事项	:
//=============================================================================================
u16 GetPileProStateAPI(void)
{
    return(gPSysStateInfo_50[ePStateInfo50_SysPro]);
}

//=============================================================================================
//函数名称	: u16 GetPileWorkStateAPI(void)
//输入参数	: void
//输出参数	: 系统工作状态(0:开机 1:待机 2:启动 3:运行 4:停机 5:故障 6:关机)
//函数功能	: 获取堆控系统工作状态
//注意事项	:
//=============================================================================================
u16 GetPileWorkStateAPI(void)
{
    return(gPSysStateInfo_50[ePStateInfo50_SysWor]);
}

//=============================================================================================
//函数名称	: u16 GetPileChgStateAPI(void)
//输入参数	: void
//输出参数	: 系统充放电状态(0:空闲 1:充电 2:放电)
//函数功能	: 获取堆控系统充放电状态
//注意事项	:
//=============================================================================================
u16 GetPileChgStateAPI(void)
{
    return(gPSysStateInfo_50[ePStateInfo50_SysChg]);
}

//=============================================================================================
//函数名称	: u16 GetPileWorkModeAPI(void)
//输入参数	: void
//输出参数	: 系统工作模式(0:自动 1:手动 2:紧急 5:调试)
//函数功能	: 获取堆控系统工作模式
//注意事项	:
//=============================================================================================
u16 GetPileWorkModeAPI(void)
{
    return(gPSysStateInfo_50[ePStateInfo50_SysMod]);
}

//=============================================================================================
//函数名称	: u16 GetPileChgLimCurrAPI(void)
//输入参数	: void
//输出参数	: 充电电流限值(0.1A)
//函数功能	: 获取堆控充电电流限值
//注意事项	:
//=============================================================================================
u16 GetPileChgLimCurrAPI(void)
{
    return(gPLimCPInfo_51[ePLimCPInfo51_ChgC]);
}

//=============================================================================================
//函数名称	: u16 GetPileDhgLimCurrAPI(void)
//输入参数	: void
//输出参数	: 放电电流限值(0.1A)
//函数功能	: 获取堆控放电电流限值
//注意事项	:
//=============================================================================================
u16 GetPileDhgLimCurrAPI(void)
{
    return(gPLimCPInfo_51[ePLimCPInfo51_DhgC]);
}

//=============================================================================================
//函数名称	: u16 GetPileChgLimPowerAPI(void)
//输入参数	: void
//输出参数	: 充电功率限值(0.1KW)
//函数功能	: 获取堆控充电功率限值
//注意事项	:
//=============================================================================================
u16 GetPileChgLimPowerAPI(void)
{
    return(gPLimCPInfo_51[ePLimCPInfo51_ChgP]);
}

//=============================================================================================
//函数名称	: u16 GetPileDhgLimPowerAPI(void)
//输入参数	: void
//输出参数	: 放电功率限值(0.1KW)
//函数功能	: 获取堆控放电功率限值
//注意事项	:
//=============================================================================================
u16 GetPileDhgLimPowerAPI(void)
{
    return(gPLimCPInfo_51[ePLimCPInfo51_DhgP]);
}

//=============================================================================================
//函数名称	: u16 GetPileAlarmInfoAPI(u8 index)
//输入参数	: index:信息子索引[0,5]
//输出参数	: 堆控对应索引告警信息
//函数功能	: 获取堆控告警信息
//注意事项	:
//=============================================================================================
u16 GetPileAlarmInfoAPI(u8 index)
{
	if(index < PINDEX53_LEN)
	{
	    return(gPAlarmInfo_53[index]);
	}

    return(0);
}

//=============================================================================================
//函数名称	: u16 GetPileSampSumVoltAPI(void)
//输入参数	: void
//输出参数	: 电池堆采样总电压 0.1V
//函数功能	: 获取电池堆采样总电压
//注意事项	: 组采样值求平均
//=============================================================================================
u16 GetPileSampSumVoltAPI(void)
{
    return((u16)gPSysMainInfo_60[ePSysMainInfo60_SumV]);
}

//=============================================================================================
//函数名称	: s16 GetPileOutSumCurrAPI(void)
//输入参数	: void
//输出参数	: 电池堆输出总电流 0.1A(负号表示充电)
//功能功能	: 获取电池堆输出总电流
//注意事项	:
//=============================================================================================
s16 GetPileOutSumCurrAPI(void)
{
    return(gPSysMainInfo_60[ePSysMainInfo60_OutC]);
}

//=============================================================================================
//函数名称	: s16 GetPileOutSumPowerAPI(void)
//输入参数	: void
//输出参数	: 电池堆输出总功率 0.1kw(负号表示充电)
//功能功能	: 获取电池堆输出总功率
//注意事项	:
//=============================================================================================
s16 GetPileOutSumPowerAPI(void)
{
    return(gPSysMainInfo_60[ePSysMainInfo60_OutP]);
}

//=============================================================================================
//函数名称	: u16 GetPileGMaxSumVGroupAPI(void)
//输入参数	: void
//输出参数	: 电池堆最大总压电池组号[1,16]
//函数功能	: 获取电池堆最大总压电池组号
//注意事项	:
//=============================================================================================
u16 GetPileGMaxSumVGroupAPI(void)
{
    return(gPSumVCharInfo_66[ePSCharInfo66_MaxSumVG]);
}

//=============================================================================================
//函数名称	: u16 GetPileGMaxSumVoltAPI(void)
//输入参数	: void
//输出参数	: 电池堆最大电池组总压 0.1V
//函数功能	: 获取电池堆最大电池组总压
//注意事项	:
//=============================================================================================
u16 GetPileGMaxSumVoltAPI(void)
{
    return(gPSumVCharInfo_66[ePSCharInfo66_MaxSumVolt]);
}

//=============================================================================================
//函数名称	: u16 GetPileGMinSumVGroupAPI(void)
//输入参数	: void
//输出参数	: 电池堆最小总压电池组号[1,16]
//函数功能	: 获取电池堆最小总压电池组号
//注意事项	:
//=============================================================================================
u16 GetPileGMinSumVGroupAPI(void)
{
    return(gPSumVCharInfo_66[ePSCharInfo66_MinSumVG]);
}

//=============================================================================================
//函数名称	: u16 GetPileGMinSumVoltAPI(void)
//输入参数	: void
//输出参数	: 电池堆最小电池组总压 0.1V
//函数功能	: 获取电池堆最小电池组总压
//注意事项	:
//=============================================================================================
u16 GetPileGMinSumVoltAPI(void)
{
    return(gPSumVCharInfo_66[ePSCharInfo66_MinSumVolt]);
}

//=============================================================================================
//函数名称	: u16 GetPileGMaxOutCurrAPI(void)
//输入参数	: void
//输出参数	: 电池堆最大电池组电流 0.1A
//函数功能	: 获取电池堆最大电池组电流
//注意事项	: 负号表示充电
//=============================================================================================
s16 GetPileGMaxOutCurrAPI(void)
{
    return(gPCurrCharInfo_67[ePCCharInfo67_MaxCurr]);
}

/*=============================================================================================
** @Static function definition
**===========================================================================================*/

#endif
