/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : PileInfo.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     :
** @Instructions :
**===========================================================================================*/
#ifndef FUNTION_SYSTEMINFO_PILEINFO_H_
#define FUNTION_SYSTEMINFO_PILEINFO_H_

#if(1 == PILE_MANAG_EN)
/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define SMU_DEV_ID   			(19013)		/*BMU设备识别码(个位设备类型:0:从控 1:高压模块 2:主控 3:堆控 4:主控辅助芯片)*/
#define SMU_EXT_COM_DEV			(0)			/*堆控外部(上层)通信设备(0:不检测 1:PCS)*/

#define PINDEX50_LEN			(4)			/*系统状态信息数组长度*/
#define PINDEX51_LEN			(4)			/*电流功率限值信息数组长度*/
#define PINDEX52_LEN			(2)			/*电压限值信息数组长度*/
#define PINDEX53_LEN			(4)			/*告警信息数组长度*/
#define PINDEX54_LEN			(4)			/*故障信息数组长度*/
#define PINDEX55_LEN			(4)			/*提示信息数组长度*/
#define PINDEX56_LEN			(4)			/*输入输出口信息数组长度*/
#define PINDEX57_LEN			(4)			/*电池组状态信息数组长度*/
#define PINDEX60_LEN			(4)			/*系统整体信息数组长度*/
#define PINDEX61_LEN			(4)			/*系统电量信息数组长度*/
#define PINDEX62_LEN			(4)			/*电压特征信息(最大值)数组长度*/
#define PINDEX63_LEN			(4)			/*电压特征信息(最小值)数组长度*/
#define PINDEX64_LEN			(4)			/*温度特征信息(最大值)数组长度*/
#define PINDEX65_LEN			(4)			/*温度特征信息(最小值)数组长度*/
#define PINDEX66_LEN			(4)			/*总压特征信息数组长度*/
#define PINDEX67_LEN			(4)			/*电流特征信息数组长度*/
#define PINDEX70_LEN			(4)			/*时间统计信息数组长度*/
#define PINDEX71_LEN			(4)			/*故障统计信息数组长度*/
#define PINDEX72_LEN			(4)			/*当前能量统计信息数组长度*/
#define PINDEX73_LEN			(2)			/*累计电量统计信息数组长度*/
#define PINDEX74_LEN			(2)			/*累计电能统计信息数组长度*/
#define PINDEX75_LEN			(1)			/*放电深度统计信息数组长度*/
#define PINDEX80_LEN			(2)			/*权限级别状态信息数组长度*/
#define PINDEX82_LEN			(10)		/*调试结果状态信息数组长度*/
#define PINDEX83_LEN			(3)			/*校准结果状态信息数组长度*/
#define PINDEX85_LEN			(2)			/*权限密码登录信息数组长度*/
#define PINDEX86_LEN			(3)			/*系统控制命令信息数组长度*/
#define PINDEX87_LEN			(4)			/*用户控制命令信息数组长度*/
#define PINDEX88_LEN			(8)			/*系统调试命令信息数组长度*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*协议50子索引列表*/
typedef enum
{
	ePStateInfo50_SysPro = 0,				/*系统保护状态[0,5]		0:未就绪 1:正常 2:充电截止 3:放电截止 4:充放电限制 5:充放电保护*/
	ePStateInfo50_SysWor = 1,				/*系统工作状态[0,6]		0:开机,1:待命,2:启动,3:运行,4:停机,5:故障 6:关机*/
	ePStateInfo50_SysChg = 2,				/*电池充放电状态[0,2]	0:空闲 1:充电 2:放电*/
	ePStateInfo50_SysMod = 3				/*系统工作模式[0,5]		0:自动 1:手动 2:紧急 5:调试*/

}e_PileStateInfo50;

/*协议51子索引列表*/
typedef enum
{
	ePLimCPInfo51_ChgC = 0,					/*最大允许充电电流限值(PCS充电输入最大电流)[0,10000]0.1A*/
	ePLimCPInfo51_DhgC = 1,					/*最大允许放电电流限值(PCS放电输出最大电流)[0,10000]0.1A*/
	ePLimCPInfo51_ChgP = 2,					/*最大允许充电功率限值(PCS充电输入最大功率)[0,10000]0.1kW*/
	ePLimCPInfo51_DhgP = 3,					/*最大允许放电功率限值(PCS放电输出最大功率)[0,10000]0.1kW*/

}e_PileLimCPInfo_51;

/*协议52子索引列表*/
typedef enum
{
	ePLimVInfo52_ChgV = 0,					/*最大允许充电电压限值(PCS充电截止电压)[0,10000]0.1V*/
	ePLimVInfo52_DhgV = 1					/*最大允许放电电压限值(PCS放电截止电压)[0,10000]0.1V*/

}e_PileLimVInfo_52;

/*协议53子索引列表*/
typedef enum
{
	ePAlarmInfo53_0 = 0,					/*电池告警信息1*/
	ePAlarmInfo53_1 = 1,					/*电池告警信息2*/
	ePAlarmInfo53_2 = 2,					/*电池告警信息3*/
	ePAlarmInfo53_3 = 3						/*电池告警信息4*/

}e_PileAlarmInfo53;

/*协议54子索引列表*/
typedef enum
{
	ePFaultInfo54_0 = 0,					/*电池故障信息1*/
	ePFaultInfo54_1 = 1,					/*电池故障信息2*/
	ePFaultInfo54_2 = 2,					/*电池故障信息3*/
	ePFaultInfo54_3 = 3						/*电池故障信息4*/

}e_PileFaultInfo54;

/*协议57子索引列表*/
typedef enum
{
	ePGroupState57_EnG = 0,					/*激活的电池组*/
	ePGroupState57_NorG = 1,				/*可用的电池组*/
	ePGroupState57_RunG = 2,				/*运行的电池组*/
	ePGroupState57_ErrG = 3					/*故障的电池组*/

}e_PileGroupState57;

/*协议60子索引列表*/
typedef enum
{
	ePSysMainInfo60_SumV = 0,				/*总电压采样值[0,10000]0.1V*/
	ePSysMainInfo60_OutC = 1,				/*总电流采样值[-30000,30000]0.1A*/
	ePSysMainInfo60_OutP = 2,				/*输出功率值[-30000,30000]0.1kW*/
	ePSysMainInfo60_PreV = 3				/*预充电压值[0,10000]0.1V*/

}e_PileMainInfo60;

/*协议61子索引列表*/
typedef enum
{
	ePSysCapInfo61_SOC = 0,					/*电池SOC值[0,1000]0.1%*/
	ePSysCapInfo61_SOE = 1,					/*电池SOE值[0,1000]0.1%*/
	ePSysCapInfo61_SOH = 2,					/*电池SOH值[0,1000]0.1%*/
	ePSysCapInfo61_AllCap = 3				/*电池组总容量[0,1000]0.1AH*/

}e_PileCapInfo61;

/*协议62子索引列表*/
typedef enum
{
	ePVCharInfo62_MaxVG = 0,				/*单体最大电压组号[1,16]*/
	ePVCharInfo62_MaxVNum = 1,				/*单体最大电压序号[1,400]*/
	ePVCharInfo62_MaxVolt = 2,				/*单体最大电压值[0,5000]1mV*/
	ePVCharInfo62_SumVolt = 3		    	/*系统总压平均值[0,10000]0.1V*/

}e_PileVoltCharInfo62;

/*协议63子索引列表*/
typedef enum
{
	ePVCharInfo63_MinVG = 0,				/*单体最小电压组号[1,16]*/
	ePVCharInfo63_MinVNum = 1,				/*单体最小电压序号[1,400]*/
	ePVCharInfo63_MinVolt = 2,				/*单体最小电压值[0,5000]1mV*/
	ePVCharInfo63_AvgVolt = 3		    	/*系统单体平均电压值[0,5000]1mV*/

}e_PileVoltCharInfo63;

/*协议64子索引列表*/
typedef enum
{
	ePTCharInfo64_MaxTG = 0,				/*单体最高温度组号[1,16]*/
	ePTCharInfo64_MaxTNum = 1,				/*单体最高温度序号[1,400]*/
	ePTCharInfo64_MaxTemp = 2,				/*单体最高温度值[-40,125]1℃*/
	ePTCharInfo64_AvgTemp = 3		    	/*系统电池平均温度值[-40,125]1℃*/

}e_PileTempCharInfo64;

/*协议65子索引列表*/
typedef enum
{
	ePTCharInfo65_MinTG = 0,				/*单体最低温度组号[1,16]*/
	ePTCharInfo65_MinTNum = 1,				/*单体最低温度序号[1,400]*/
	ePTCharInfo65_MinTemp = 2,				/*单体最低温度值[-40,125]1℃*/
	ePTCharInfo65_EnvTemp = 3		    	/*系统环境温度值[-40,125]1℃*/

}e_PileTempCharInfo65;

/*协议66子索引列表*/
typedef enum
{
	ePSCharInfo66_MaxSumVG = 0,				/*最大总压组号[1,16]*/
	ePSCharInfo66_MaxSumVolt = 1,			/*最大总压值[0,10000]0.1V*/
	ePSCharInfo66_MinSumVG = 2,				/*最小总压组号[1,16]*/
	ePSCharInfo66_MinSumVolt = 3		    /*最小总压值[0,10000]0.1V*/

}e_PileSumVCharInfo66;

/*协议67子索引列表*/
typedef enum
{
	ePCCharInfo67_MaxCG = 0,				/*最大电流组号[1,16]*/
	ePCCharInfo67_MaxCurr = 1,				/*最大电流值[-30000,30000]0.1A*/
	ePCCharInfo67_MinCG = 2,				/*最小电流组号[1,16]*/
	ePCCharInfo67_MinCurr = 3		    	/*最小电流值[-30000,30000]0.1A*/

}e_PileCurrCharInfo67;

/*协议70子索引列表*/
typedef enum
{
	ePTime70_SysRun = 0,					/*系统运行时长[0,65535]1Hour*/
	ePTime70_CanChg = 1,					/*可充电时间[0,65535]1Min*/
	ePTime70_CanDhg = 2,					/*可放电时间[0,65535]1Min*/
	ePTime70_ChgCycle = 3				    /*充放电循环次数[0,65535]1次*/

}e_PileStatistTime70;

/*协议71子索引列表*/
typedef enum
{
	ePErr71_MonWarNum = 0,					/*单月告警数目[0,65535]*/
	ePErr71_MonErrNum = 1,					/*单月故障数目[0,65535]*/
	ePErr71_HisWarNum = 2,					/*累计告警数目[0,65535]*/
	ePErr71_HisErrNum = 3					/*累计故障数目[0,65535]*/

}e_PileStatistErr71;

/*协议72子索引列表*/
typedef enum
{
	ePCapEner72_NowEner = 0,				/*电池组当前电能[0,65535]0.1kWh*/
	ePCapEner72_AllEner = 1,				/*电池组总电能[0,65535]0.1kWh*/
	ePCapEner72_ChgCap = 2,					/*电池组单次充电电量[0,65535]1AH*/
	ePCapEner72_DhgCap = 3,					/*电池组单次放电电量[0,655351]AH*/

}e_PileStatistCapEner72;

/*协议73子索引列表*/
typedef enum
{
	ePHisCap73_ChgCap = 0,					/*电池组累计充电电量[0,65535]1AH*/
	ePHisCap73_DhgCap = 1					/*电池组累计放电电量[0,65535]1AH*/

}e_PileStatistHisCap73;

/*协议74子索引列表*/
typedef enum
{
	ePHisEner74_ChgEner = 0,				/*电池组累计充电电能[0,65535]0.1kWh*/
	ePHisEner74_DhgEner = 1					/*电池组累计放电电能[0,65535]0.1kWh*/

}e_PileStatistHisEner74;

/*协议75子索引列表*/
typedef enum
{
	ePDhgDeep_NowDod = 0,				   /*电池组当前DOD[0,1000]0.1%*/

}e_PileStatistDod75;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
//=============================================================================================
//函数名称	: u8 GetPileSelfStackIdAPI(void)
//输入参数	: void
//输出参数	: 堆控自身所在电池堆序号[0,9]
//函数功能	: 获取堆控自身所在电池堆序号
//注意事项	: 第几个电池堆号
//=============================================================================================
u8 GetPileSelfStackIdAPI(void);

//=============================================================================================
//函数名称	: u8 ChangPileGAddrToSIdAPI(u8 addr)
//输入参数	: addr:电池组设备地址[50,65]
//输出参数	: 电池组设备号对应的电池堆序号[0, 9]
//函数功能	: 转化电池组设备地址所在的电池堆序号
//注意事项	:
//=============================================================================================
u8 ChangPileGAddrToSIdAPI(u8 addr);

//=============================================================================================
//函数名称	: u8 ChangPileGIdToGAddrAPI(u8 group)
//输入参数	: group:组号[0,15],0xff:所有组
//输出参数	: 指定电池组对应的设备地址[50,65]
//函数功能	: 转化堆控下指定电池组对应的设备地址
//注意事项	:
//=============================================================================================
u8 ChangPileGIdToGAddrAPI(u8 group);

//=============================================================================================
//函数名称	: u8 ChangPileGAddrToGIdAPI(u8 addr)
//输入参数	: addr:电池组设备地址[50,65]
//输出参数	: 电池组设备号对应的组号[0, 15]
//函数功能	: 转化电池组设备地址对应的组号
//注意事项	:
//=============================================================================================
u8 ChangPileGAddrToGIdAPI(u8 addr);

//=============================================================================================
//函数名称	: u16 GetPileProStateAPI(void)
//输入参数	: void
//输出参数	: 系统保护状态(0:未就绪 1:正常 2:充电截止 3:放电截止 4:充放电限制 5:充放电保护)
//函数功能	: 获取堆控系统保护状态
//注意事项	:
//=============================================================================================
u16 GetPileProStateAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileWorkStateAPI(void)
//输入参数	: void
//输出参数	: 系统工作状态(0:开机 1:待机 2:启动 3:运行 4:停机 5:故障 6:关机)
//函数功能	: 获取堆控系统工作状态
//注意事项	:
//=============================================================================================
u16 GetPileWorkStateAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileChgStateAPI(void)
//输入参数	: void
//输出参数	: 系统充放电状态(0:空闲 1:充电 2:放电)
//函数功能	: 获取堆控系统充放电状态
//注意事项	:
//=============================================================================================
u16 GetPileChgStateAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileWorkModeAPI(void)
//输入参数	: void
//输出参数	: 系统工作模式(0:自动 1:手动 2:紧急 5:调试)
//函数功能	: 获取堆控系统工作模式
//注意事项	:
//=============================================================================================
u16 GetPileWorkModeAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileChgLimCurrAPI(void)
//输入参数	: void
//输出参数	: 充电电流限值(0.1A)
//函数功能	: 获取堆控充电电流限值
//注意事项	:
//=============================================================================================
u16 GetPileChgLimCurrAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileDhgLimCurrAPI(void)
//输入参数	: void
//输出参数	: 放电电流限值(0.1A)
//函数功能	: 获取堆控放电电流限值
//注意事项	:
//=============================================================================================
u16 GetPileDhgLimCurrAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileChgLimPowerAPI(void)
//输入参数	: void
//输出参数	: 充电功率限值(0.1KW)
//函数功能	: 获取堆控充电功率限值
//注意事项	:
//=============================================================================================
u16 GetPileChgLimPowerAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileDhgLimPowerAPI(void)
//输入参数	: void
//输出参数	: 放电功率限值(0.1KW)
//函数功能	: 获取堆控放电功率限值
//注意事项	:
//=============================================================================================
u16 GetPileDhgLimPowerAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileAlarmInfoAPI(u8 index)
//输入参数	: index:信息子索引[0,5]
//输出参数	: 堆控对应索引告警信息
//函数功能	: 获取堆控告警信息
//注意事项	:
//=============================================================================================
u16 GetPileAlarmInfoAPI(u8 index);

//=============================================================================================
//函数名称	: u16 GetPileSampSumVoltAPI(void)
//输入参数	: void
//输出参数	: 电池堆采样总电压 0.1V
//函数功能	: 获取电池堆采样总电压
//注意事项	: 组采样值求平均
//=============================================================================================
u16 GetPileSampSumVoltAPI(void);

//=============================================================================================
//函数名称	: s16 GetPileOutSumCurrAPI(void)
//输入参数	: void
//输出参数	: 电池堆输出总电流 0.1A(负号表示充电)
//功能功能	: 获取电池堆输出总电流
//注意事项	:
//=============================================================================================
s16 GetPileOutSumCurrAPI(void);

//=============================================================================================
//函数名称	: s16 GetPileOutSumPowerAPI(void)
//输入参数	: void
//输出参数	: 电池堆输出总功率 0.1kw(负号表示充电)
//功能功能	: 获取电池堆输出总功率
//注意事项	:
//=============================================================================================
s16 GetPileOutSumPowerAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileGMaxSumVGroupAPI(void)
//输入参数	: void
//输出参数	: 电池堆最大总压电池组号[1,16]
//函数功能	: 获取电池堆最大总压电池组号
//注意事项	:
//=============================================================================================
u16 GetPileGMaxSumVGroupAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileGMaxSumVoltAPI(void)
//输入参数	: void
//输出参数	: 电池堆最大电池组总压 0.1V
//函数功能	: 获取电池堆最大电池组总压
//注意事项	:
//=============================================================================================
u16 GetPileGMaxSumVoltAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileGMinSumVGroupAPI(void)
//输入参数	: void
//输出参数	: 电池堆最小总压电池组号[1,16]
//函数功能	: 获取电池堆最小总压电池组号
//注意事项	:
//=============================================================================================
u16 GetPileGMinSumVGroupAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileGMinSumVoltAPI(void)
//输入参数	: void
//输出参数	: 电池堆最小电池组总压 0.1V
//函数功能	: 获取电池堆最小电池组总压
//注意事项	:
//=============================================================================================
u16 GetPileGMinSumVoltAPI(void);

//=============================================================================================
//函数名称	: u16 GetPileGMaxOutCurrAPI(void)
//输入参数	: void
//输出参数	: 电池堆最大电池组电流 0.1A
//函数功能	: 获取电池堆最大电池组电流
//注意事项	: 负号表示充电
//=============================================================================================
s16 GetPileGMaxOutCurrAPI(void);

#endif
#endif
