/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : HeatModbusMap.h
** @Founder      : ZSY342
** @Date         : 2019.11.1
** @Function     : 热管理Modbus通信地址映射模块
** @Instructions :
**===============================================================================================*/
#ifndef LOGICS_SCIUSER_HEATMODBUSMAP_H_
#define LOGICS_SCIUSER_HEATMODBUSMAP_H_

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "MbInterface.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define HEAT_MANANG_MODBUS_PORT   	   (2)			/*热管理modbus通讯端口号*/


#define MODBUS_SALVE_ADDR_AIR    	   (1)         /*液冷空调从机地址*/

#define MODBUS_SALVE_ADDR_LEAKAGE      (1)         /*漏电流传感器从机地址*/

/*************************MODBUS 英飞源自研液冷空调通讯地址划分开始*************************************************/
#define MB_AIR_WR_BASE_ADDR           (301)		/*液冷空调读写信息起始地址(包括)*/
#define MB_AIR_WR_END_ADDR            (311)		/*液冷空调读写信息结束地址(不包括)*/

#define MB_AIR_RO_BASE_ADDR           (301)		/*液冷空调只读信息起始地址(包括)*/
#define MB_AIR_RO_END_ADDR            (327)		/*液冷空调只读信息结束地址(不包括)*/

#define MB_AIR_RO_BASE1_ADDR          (314)		/*液冷空调只读信息1起始地址(包括)*/
#define MB_AIR_RO_END1_ADDR           (360)		/*液冷空调只读信息1结束地址(不包括)*/
/*************************MODBUS 英飞源自研液冷空调通讯地址划分结束*************************************************/

/*************************MODBUS 同飞液冷空调通讯地址划分开始*************************************************/
#define MB_TF_AIR_WR_BASE_ADDR           (0x1000)		/*液冷空调读写信息起始地址(包括)*/
#define MB_TF_AIR_WR_END_ADDR            (0x1012)		/*液冷空调读写信息结束地址(不包括)*/

#define MB_TF_AIR_RO_BASE_ADDR           (0x0000)		/*液冷空调只读信息起始地址(包括)*/
#define MB_TF_AIR_RO_END_ADDR            (0x0006)		/*液冷空调只读信息结束地址(不包括)*/

#define MB_TF_AIR_RO_BASE1_ADDR           (0x0007)		/*液冷空调只读信息1起始地址(包括)*/
#define MB_TF_AIR_RO_END1_ADDR            (0x000A)		/*液冷空调只读信息1结束地址(不包括)*/

#define MB_TF_AIR_RO_BASE2_ADDR           (0x000B)		/*液冷空调只读信息2起始地址(包括)*/
#define MB_TF_AIR_RO_END2_ADDR            (0x000F)		/*液冷空调只读信息2结束地址(不包括)*/

#define MB_TF_AIR_RO_BASE3_ADDR           (0x0012)		/*液冷空调只读信息3起始地址(包括)*/
#define MB_TF_AIR_RO_END3_ADDR            (0x0014)		/*液冷空调只读信息3结束地址(不包括)*/

#define MB_TF_AIR_RO_BASE4_ADDR           (0x0015)		/*液冷空调只读信息4起始地址(包括)*/
#define MB_TF_AIR_RO_END4_ADDR            (0x0016)		/*液冷空调只读信息4结束地址(不包括)*/

#define MB_TF_AIR_RO_BASE5_ADDR           (0x0019)		/*液冷空调只读信息5起始地址(包括)*/
#define MB_TF_AIR_RO_END5_ADDR            (0x0021)		/*液冷空调只读信息5结束地址(不包括)*/

#define MB_TF_AIR_RO_BASE6_ADDR           (0x0022)		/*液冷空调只读信息6起始地址(包括)*/
#define MB_TF_AIR_RO_END6_ADDR            (0x0027)		/*液冷空调只读信息6结束地址(不包括)*/

#define MB_TF_AIR_RO_BASE7_ADDR           (0x003C)		/*液冷空调只读信息7起始地址(包括)*/
#define MB_TF_AIR_RO_END7_ADDR            (0x0045)		/*液冷空调只读信息7结束地址(不包括)*/
/*************************MODBUS 同飞液冷空调通讯地址划分结束*************************************************/

/*************************MODBUS EU3液冷空调通讯地址划分开始*************************************************/
#define MB_EU3_AIR_WR_BASE_ADDR           (501)		/*EU3空调读写信息起始地址(包括)*/
#define MB_EU3_AIR_WR_END_ADDR            (507)		/*EU3空调读写信息结束地址(不包括)*/

#define MB_EU3_AIR_WR_BASE1_ADDR          (703)		/*EU3空调读写信息起始地址1(包括)*/
#define MB_EU3_AIR_WR_END1_ADDR           (707)		/*EU3空调读写信息结束地1(不包括)*/

#define MB_EU3_AIR_RO_BASE_ADDR           (499)		/*EU3空调只读信息起始地址(包括)*/
#define MB_EU3_AIR_RO_END_ADDR            (510)		/*EU3空调只读信息结束地(不包括)*/

#define MB_EU3_AIR_RO_BASE1_ADDR           (513)	/*EU3空调只读信息起始地址1(包括)*/
#define MB_EU3_AIR_RO_END1_ADDR            (516)	/*EU3空调只读信息结束地1(不包括)*/

#define MB_EU3_AIR_RO_BASE2_ADDR           (538)	/*EU3空调只读信息起始地址2(包括)*/
#define MB_EU3_AIR_RO_END2_ADDR            (539)	/*EU3空调只读信息结束地2(不包括)*/

#define MB_EU3_AIR_RO_BASE3_ADDR           (600)	/*EU3空调只读信息起始地址3(包括)*/
#define MB_EU3_AIR_RO_END3_ADDR            (610)	/*EU3空调只读信息结束地3(不包括)*/

#define MB_EU3_AIR_RO_BASE4_ADDR           (612)	/*EU3空调只读信息起始地址4(包括)*/
#define MB_EU3_AIR_RO_END4_ADDR            (618)	/*EU3空调只读信息结束地4(不包括)*/

#define MB_EU3_AIR_RO_BASE5_ADDR           (700)	/*EU3空调只读信息起始地址5(包括)*/
#define MB_EU3_AIR_RO_END5_ADDR            (706)	/*EU3空调只读信息结束地5(不包括)*/

#define MB_EU3_AIR_RO_BASE6_ADDR           (618)	/*EU3空调只读信息起始地址4(包括)*/
#define MB_EU3_AIR_RO_END6_ADDR            (626)	/*EU3空调只读信息结束地4(不包括)*/
/*************************MODBUS EU3液冷空调通讯地址划分结束*************************************************/

/*************************MODBUS 新淼液冷空调通讯地址划分开始*************************************************/
#define MB_XinMiao_AIR_WR_BASE_ADDR           (200)		/*新淼空调读写信息起始地址(包括)*/
#define MB_Xinmiao_AIR_WR_END_ADDR            (202)		/*新淼空调读写信息结束地址(不包括)*/

#define MB_XinMiao_AIR_WR_BASE1_ADDR          (205)		/*新淼空调读写信息起始地址(包括)*/
#define MB_Xinmiao_AIR_WR_END1_ADDR           (206)		/*新淼空调读写信息结束地址(不包括)*/

#define MB_XinMiao_AIR_RO_BASE_ADDR           (0)		/*新淼空调读写信息起始地址(包括)*/
#define MB_Xinmiao_AIR_RO_END_ADDR            (12)		/*新淼空调读写信息结束地(不包括)*/
/*************************MODBUS 新淼液冷空调通讯地址划分结束*************************************************/


/*************************MODBUS 漏电流传感器通讯地址划分开始*************************************************/
#define MB_LEAKAGE_RO_BASE_ADDR           (0x0056)		/*漏电流传感器只读信息起始地址(包括)*/
#define MB_LEAKAGE_RO_END_ADDR            (0x0058)		/*漏电流传感器只读信息结束地址(不包括)*/
/*************************MODBUS 漏电流传感器通讯地址划分结束*************************************************/
/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Global variable definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u16* ModbusFindSlaveInfoMaping(u8 fncCode, u8 sciNum, u16 address)
** @Input     : fncCode:功能码 sciNum:串口号 address:信息地址
** @Output    : 映射到信息寄存器的实际地址指针
** @Function  : 查找所有信息寄存器所对应的地址指针
** @The notes : 放在Modbus通讯包服务端(主机)接收处理HOOK
**===============================================================================================*/
u16 *ModbusFindSlaveInfoMaping(u8 fncCode, u8 sciNum, u16 address, u8 stationID);
/*=================================================================================================
** @Name      : u16* ModbusFindAirCtrlInfoROAddrMap(u8 fncCode, u8 sciNum, u16 address)
** @Input     : fncCode:功能码 sciNum:串口号 address:信息地址
** @Output    : 映射到信息寄存器的实际地址指针
** @Function  : 查找在设备信息寄存器所对应的地址指针
** @The notes : 读
**===============================================================================================*/
u16* ModbusFindAirCtrlInfoROAddrMap(u8 fncCode, u8 sciNum, u16 address);
//#if(BMU_LIQUIDCOOL_AIR_TYPE == 0)
/*=================================================================================================
** @Name      : u16* SciGetXinMiaoAirStaInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetXinMiaoAirStaInfoRO(u8 index);
/*=================================================================================================
** @Name      : u16* SciGetXinMiaoAirCtrlInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetXinMiaoAirCtrlInfoRO(u8 index);
/*=================================================================================================
** @Name      : u16* SciGetEu3AirCtrlInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetEu3AirCtrlInfoRO(u8 index);
/*=================================================================================================
** @Name      : u16* SciGetEu3AirStaInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetEu3AirStaInfoRO(u8 index);
/*=================================================================================================
** @Name      : u16* SciGetFanCtrlAlarmInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetAirCtrlInfoRO(u8 index);
/*=================================================================================================
** @Name      : u16* SciGetAirStaInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetAirStaInfoRO(u8 index);
/*=================================================================================================
** @Name      : u16* SciGetAirErrInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetAirErrInfoRO(u8 index);
//#else
/*=================================================================================================
** @Name      : u16* SciGetTfAirUserInfoWR(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetTfAirUserInfoWR(u8 index);
/*=================================================================================================
** @Name      : u16* SciGetTfAirStateRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetTfAirStateRO(u8 index);
/*=================================================================================================
** @Name      : u16* SciGetTfAirErrInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetTfAirErrInfoRO(u8 index);
//#endif
//#if(BMU_LEAKAGE_EN == 1)
/*=================================================================================================
** @Name      : u16* ModbusFindLeakageInfoROAddrMap(u8 fncCode, u8 sciNum, u16 address)
** @Input     : fncCode:功能码 sciNum:串口号 address:信息地址
** @Output    : 映射到信息寄存器的实际地址指针
** @Function  : 查找在设备信息寄存器所对应的地址指针
** @The notes : 读
**===============================================================================================*/
u16* ModbusFindLeakageInfoROAddrMap(u8 fncCode, u8 sciNum, u16 address);
/*=================================================================================================
** @Name      : u16* SciGetLeakageInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetLeakageInfoRO(u8 index);
//#endif
#endif

