/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileDnMsg.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控与下层设备通信CAN报文处理模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILEDNMSG_H
#define _PILEDNMSG_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void PileRcvDnMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum)
** @Input     : ID:CANID *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : 堆控下层(主控)CAN通信报文接收处理任务
** @The notes : 用户放在CAN接收处理HOOK接口调用
**===============================================================================================*/
void PileRcvDnMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum);

//================================== ===========================================================
//函数名称	: u8 PileSendDnGroupBreathMsg_API(void)
//输入参数	: void
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发心跳帧报文
//注意事项	: 向CAN0发报文(1s)
//=============================================================================================
u8 PileSendDnGroupBreathMsg_API(void);

//================================== ===========================================================
//函数名称	: u8 PileSendDnGroupOperAuthCmdMsg_API(u8 group, u8 auth)
//输入参数	: group:组号[0,15] 0xff:广播所有组 auth:权限命令(0:普通 1:运维 2:高级 3:超级)
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发操作权命令报文
//注意事项	: 向CAN0发报文(主索引85,不包括控制自身所在组)
//=============================================================================================
u8 PileSendDnGroupOperAuthCmdMsg_API(u8 group, u8 auth);

//================================== ===========================================================
//函数名称	: u8 PileSendDnGroupSysCtrlCmdMsg_API(u8 group, u8 index, u16 cmd)
//输入参数	: group:组号[0,15] 0xff:广播所有组 index:子索引号[0,2] cmd:命令
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发系统控制命令报文
//注意事项	: 向CAN0发报文(主索引86,不包括控制自身所在组)
//=============================================================================================
u8 PileSendDnGroupSysCtrlCmdMsg_API(u8 group, u8 index, u16 cmd);

//================================== ===========================================================
//函数名称	: u8 PileSendDnGroupUserCtrlCmdMsg_API(u8 group, u8 index, u8 len, u16 *cmd)
//输入参数	: group:组号[0,15] 0xff:广播所有组 index:起始子索引号[0,7] len:子索引长度[0, 8] *cmd:命令
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发用户控制命令报文
//注意事项	: 向CAN0发报文(主索引87,不包括控制自身所在组)
//=============================================================================================
u8 PileSendDnGroupUserCtrlCmdMsg_API(u8 group, u8 index, u8 len, u16 *cmd);

//=============================================================================================
//函数名称	: u8 PileSendDnGroupSysDebugCmdMsg_API(u8 group, u8 index, u8 len, u16 *cmd)
//输入参数	: group:组号[0,15] 0xff:广播所有组 index:起始子索引号[0,7] len:子索引长度[0, 8] *cmd:命令
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发系统调试命令报文
//注意事项	: 向CAN0发报文(主索引88,不包括控制自身所在组)
//=============================================================================================
u8 PileSendDnGroupSysDebugCmdMsg_API(u8 group, u8 index, u8 len, u16 *cmd);

/*=================================================================================================
** @Name      : void PileRcvCanGSingleInfoDeal(u8 group, u8 index, u8 len, u8 canNum)
** @Input     : group,:电池组号 index:主索引号 *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : 接收下级电池组单帧信息CAN报文处理
** @The notes : 接收周期上传单帧信息调用
**===============================================================================================*/
void PileRcvCanGSingleInfoDeal(u8 group, u8 index, u8 *pdata, u8 DLC, u8 canNum);

/*=================================================================================================
** @Name      : void PileRcvCanGLongInfoDeal(u8 group, u8 index, u8 len, u8 canNum)
** @Input     : group,:电池组号 index:主索引号 *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : 接收下级电池组长帧信息CAN报文处理
** @The notes : 接收周期上传长帧信息调用
**===============================================================================================*/
void PileRcvCanGLongInfoDeal(u8 group, u8 index, u8 *pdata, u8 DLC, u8 canNum);

/*=================================================================================================
** @Name      : RcvCanGroupSingleInfoU16(u8 group, u8 index, u8 *pdata, u8 DLC)
** @Input     : group:组号 index:主索引号 *pdata:CAN数据域  DLC:数据域长度
** @Output    : void
** @Function  : 接收U16数据类型单帧信息CAN报文处理
** @The notes : 接收U16类型单帧信息调用
**===============================================================================================*/
void RcvCanGroupSingleInfoU16(u8 group, u8 index, u8 *pdata, u8 DLC);

/*=================================================================================================
** @Name      : RcvCanGroupSingleInfoU32(u8 group, u8 index, u8 *pdata, u8 DLC)
** @Input     : group:组号 index:主索引号 *pdata:CAN数据域  DLC:数据域长度
** @Output    : void
** @Function  : 接收U32数据类型单帧信息CAN报文处理
** @The notes : 接收U32类型单帧信息调用
**===============================================================================================*/
void RcvCanGroupSingleInfoU32(u8 group, u8 index, u8 *pdata, u8 DLC);

/*=================================================================================================
** @Name      : RcvCanGroupLongInfoU16(u8 group, u8 index, u8 *pdata, u8 DLC)
** @Input     : group:组号 index:主索引号 *pdata:CAN数据域  DLC:数据域长度
** @Output    : void
** @Function  : 接收U16数据类型长帧信息CAN报文处理
** @The notes : 接收U16类型长帧信息调用
**===============================================================================================*/
void RcvCanGroupLongInfoU16(u8 group, u8 index, u8 *pdata, u8 DLC);

#endif
#endif
