/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileCalcUtil.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控计算接口工具模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILECALCUTIL_H
#define _PILECALCUTIL_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
typedef struct
{
    s16 piIn;       //PI输入，调用时写入；
    s16 piOut;      //PI输出，函数正确执行后写入，作为函数实际输出值；
    s32 piSum;      //PI积分累加量，函数内部使用，函数外只读；
}b_PIIO;

typedef struct
{
    u16 piKp;           //PI比例系数
    u16 piKpR;          //PI比例项右移位数
    u16 piKi;           //PI积分系数
    u16 piKiR;          //PI积分项右移位数
    s16 piKiPrecision;  //PI积分调节有效范围
    s16 piInMax;        //PI输入最大值
    s16 piInMin;        //PI输入最小值
    s32 piSumMax;       //PI积分累加量最大值
    s32 piSumMin;       //PI积分累加量最小值
    s16 piOutMax;       //PI输出最大值
    s16 piOutMin;       //PI输出最小值
}b_PICfg;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//================================================================================
//函数名称	: s16 PileUtilPiAdjust(b_PIIO* pPiIO,b_PICfg* pPiCfg)
//输入参数	: b_PIIO* pPiIO,b_PICfg* pPiCfg
//输出参数	: 0:正常 1:异常
//函数功能	: PI调节通用函数
//注意事项	: 
//================================================================================
s16 PileUtilPiAdjust(b_PIIO* pPiIO,const b_PICfg*  pPiCfg);

//=============================================================================================
//函数名称	: s32 PileUtilLimitRange(s32 value, s32 min, s32 max)
//输入参数	: value:输入值 min:最小范围值 max:最大范围值
//输出参数	: 输入值限制范围后的值
//函数功能	: 限制输入值范围
//注意事项	: 
//=============================================================================================
s32 PileUtilLimitRange(s32 value, s32 min, s32 max);

//=============================================================================================
//函数名称	: u16 PileUtilLimitRangeU16(u16 value, u16 min, u16 max)
//输入参数	: value:输入值 min:最小范围值 max:最大范围值
//输出参数	: 输入值限制范围后的值
//函数功能	: 限制输入值范围
//注意事项	: 
//=============================================================================================
u16 PileUtilLimitRangeU16(u16 value, u16 min, u16 max);

#endif
#endif
