/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PilePara.c
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控参数模块
** @Instructions : 
**===============================================================================================*/

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PilePara.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Global variable definition
**===============================================================================================*/
u16 gPSmuGenParaR_102[PINDEX102_LEN] =  	/*堆控通用参数值*/
{
    23130,                          /*系统常规参数配置标志*/
    70,                             /*设备地址[70,79]*/
    210,                            /*电压采样总节数[1,400]*/
    90,                             /*温度采样总节数[1,400]*/

	15,								/*充电限制请求保护时间1s	[0,6000]*/
	15,								/*放电限制请求保护时间1s	[0,6000]*/
	13,								/*充电保护延迟保护时间1s	[0,6000]*/
	13,								/*放电保护延迟保护时间1s	[0,6000]*/
	10,								/*系统故障延迟保护时间1s	[0,6000]*/
	600,							/*外部通讯故障延迟保护时间1s	[0,6000]*/
	300,							/*低压二级延迟关机时间1s	[0,6000]*/
	180,							/*低压一级延迟关机时间1s	[0,6000]*/
	600,							/*系统故障延迟关机时间1s	[0,6000]*/
	900,							/*外部通讯故障延迟关机时间1s	[0,6000]*/

    50,                             //堆控空闲零点充电电流值[0,100]0.1A
    80,                             //堆控空闲零点放电电流值[0,100]0.1A
    300,                            //主接触器安全电流值[0,5000]0.1A
    50,                             //预充接触器安全电流值[0,500]0.1A
    300,                            //电池组动态投切安全电流[0,5000]0.1A
    30,                             //启动电池串间安全电压差[0,500]0.1V
    500,                            //逐个接触器吸合前等待电流超时时间[1,3000]10ms
    0,                              //所有预充接触器吸和后等待电流预充时间[0,60000]10ms
    0,                              //所有预充接触器吸和后组数少时预充时间延长使能[0,1]
    1000,                           //启动接触器操作失败检测时间[1,3000]10ms
    100,                            //停机接触器操作失败检测时间[1,300]100ms
    100,                            //停机失败检测时间[1,300]100ms
    50,                             //初始化前等待时间[1,300]100ms
    200,                            //自启动前等待时间[1,600]100ms
    1,                              //动态切除降限值使能[0,1]
    300,                            //高温隔离后再并机需等待时间[1,1000]s
    30,                             //隔离后再并机至少等待时间[1,1000]s
    3500,                           //不能动态并机最大电压值[2000,5000]mv
    2900,                           //不能动态并机最小电压值[1000,4000]mv
    3350,                           //释放充电电流限值最大电压值[2000,5000]mv
    3250,                           //释放放电电流限值最小电压值[1000,4000]mv
    1000,                           //充电输入额定功率[1,30000] 0.1kW
    1000,                           //放电输出额定功率[1,30000] 0.1kW
    5000,                           //充电最大请求功率[1,30000] 0.1kW
    5000                            //放电最大运行功率[1,30000] 0.1kW
};

u16 gPSmuGenParaWR_107[PINDEX107_LEN] =  	/*堆控通用参数值*/
{
    23130,                          /*系统常规参数配置标志*/
    70,                             /*设备地址[70,79]*/
    210,                            /*电压采样总节数[1,400]*/
    90,                             /*温度采样总节数[1,400]*/

	15,								/*充电限制请求保护时间1s	[0,6000]*/
	15,								/*放电限制请求保护时间1s	[0,6000]*/
	13,								/*充电保护延迟保护时间1s	[0,6000]*/
	13,								/*放电保护延迟保护时间1s	[0,6000]*/
	10,								/*系统故障延迟保护时间1s	[0,6000]*/
	600,							/*外部通讯故障延迟保护时间1s	[0,6000]*/
	300,							/*低压二级延迟关机时间1s	[0,6000]*/
	180,							/*低压一级延迟关机时间1s	[0,6000]*/
	600,							/*系统故障延迟关机时间1s	[0,6000]*/
	900,							/*外部通讯故障延迟关机时间1s	[0,6000]*/

    50,                             //堆控空闲零点充电电流值[0,100]0.1A
    80,                             //堆控空闲零点放电电流值[0,100]0.1A
    500,                            //主接触器安全电流值[0,5000]0.1A
    50,                             //预充接触器安全电流值[0,500]0.1A
    1000,                           //电池组动态投切安全电流[0,5000]0.1A
    60,                             //启动电池串间安全电压差[0,500]0.1V
    2000,                           //逐个接触器吸和前等待电流超时时间[1,3000]10ms
    0,                              //所有预充接触器吸和后等待电流预充时间[0,60000]10ms
    0,                              //所有预充接触器吸和后组数少时预充时间延长使能[0,1]
    1000,                           //启动接触器操作失败检测时间[1,3000]10ms
    100,                            //停机接触器操作失败检测时间[1,300]100ms
    100,                            //停机失败检测时间[1,300]100ms
    70,                             //自检前等待时间[1,300]100ms
	200,                            //自启动前等待时间[1,600]100ms
    0,                              //隔离降限值使能[0,1]
    600,                            //高温隔离后再并网需等待时间[1,1000]s
    30,                             //隔离后再并网至少等待时间[1,1000]s
    3500,                           //不能动态并网最大电压值[2000,5000]mv
    2900,                           //不能动态并网最小电压值[1000,4000]mv
    3450,                           //释放充电电流限值最大电压值[2000,5000]mv
    2900,                           //释放放电电流限值最小电压值[1000,4000]mv
    30,                             //充电输入额定功率
    30,                             //放电输出额定功率
    50,                             //充电最大请求功率
    50                              //放电最大请求功率
};

/*=================================================================================================
** @Static function declaration
**===============================================================================================*/

/*=================================================================================================
** @Interface function definition
**===============================================================================================*/

/*=================================================================================================
** @Static function definition
**===============================================================================================*/

#endif
