/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : DiagMaker.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 电池组故障诊断模块启动滤波接口
** @Instructions : 
**===============================================================================================*/
#ifndef _DIAGCHECK_H
#define _DIAGCHECK_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void DiagRcvDevMsgAddAPI(u8 addr)
** @Input     : addr:设备地址
** @Output    : void
** @Function  : 接收外设通信信息报文计数
** @The notes : 接收到报文时调用
**===============================================================================================*/
void DiagRcvDevMsgAddAPI(u8 addr);

/*=================================================================================================
** @Name      : void DiagSciRcvDevMsgAddAPI(u8 addr)
** @Input     : addr:设备地址
** @Output    : void
** @Function  : 接收SCI外设通信信息报文计数
** @The notes : 接收到报文时调用
**===============================================================================================*/
void DiagSciRcvDevMsgAddAPI(u8 addr);
/*=================================================================================================
** @Name      : void DiagSciRcvDevMsgAddAPI(u8 addr)
** @Input     : addr:设备地址
** @Output    : void
** @Function  : 接收SCI外设通信信息报文计数
** @The notes : 接收到报文时调用
**===============================================================================================*/
void DiagSciRcvLeakageMsgAddAPI(u8 addr);
/*=================================================================================================
** @Name      : void DiagRcvEcuRepCheckAPI(u8 addr)
** @Input     : addr:设备地址
** @Output    : void
** @Function  : 判断主控设备地址是否重复冲突
** @The notes : 出现相同的设备地址
**===============================================================================================*/
void DiagRcvEcuRepCheckAPI(u8 addr);

/*=================================================================================================
** @Name      : void DiagRcvCellMissCheckAPI(u8 type, u8 ecu, u8 cell)
** @Input     : type:单体类型[0:单体电压 1:单体温度] ecu:从控号[0,31] cell:单体信息编号[0,17]
** @Output    : void
** @Function  : 判断是否接收所有单体信息
** @The notes :
**===============================================================================================*/
void DiagRcvCellMissCheckAPI(u8 type, u8 ecu, u8 cell);

//by lxr01202
/*=================================================================================================
** @Name      : void DiagRcvRealResisMissCheckAPI(u8 type, u8 ecu, u8 cell)
** @Input     :  type:单体类型[0:内阻实部 1:内阻虚部] ecu:从控号[0,31] cell:单体信息编号[0,17]
** @Output    : void
** @Function  : 判断是否接收所有内阻实部或虚部信息
** @The notes :
**===============================================================================================*/
void DiagRcvResisMissCheckAPI(u8 type, u8 ecu, u8 cell);

/*=================================================================================================
** @Name      : void DiagRcvSrStateMissCheckAPI(u8 ecu, u8 cell)
** @Input     : ecu:从控号[0,31] cell:单体信息编号[0,17]
** @Output    : void
** @Function  : 判断是否接收所有sr状态信息
** @The notes :
**===============================================================================================*/
void DiagRcvSrStateMissCheckAPI(u8 ecu, u8 cell);

/*=================================================================================================
** @Name      : void DiagCommuCheckTask(void)
** @Input     : void
** @Output    : void
** @Function  : 检测通信状态任务
** @The notes : 1s周期调用
**===============================================================================================*/
void DiagCommuCheckTask(void);

/*=================================================================================================
** @Name      : void DiagPerDevCheckTask(void)
** @Input     : void
** @Output    : void
** @Function  : 检测外围设备故障状态任务
** @The notes : 500ms周期调用
**===============================================================================================*/
void DiagPerDevCheckTask(void);

/*=============================================================================================
** @Name      : void DiagSwhChangCStateCheckTask(void)
** @Input     : void
** @Output    : void
** @Function  : 检测接触器动作时电流状态(是否带载动作)
** @The notes : 100ms调用,检测主正/主负接触器
**===========================================================================================*/
void DiagSwhChangCStateCheckTask(void);

/*=============================================================================================
** @Name      : void DiagClrPerDevExpFlagAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除外部设备检测异常标志
** @The notes : 高压侧器件故障标志
**===========================================================================================*/
void DiagClrPerDevExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetHigVoltExpFlagAPI(void)
** @Input     : void
** @Output    : 按位表示高压采样值异常[bit0:总电压,1:预充电压]
** @Function  : 获取高压采样值异常标志
** @The notes :
**===============================================================================================*/
u8 DiagGetHigVoltExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetHigVSubDiffFlagAPI(void)
** @Input     : void
** @Output    : 高压内外压差过大标志[0:正常,1:压差过大]
** @Function  : 获取高压内外压差过大标志
** @The notes :
**===============================================================================================*/
u8 DiagGetHigVSubDiffFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetSwhStateVExpFlagAPI(void)
** @Input     : void
** @Output    : 按位表示各接触器状态电压值异常[bit0:正极接触器断开状态,bit1:预充接触器断开状态,bit2:负极接触器断开状态;bit4:正极接触器闭合状态,bit5:预充接触器闭合状态,bit6:负极接触器闭合状态]
** @Function  : 获取各接触器状态电压值异常标志
** @The notes : 高4位闭合状态电压异常,低4位断开状态电压异常
**===============================================================================================*/
u8 DiagGetSwhStateVExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetSwhChangCExpFlagAPI(void)
** @Input     : void
** @Output    : 按位表示各接触器动作带载异常[bit0:正极接触器断开,bit1:预充接触器断开,bit2:负极接触器断开;bit4:正极接触器闭合,bit5:预充接触器闭合,bit6:负极接触器闭合]
** @Function  : 获取各接触器带载动作异常标志
** @The notes : 高4位闭合带载异常,低4位断开带载异常
**===============================================================================================*/
u8 DiagGetSwhChangCExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetPeripDevExpFlagAPI(void)
** @Input     : void
** @Output    : 按位表示各外围器件异常[Bit0:熔断器 bit1:断路器 [0:正常 1:异常]]
** @Function  : 获取各外围器件异常标志
** @The notes :
**===============================================================================================*/
u8 DiagGetPeripDevExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetDcSideLeakFlagAPI(void)
** @Input     : void
** @Output    : 绝缘检测异常标志[0:正常 1:一级故障(严重) 2:二级告警(轻微) 3:检测失效]
** @Function  : 获取高压侧绝缘检测异常标志
** @The notes :
**===============================================================================================*/
u8 DiagGetDcSideLeakFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvAllSlaveFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部从控报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部从控报文标志
** @The notes : 任一帧报文
**===============================================================================================*/
u8 DiagGetRcvAllSlaveFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvAllCellFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部单体信息报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部单体信息报文标志
** @The notes : 全部单体电压和温度
**===============================================================================================*/
u8 DiagGetRcvAllCellFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvAllSrstateFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部单体sr状态信息报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部单体sr状态信息报文标志
** @The notes : 全部sr状态信息
**===============================================================================================*/
u8 DiagGetRcvAllSrstateFlagAPI(void);

/*=================================================================================================
** @Name      : void DiagInitRcvAllSrstateFlagAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 初始化全部单体sr状态信息报文标志
** @The notes : 清空sr状态信息重新接收
**===============================================================================================*/
void DiagInitRcvAllSrstateFlagAPI(void);

//by lxr01202
/*=================================================================================================
** @Name      : u8 DiagGetRcvAllResisRealFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部单体内阻实部信息报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部单体内阻信息报文标志
** @The notes : 全部单体内阻
**===============================================================================================*/
u8 DiagGetRcvAllResisRealFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvAllResisImagFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部单体内阻虚部信息报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部单体内阻信息报文标志
** @The notes : 全部单体内阻
**===============================================================================================*/
u8 DiagGetRcvAllResisImagFlagAPI(void);

/*=================================================================================================
** @Name      : void DiagInitRcvAllResisRealFlagAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 初始化全部单体内阻实部信息报文标志
** @The notes : 清空内阻信息重新接收
**===============================================================================================*/
void DiagInitRcvAllResisRealFlagAPI(void);

/*=================================================================================================
** @Name      : void DiagInitRcvAllResisImagFlagAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 初始化全部单体内阻虚部信息报文标志
** @The notes : 清空内阻信息重新接收
**===============================================================================================*/
void DiagInitRcvAllResisImagFlagAPI(void);
/*=================================================================================================
** @Name      : u8 DiagGetRcvAllPeripFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部外设报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部外设报文标志
** @The notes : 高压模块
**===============================================================================================*/
u8 DiagGetRcvAllPeripFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvPerOffCommuBitAPI(void)
** @Input     : void
** @Output    : 通信中断的内部子系统[Bit0:IMLU Bit1:IMEU]
** @Function  : 获取通信中断的内部子系统号
** @The notes : 按BIT位表示
**===============================================================================================*/
u8 DiagGetRcvPerOffCommuBitAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetPerImluOffCommuStateAPI(void)
** @Input     : void
** @Output    : IMLU1通信中断状态[0:正常 1:通信中断]
** @Function  : 获取外设IMLU1通信中断状态
** @The notes :
**===============================================================================================*/
u8 DiagGetPerAirOffCommuStateAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetPduInImeu3OffCommuStateAPI(void)
** @Input     : void
** @Output    : IMEU3通信中断状态[0:正常 1:通信中断]
** @Function  : 获取外设IMEU2通信中断状态
** @The notes :
**===============================================================================================*/
u8 DiagGetPduInImeu3OffCommuStateAPI(void);
/*=================================================================================================
** @Name      : u8 DiagGetPduOutImeu3OffCommuStateAPI(void)
** @Input     : void
** @Output    : IMEU3通信中断状态[0:正常 1:通信中断]
** @Function  : 获取外设IMEU3通信中断状态
** @The notes :
**===============================================================================================*/
u8 DiagGetPduOutImeu3OffCommuStateAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetPerGasErrFlagAPI(void)
** @Input     : void
** @Output    : 可燃气体浓度异常标志[bit0:干接点 bit1:H2气体 bit1:CO气体  0:正常 1:异常]
** @Function  : 获取外设可燃气体浓度异常标志
** @The notes :
**===============================================================================================*/
u8 DiagGetPerGasErrFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvSlaveMsgSlaveIdAPI(void)
** @Input     : void
** @Output    : 未接收到从控信息报文的从控序号[1,32]
** @Function  : 获取未接收到从控信息报文从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
u8 DiagGetRcvSlaveMsgSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvCellInfoSlaveIdAPI(void)
** @Input     : void
** @Output    : 未接收到单体信息的从控序号[1,32]
** @Function  : 获取未接收到单体信息从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
u8 DiagGetRcvCellInfoSlaveIdAPI(void);

/*=================================================================================================
** 从控采样异常检测
**===============================================================================================*/
/*=================================================================================================
** @Name      : void DiagRecordAFESampErrFlagAPI(u8 slave, u8 flag)
** @Input     : slave:从控序号[0,31] flag:异常标志(0:电压正常 1:电压异常 2:温度正常 3:温度异常)
** @Output    : void
** @Function  : 记录模拟前端检测到的采样异常标志
** @The notes : 芯片读取到的数据异常
**===============================================================================================*/
void DiagRecordAFESampErrFlagAPI(u8 slave, u8 flag);

/*=================================================================================================
** @Name      : void DiagRecordAFEVOffLFlagAPI(u8 slave, u32 offCell)
** @Input     : slave:从控序号[0,31] offCell:断线的电池(按位表示1节电池)
** @Output    : void
** @Function  : 记录模拟前端检测到的单体电压断线标志
** @The notes : 芯片处理判断
**===============================================================================================*/
void DiagRecordAFEVOffLFlagAPI(u8 slave, u32 offCell);

/*=================================================================================================
** @Name      : void DiagCheckCellVOffLFlagAPI(u8 slave, u8 cellNum, u16 volt)
** @Input     : slave:从控序号[0,31] cellNum:从控内电池号[0,17] volt:电压值[0,5000]mv
** @Output    : void
** @Function  : 检测单体电压采样断线标志
** @The notes : 采样电压判断
**===============================================================================================*/
void DiagCheckCellVOffLFlagAPI(u8 slave, u8 cellNum, u16 volt);

/*=================================================================================================
** @Name      : void DiagCheckCellTOffLFlagAPI(u8 slave, u8 cellNum, s8 temp)
** @Input     : slave:从控序号[0,31] cellNum:从控内单体温度序号[0,15] temp:温度值[-40,105]℃
** @Output    : void
** @Function  : 检测单体电压采样断线标志
** @The notes : 单体电芯温度
**===============================================================================================*/
void DiagCheckCellTOffLFlagAPI(u8 slave, u8 cellNum, s8 temp);

/*=================================================================================================
** @Name      : void DiagCheckBalanTOffLFlagAPI(u8 slave, u8 cellNum, s8 temp)
** @Input     : slave:从控序号[0,31] cellNum:均衡温度序号[0,1] temp:温度值[-40,105]℃
** @Output    : void
** @Function  : 检测均衡板温采样断线标志
** @The notes : 均衡板温
**===============================================================================================*/
void DiagCheckBalanTOffLFlagAPI(u8 slave, u8 cellNum, s8 temp);

/*=================================================================================================
 ** @Name      : void DiagRecordBalErrFlagAPI(u8 slave, u32 offCell)
 ** @Input     : slave:从控序号[0,31] errCell:均衡故障的电池通道(按位表示1节电池通道)
 ** @Output    : void
 ** @Function  : 记录均衡故障的电池通道标志
 ** @The notes : 只记录1个从控
 **===============================================================================================*/
void DiagRecordBalErrFlagAPI(u8 slave, u32 errCell);

/*=================================================================================================
** @Name      : u8 DiagGetCellSErrSlaveIdAPI(void)
** @Input     : void
** @Output    : 单体信息采样异常的从控序号[1,32]
** @Function  : 获取单体信息采样异常从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
u8 DiagGetCellSErrSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u16 DiagGetCellSampErrFlagAPI(void)
** @Input     : void
** @Output    : 按bit位表示单体信息采样异常标志[bit0:单体电压 bit1:单体温度](0正常,1异常)
** @Function  : 获取单体信息采样异常标志
** @The notes :
**===============================================================================================*/
u16 DiagGetCellSampErrFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetCellTOffSlaveIdAPI(void)
** @Input     : void
** @Output    : 单体电压采样线断线的从控序号[1,32]
** @Function  : 获取均单体电压采样线断线从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
u8 DiagGetCellVOffSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u32 DiagGetCellVOffCellBitAPI(void)
** @Input     : void
** @Output    : 单体电压采样线断线的从控内电压通道(按位表示1个电压通道[0正常,1异常])
** @Function  : 获取单体电压采样线断线的从控内电压通道
** @The notes : 按位表示1个电压通道
**===============================================================================================*/
u32 DiagGetCellVOffCellBitAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetCellTOffSlaveIdAPI(void)
** @Input     : void
** @Output    : 单体温度采样线断线的从控序号[1,32]
** @Function  : 获取均单体温度采样线断线从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
u8 DiagGetCellTOffSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u16 DiagGetCellTOffCellBitAPI(void)
** @Input     : void
** @Output    : 单体温度采样线断线的从控内温度点位(按位表示1个温度点[0正常,1异常])
** @Function  : 获取单体温度采样线断线的从控内温度点位
** @The notes : 按位表示1个温度点
**===============================================================================================*/
u16 DiagGetCellTOffCellBitAPI(void);

/*=================================================================================================
** @Name      : u8 GetTempOffLineNum(void)
** @Input     : void
** @Output    : 均衡板温采样线断线的从控序号[1,32]
** @Function  : 获取均衡板温采样线断线从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
u8 DiagGetBalTOffSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u16 DiagGetBalTOffCellBitAPI(void)
** @Input     : void
** @Output    : 均衡板温采样线断线的从控内温度点位(按位表示1个温度点[0正常,1异常])
** @Function  : 获取均衡板温采样线断线的从控内温度点位
** @The notes : 按位表示1个温度点
**===============================================================================================*/
u16 DiagGetBalTOffCellBitAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetBalErrSlaveIdAPI(void)
** @Input     : void
** @Output    : 均衡控制失败的从控序号[1,32]
** @Function  : 获取均衡控制失败从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
u8 DiagGetBalErrSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u32 DiagGetBalErrCellBitAPI(void)
** @Input     : void
** @Output    : 均衡控制失败的从控内通道位(按位表示1个通道[0,1])
** @Function  : 获取均衡控制失败的从控内通道位
** @The notes : 按位表示1个通道
**===============================================================================================*/
u32 DiagGetBalErrCellBitAPI(void);
 #if((1 == BMU_BSU_COM_TYPE) && (0 == BMU_BSU_CAN_TYPE))
  /*=================================================================================================
** @Name      : void DiagResetBsu02u1PeriErrorAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 复位BSU02U1外设错误
** @The notes : 
**===============================================================================================*/
void DiagResetBsu02u1PeriErrorAPI(void);
/*=================================================================================================
** @Name      : u32 DiagJudgeBsu02u1FloodErrorAPI(u8 ecu,u8 id)
** @Input     : void
** @Output    : void
** @Function  : 获取从控水浸异常标志(按位表示1个通道[0,1])
** @The notes : 按位表示1个通道
**===============================================================================================*/
void DiagJudgeBsu02u1FloodErrorAPI(u8 ecu,u8 id,u16 data);
/*=================================================================================================
** @Name      : u32 DiagJudgeBsu02u1TemperErrorAPI(u8 ecu,u8 id)
** @Input     : void
** @Output    : void
** @Function  : 获取从控PT1000异常标志(按位表示1个通道[0,1])
** @The notes : 按位表示1个通道
**===============================================================================================*/
void DiagJudgeBsu02u1TemperErrorAPI(u8 ecu,u8 id,s16 data);
/*=================================================================================================
** @Name      : u32 DiagJudgeBsu02u1AeroSenErrorAPI(u8 ecu,u8 id)
** @Input     : void
** @Output    : void
** @Function  : 获取从控气溶胶传感器异常标志(按位表示1个通道[0,1])
** @The notes : 按位表示1个通道
**===============================================================================================*/
void DiagJudgeBsu02u1AeroSenErrorAPI(u8 ecu,u16 data);
/*=================================================================================================
** @Name      : void DiagJudgeBsu02u1AfeEnumErrorAPI(u8 ecu,u16 botcount, u16 topcount)
** @Input     : ecu：从机节点号 botcount:bot端枚举数据 topcount:top端枚举数目
** @Output    : void
** @Function  : 判断从控afe枚举计数异常
** @The notes : 按位表示1个bsu01u1
**===============================================================================================*/
void DiagJudgeBsu02u1AfeEnumErrorAPI(u8 ecu,u16 botcount, u16 topcount);
/*=================================================================================================
** @Name      : void DiagJudgeBsu02u1MsdErrorAPI(u8 ecu,u16 amplitute, u16 duty)
** @Input     : void
** @Output    : void
** @Function  : 获取MSD异常标志(按位表示1个通道[0,1])
** @The notes : 按位表示1个通道
**===============================================================================================*/
void DiagJudgeBsu02u1MsdErrorAPI(u8 ecu,u16 amplitute, u16 duty);
/*=================================================================================================
** @Name      : u32 DiagGetBsu02u1FloodErrorBitAPI(void)
** @Input     : void
** @Output    : 从控水浸信息异常标志(按位表示1个通道[0,1])
** @Function  : 获取从控水浸异常标志(按位表示1个通道[0,1])
** @The notes : 按位表示1个通道
**===============================================================================================*/
u32 DiagGetBsu02u1FloodErrorBitAPI(void);
/*=================================================================================================
** @Name      : u32 DiagGetBsu02u1TemperErrorBitAPI(void)
** @Input     : void
** @Output    : 从控PT1000温度信息异常标志(按位表示1个通道[0,1])
** @Function  : 获取从控PT1000温度异常标志(按位表示1个通道[0,1])
** @The notes : 按位表示1个通道
**===============================================================================================*/
u32 DiagGetBsu02u1TemperErrorBitAPI(void);
/*=================================================================================================
** @Name      : u32 DiagGetBsu02u1AeroErrorBitAPI(void)
** @Input     : void
** @Output    : 从控气溶胶浓度异常标志(按位表示1个通道[0,1])
** @Function  : 获取气溶胶浓度异常标志(按位表示1个通道[0,1])
** @The notes : 按位表示1个通道
**===============================================================================================*/
u32 DiagGetBsu02u1AeroErrorBitAPI(void);
/*=================================================================================================
** @Name      : u32 DiagGetBsu02u1MsdErrorBitAPI(void)
** @Input     : void
** @Output    : 从控MSD异常标志(按位表示1个通道[0,1])
** @Function  : 获取MSD异常标志(按位表示1个通道[0,1])
** @The notes : 按位表示1个通道
**===============================================================================================*/
u32 DiagGetBsu02u1MsdErrorBitAPI(void);
/*=================================================================================================
** @Name      : u32 DiagGetBsu02u1AfeEnumErrorBitAPI(void)
** @Input     : void
** @Output    : 从控MSD异常标志(按位表示1个通道[0,1])
** @Function  : 获取MSD异常标志(按位表示1个通道[0,1])
** @The notes : 按位表示1个通道
**===============================================================================================*/
u32 DiagGetBsu02u1AfeEnumErrorBitAPI(void);
/*=================================================================================================
** @Name      : u8 DiagGetLeakageOffCommuStateAPI(void)
** @Input     : void
** @Output    : 液冷漏电流传感器通信中断状态[0:正常 1:通信中断]
** @Function  : 获取外设液冷空调通信中断状态
** @The notes :
**===============================================================================================*/
u8 DiagGetLeakageOffCommuStateAPI(void);
#endif
#endif
