/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileGroupRcv.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控接收电池组信息处理模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILEGROUPRCV_H
#define _PILEGROUPRCV_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/
//告警码BIT位解析:
//[0]索引中各分级告警起始Bit位
#define G_WAR_FST_BIT_CELLVH            0     //单体过压分级告警起始Bit位(3bit)
#define G_WAR_FST_BIT_CELLVL            3     //单体欠压分级告警起始Bit位(3bit)
#define G_WAR_FST_BIT_CELLTH            6     //单体高温分级告警起始Bit位(3bit)
#define G_WAR_FST_BIT_CELLTL            9     //单体低温分级告警起始Bit位(3bit)
#define G_WAR_FST_BIT_CELLVDIFF         12    //单体压差过大分级告警起始Bit位(2bit)
#define G_WAR_FST_BIT_CELLTDIFF         14    //单体温差过大分级告警起始Bit位(2bit)

//[1]索引中各分级告警起始Bit位
#define G_WAR_FST_BIT_SUMVH             0     //总压过压分级告警起始Bit位(3bit)
#define G_WAR_FST_BIT_SUMVL             3     //总压欠压分级告警起始Bit位(3bit)
#define G_WAR_FST_BIT_CHGCH             6     //充电过流分级告警起始Bit位(3bit)
#define G_WAR_FST_BIT_DHGCH             9     //放电过流分级告警起始Bit位(3bit)
#define G_WAR_FST_BIT_SOCH              12    //剩余容量SOC高分级告警起始Bit位(2bit)
#define G_WAR_FST_BIT_SOCL              14    //剩余容量SOC低分级告警起始Bit位(2bit)

//[2]索引中各分级告警起始Bit位
#define G_WAR_FST_BIT_EVRTH             0     //环境温度过高分级告警起始Bit位(2bit)
#define G_WAR_FST_BIT_PERTH             2     //外围器件温度过高分级告警起始Bit位(2bit)
#define G_WAR_FST_BIT_LEAK              4     //绝缘告警分级告警起始Bit位(2bit)
#define G_WAR_FST_BIT_BMUOFF            6     //内部BMU通讯异常分级告警起始Bit位(2bit)
#define G_WAR_FST_BIT_BCUOFF            8     //外部BCU通讯异常分级告警起始Bit位(2bit)
#define G_WAR_FST_BIT_VCUOFF            10    //内部HVCU通讯异常分级告警起始Bit位(2bit)
#define G_WAR_FST_BIT_KEEP1             12    //预留分级告警1起始Bit位(2bit)
#define G_WAR_FST_BIT_KEEP2             14    //预留分级告警2起始Bit位(2bit)

//故障码BIT位解析:
//[1]索引中各故障起始Bit位
#define G_ERR_FST_BIT_SWH0REEXP          11    //KM1回检异常(主正接触器回检异常)故障起始Bit位(1bit)
#define G_ERR_FST_BIT_SWH1REEXP          12    //KM2回检异常(预充接触器回检异常)故障起始Bit位(1bit)
#define G_ERR_FST_BIT_SWH2REEXP          13    //KM3回检异常(主负接触器回检异常)故障起始Bit位(1bit)
#define G_ERR_FST_BIT_SWH2REEXP          13    //KM3回检异常(主负接触器回检异常)故障起始Bit位(1bit)

//[2]索引中各故障起始Bit位
#define G_ERR_FST_BIT_BUTEMSTOP          11    //按钮急停故障起始Bit位(1bit)

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
//=============================================================================================
//函数名称	: void ClrPileGroupInfoAPI(u8 group)
//输入参数	: group:组号
//输出参数	: void
//函数功能	: 清除电池堆对应组信息
//注意事项	: 只清除接收信息电池组
//=============================================================================================
void ClrPileGroupInfoAPI(u8 group);

//=============================================================================================
//函数名称	: void ClrPileAllGroupDebugResultAPI(void)
//输入参数	: void
//输出参数	: void
//函数功能	: 清除电池堆所有电池组调试结果信息
//注意事项	: 只清除接收信息电池组
//=============================================================================================
void ClrPileAllGroupDebugResultAPI(void);

//=============================================================================================
//函数名称	: u16 GetPAllGroupEnStateAPI(void)
//输入参数	: void
//输出参数	: 系统激活的所有电池组(按bit位表示1组):0禁用 1激活
//函数功能	: 获取堆控系统激活的所有电池组
//注意事项	: 
//=============================================================================================
u16 GetPAllGroupEnStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPGroupEnStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组激活使能状态 0禁用 1激活
//函数功能	: 获取电池组激活使能状态
//注意事项	: 
//=============================================================================================
u8 GetPGroupEnStateAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPAllGroupNorStateAPI(void)
//输入参数	: void
//输出参数	: 系统内各电池组正常状态(按bit位表示1组):0异常 1正常
//函数功能	: 获取系统内正常状态的电池组
//注意事项	: 激活且无充放电保护
//=============================================================================================
u16 GetPAllGroupNorStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPGroupNorStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组正常状态 0异常 1正常
//函数功能	: 获取电池组正常状态
//注意事项	: 激活且无充放电保护
//=============================================================================================
u8 GetPGroupNorStateAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPAllGroupRunStateAPI(void)
//输入参数	: void
//输出参数	: 系统内电池组运行状态(按bit位表示1组):0未运行 1运行
//函数功能	: 获取运行状态的电池组
//注意事项	: 激活且运行接触器闭合
//=============================================================================================
u16 GetPAllGroupRunStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPGroupRunStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 电池组运行状态 0未运行 1运行
//函数功能	: 获取电池组运行状态
//注意事项	: 激活且运行接触器闭合
//=============================================================================================
u8 GetPGroupRunStateAPI(u8 group);

//=============================================================================================
//函数名称	: u8 GetPGroupCanRcvStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 接收电池组CAN信息状态 0未接收 1接收
//函数功能	: 获取接收电池组CAN信息接收状态
//注意事项	: 包括自身与未激活使能组
//=============================================================================================
u8 GetPGroupCanRcvStateAPI(u8 group);

//=============================================================================================
//函数名称	: u8 GetPAllGroupCanRcvStateAPI(void)
//输入参数	: void
//输出参数	: 所有电池组CAN信息接收状态 FALSE:未接收到所有组 TRUE:接收到所有组
//函数功能	: 获取接收到所有电池组CAN信息状态
//注意事项	: 只包括所有激活使能组(包括自身)
//=============================================================================================
u8 GetPAllGroupCanRcvStateAPI(void);

/*=================================================================================================
** @Name      : u8 GetPGroupCanOffStateAPI(u8 group)
** @Input     : group:组号[0,15]
** @Output    : 堆控与电池组CAN通讯状态 0正常 1断线
** @Function  : 获取与电池组CAN通讯状态
** @The notes : 包括自身和未激活使能组
**===============================================================================================*/
u8 GetPGroupCanOffStateAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPAllGroupCanOffStateAPI(void)
//输入参数	: void
//输出参数	: 各组主控CAN通讯状态(按bit位表示1组) 0正常 1断线
//函数功能	: 获取所有电池组的CAN通讯状态
//注意事项	: 只包括所有激活使能组(包括自身)
//=============================================================================================
u16 GetPAllGroupCanOffStateAPI(void);

//=============================================================================================
//函数名称	: u16 GetPGroupProStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组主控系统保护状态值[0,5]
//函数功能	: 获取对应电池组主控系统保护状态
//注意事项	: 
//=============================================================================================
u16 GetPGroupProStateAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupWorkStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组主控工作状态 0:开机 1:待命 2:启动 3:运行 4:停机 5:故障 6:关机
//函数功能	: 获取电池组主控工作状态
//注意事项	: 
//=============================================================================================
u16 GetPGroupWorkStateAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupChgStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组主控充放电状态 0:空闲 1:充电 2:放电
//函数功能	: 获取电池组主控充放电状态
//注意事项	: 
//=============================================================================================
u16 GetPGroupChgStateAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupWorkModeAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组主控工作模式 0:自动 1:手动 2:紧急  5:调试
//函数功能	: 获取电池组主控工作模式
//注意事项	: 
//=============================================================================================
u16 GetPGroupWorkModeAPI(u8 group);

//=============================================================================================
//函数名称	: u8 GetPGroupIsoSwhStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 电池组断路器状态 1:闭合 0:断开
//函数功能	: 获取电池组断路器状态
//注意事项	: 隔离开关
//=============================================================================================
u8 GetPGroupIsoSwhStateAPI(u8 group);

//=============================================================================================
//函数名称	: u8 GetPGroupMainSwhStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组主接触状态 0:断开 1:闭合
//函数功能	: 获得电池组主接触器状态
//注意事项	: 
//=============================================================================================
u8 GetPGroupMainSwhStateAPI(u8 group);

//=============================================================================================
//函数名称	: u8 GetPGroupPreSwhStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组预充接触器状态 0:断开 1:闭合
//函数功能	: 获得电池组预充接触器状态
//注意事项	: 
//=============================================================================================
u8 GetPGroupPreSwhStateAPI(u8 group);

//=============================================================================================
//函数名称	: u8 GetPGroupNegSwhStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组负接触器状态 0:断开 1:闭合
//函数功能	: 获得电池组负接触器状态
//注意事项	: 
//=============================================================================================
u8 GetPGroupNegSwhStateAPI(u8 group);

//=============================================================================================
//函数名称	: u8 GetPGroupRunSwhAllOffStateAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 电池组运行接触器全断开状态(TRUE:全断开 FALSE:未全断开)
//函数功能	: 获取对应电池组运行接触器全断开状态
//注意事项	: 主接触器/预充接触器/负极接触器
//=============================================================================================
u8 GetPGroupRunSwhAllOffStateAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupChgLimCurrAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组充电电流限值(0.1A)
//函数功能	: 获得电池组充电电流限值
//注意事项	: 
//=============================================================================================
u16 GetPGroupChgLimCurrAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupDhgLimCurrAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组放电电流限值(0.1A)
//函数功能	: 获得电池组放电电流限值
//注意事项	: 
//=============================================================================================
u16 GetPGroupDhgLimCurrAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupChgLimVoltAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组充电电压(总压)限值(0.1V)
//函数功能	: 获取电池组充电电压(总压)限值
//注意事项	:
//=============================================================================================
u16 GetPGroupChgLimVoltAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupDhgLimVoltAPI(u8 group)
//输入参数	: group:组号[0,15]
//输出参数	: 对应组放电电压(总压)限值(0.1V)
//函数功能	: 获取电池组放电电压(总压)限值
//注意事项	: 
//=============================================================================================
u16 GetPGroupDhgLimVoltAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupSSumVoltAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组采样总电压(0.1V)
//函数功能	: 获得电池组采样总电压
//注意事项	: 采样值
//=============================================================================================
u16 GetPGroupSSumVoltAPI(u8 group);

//=============================================================================================
//函数名称	: s16 GetPGroupOutCurrAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组输出电流(0.1A)
//函数功能	: 获得电池组输出电流
//注意事项	: 
//=============================================================================================
s16 GetPGroupOutCurrAPI(u8 group);

//=============================================================================================
//函数名称	: s16 GetPGroupOutPowerAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组输出功率(0.1kW)
//函数功能	: 获得电池组输出功率
//注意事项	:
//=============================================================================================
s16 GetPGroupOutPowerAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupPreVoltAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组采样预充电压(0.1V)
//函数功能	: 获得电池组采样预充电压
//注意事项	: 采样值
//=============================================================================================
u16 GetPGroupPreVoltAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupBattSocAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组电池SOC 0.1%
//函数功能	: 获得电池组电池SOC
//注意事项	: 
//=============================================================================================
u16 GetPGroupBattSocAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupBattSoeAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组电池SOE 0.1%
//函数功能	: 获得电池组电池SOE
//注意事项	: 
//=============================================================================================
u16 GetPGroupBattSoeAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupBattSohAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组电池SOH 0.1%
//函数功能	: 获得电池组电池SOH
//注意事项	: 
//=============================================================================================
u16 GetPGroupBattSohAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupAllCapAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应电池组总容量 1AH
//函数功能	: 获得电池组总容量
//注意事项	:
//=============================================================================================
u16 GetPGroupAllCapAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupCSumVoltAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体总电压(0.1V)
//函数功能	: 获得电池组单体总电压
//注意事项	: 累加值
//=============================================================================================
u16 GetPGroupCSumVoltAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupAvgVoltAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体平均电压(1mV)
//函数功能	: 获得电池组单体平均电压
//注意事项	:
//=============================================================================================
u16 GetPGroupAvgVoltAPI(u8 group);

//=============================================================================================
//函数名称	: s16 GetPGroupAvgTempAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体平均温度(1℃)
//函数功能	: 获得电池组单体平均温度
//注意事项	:
//=============================================================================================
s16 GetPGroupAvgTempAPI(u8 group);

//=============================================================================================
//函数名称	: s16 GetPGroupEnvirTempAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组环境温度(1℃)
//函数功能	: 获得电池组环境温度值
//注意事项	: 采样值
//=============================================================================================
s16 GetPGroupEnvirTempAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupCellMaxVNumAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体最大电压电池号[1,400]
//函数功能	: 获取电池组单体最大电压电池号
//注意事项	:
//=============================================================================================
u16 GetPGroupCellMaxVNumAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupCellMaxVoltAPI(u8 group)
//输入参数	: group:电池组号
//输出参数	: 对应组单体最大电压值(1mv)
//函数功能	: 获取电池组单体最大电压值
//注意事项	:
//=============================================================================================
u16 GetPGroupCellMaxVoltAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupCellMinVNumAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体最小电压电池号[1,400]
//函数功能	: 获取电池组单体最小电压电池号
//注意事项	:
//=============================================================================================
u16 GetPGroupCellMinVNumAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupCellMinVoltAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体最小电压值(1mv)
//函数功能	: 获取电池组单体最小电压值
//注意事项	: 
//=============================================================================================
u16 GetPGroupCellMinVoltAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupCellMaxTNumAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体最高温度序号[1,400]
//函数功能	: 获取电池组单体最高温度序号
//注意事项	:
//=============================================================================================
u16 GetPGroupCellMaxTNumAPI(u8 group);

//=============================================================================================
//函数名称	: s16 GetPGroupCellMaxTempAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体最高温度值(1℃)
//函数功能	: 获取电池组单体最高温度值
//注意事项	: 
//=============================================================================================
s16 GetPGroupCellMaxTempAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupCellMinTNumAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体最低温度序号[1,400]
//函数功能	: 获取电池组单体最低温度序号
//注意事项	:
//=============================================================================================
u16 GetPGroupCellMinTNumAPI(u8 group);

//=============================================================================================
//函数名称	: s16 GetPGroupCellMinTempAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单体最低温度值(1℃)
//函数功能	: 获取电池组单体最低温度值
//注意事项	: 
//=============================================================================================
s16 GetPGroupCellMinTempAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupCanChgTimeAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组可充电时间(1min)
//函数功能	: 获得电池组可充电时间
//注意事项	: 
//=============================================================================================
u16 GetPGroupCanChgTimeAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupCanDhgTimeAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组可放电时间(1min)
//函数功能	: 获得电池组可放电时间
//注意事项	: 
//=============================================================================================
u16 GetPGroupCanDhgTimeAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupChgTimesAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组充放电次数
//函数功能	: 获得电池组充放电次数
//注意事项	: 
//=============================================================================================
u16 GetPGroupChgTimesAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupMonWarNumAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组当月告警数目
//函数功能	: 获得电池组当月告警数目
//注意事项	:
//=============================================================================================
u16 GetPGroupMonWarNumAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupMonErrNumAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组当月故障数目
//函数功能	: 获得电池组当月故障数目
//注意事项	:
//=============================================================================================
u16 GetPGroupMonErrNumAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupHisWarNumAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组历史告警数目
//函数功能	: 获得电池组历史告警数目
//注意事项	: 
//=============================================================================================
u16 GetPGroupHisWarNumAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupHisErrNumAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组历史故障数目
//函数功能	: 获得电池组历史故障数目
//注意事项	: 
//=============================================================================================
u16 GetPGroupHisErrNumAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupRemainEnerAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组剩余电能 0.1kWh
//函数功能	: 获得电池组剩余电能
//注意事项	: 
//=============================================================================================
u16 GetPGroupRemainEnerAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupAllEnerAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组总电能 0.1kWh
//函数功能	: 获得电池组总电能
//注意事项	: 
//=============================================================================================
u16 GetPGroupAllEnerAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupNowChgCapAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单次充电电量 1AH
//函数功能	: 获得电池组单次充电电量
//注意事项	: 
//=============================================================================================
u16 GetPGroupNowChgCapAPI(u8 group);

//=============================================================================================
//函数名称	: u16 GetPGroupNowDhgCapAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组单次放电电量 1AH
//函数功能	: 获得电池组单次放电电量
//注意事项	: 
//=============================================================================================
u16 GetPGroupNowDhgCapAPI(u8 group);

//=============================================================================================
//函数名称	: u32 GetPGroupHisChgCapAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组历史充电电量 1AH
//函数功能	: 获得电池组历史充电电量
//注意事项	: 
//=============================================================================================
u32 GetPGroupHisChgCapAPI(u8 group);

//=============================================================================================
//函数名称	: u32 GetPGroupHisDhgCapAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组历史放电电量 1AH
//函数功能	: 获得电池组历史放电电量
//注意事项	: 
//=============================================================================================
u32 GetPGroupHisDhgCapAPI(u8 group);

//=============================================================================================
//函数名称	: u32 GetPGroupHisChgEnerAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组历史充电电能 0.1kWh
//函数功能	: 获得电池组历史充电电能
//注意事项	: 
//=============================================================================================
u32 GetPGroupHisChgEnerAPI(u8 group);

//=============================================================================================
//函数名称	: u32 GetPGroupHisDhgEnerAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 对应组历史放电电能 0.1kWh
//函数功能	: 获得电池组历史放电电能
//注意事项	: 
//=============================================================================================
u32 GetPGroupHisDhgEnerAPI(u8 group);
//=============================================================================================
//函数名称	: u16 GetPGroupCtrlResultAPI(u8 group, u8 index)
//输入参数	: group:电池组号[0,15] index:控制结果信息子索引号[0,7]
//输出参数	: 对应组控制结果指定子索引信息
//函数功能	: 获得电池组控制结果信息
//注意事项	:
//=============================================================================================
u16 GetPGroupCtrlResultAPI(u8 group, u8 index);

//=============================================================================================
//函数名称	: u16 GetPGroupDebugResultAPI(u8 group, u8 index)
//输入参数	: group:电池组号[0,15] index:调试信息子索引号[0,7]
//输出参数	: 对应组调试结果指定子索引信息
//函数功能	: 获得电池组调试结果信息
//注意事项	:
//=============================================================================================
u16 GetPGroupDebugResultAPI(u8 group, u8 index);

//=============================================================================================
//函数名称	: u8 GetPGroupAllPreSafeCStateAPI(void)
//输入参数	: void
//输出参数	: 所有电池组预充电流安全状态 0:不安全 1:安全
//函数功能	: 获取所有电池组预充电流安全状态
//注意事项	: 使能且预充接触器闭合电池组
//=============================================================================================
u8 GetPGroupAllPreSafeCStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPGroupAllMainSafeCStateAPI(void)
//输入参数	: void
//输出参数	: 所有电池组主回路电流安全状态 0:不安全 1:安全
//函数功能	: 获取所有电池组主回路电流安全状态
//注意事项	: 使能且主接触器闭合电池组
//=============================================================================================
u8 GetPGroupAllMainSafeCStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPGroupMainSafeCStateAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 相应组主回路电流安全状态 0:不安全 1:安全
//函数功能	: 获取电池组主回路电流安全状态
//注意事项	: 
//=============================================================================================
u8 GetPGroupMainSafeCStateAPI(u8 group);

//=============================================================================================
//函数名称	: u8 GetPGroupEmStopStateAPI(u8 group)
//输入参数	: group:电池组号[0,15]
//输出参数	: 相应组紧急停机状态 0:非急停 1:急停
//函数功能	: 获取电池组紧急停机状态
//注意事项	: 手动按钮急停
//=============================================================================================
u8 GetPGroupEmStopStateAPI(u8 group);

//=============================================================================================
//函数名称	: u8 GetPAllGroupCellVLStateAPI(void)
//输入参数	: group:电池组号[0,15]
//输出参数	: 相应组电池组低压告警状态  0:正常 1:一级故障 2:二级告警
//函数功能	: 获取电池组低压告警状态
//注意事项	: 上电的电池组
//=============================================================================================
u8 GetPAllGroupCellVLStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPAllGroupLeakStateAPI(void)
//输入参数	: group:电池组号[0,15]
//输出参数	: 相应组电池组绝缘告警状态  0:正常 1:一级故障 2:二级告警
//函数功能	: 获取电池组绝缘告警状态
//注意事项	: 上电的电池组
//=============================================================================================
u8 GetPAllGroupLeakStateAPI(void);

//=============================================================================================
//函数名称	: u8 GetPGroupRcvWarStateAPI(u8 group, u8 id)
//输入参数	: group:电池组号[0,15] id:告警码[0,47]
//输出参数	: 接收到对应组告警码状态 0:正常 1:告警
//函数功能	: 获取接收到主控的告警码状态
//注意事项	:
//=============================================================================================
u8 GetPGroupRcvWarStateAPI(u8 group, u8 id);

//=============================================================================================
//函数名称	: u8 GetPGroupRcvErrStateAPI(u8 group, u8 id)
//输入参数	: group:电池组号[0,15] id:故障码[0,47]
//输出参数	: 接收到对应组故障码状态 0:正常 1:故障
//函数功能	: 获取接收到主控的故障码状态
//注意事项	: 
//=============================================================================================
u8 GetPGroupRcvErrStateAPI(u8 group, u8 id);

//=============================================================================================
//函数名称	: u16 GetPGroupRcvWarInfoAPI(u8 group, u8 index)
//输入参数	: group:电池组号[0,15] index:告警信息索引[0,2]
//输出参数	: 接收到对应组告警信息(每bit为1个告警)
//函数功能	: 获取接收到主控的告警信息
//注意事项	:
//=============================================================================================
u16 GetPGroupRcvWarInfoAPI(u8 group, u8 index);

//=============================================================================================
//函数名称	: u16 GetPGroupRcvErrInfoAPI(u8 group, u8 index)
//输入参数	: group:电池组号[0,15] index:故障信息索引[0,2]
//输出参数	: 接收到对应组故障信息(每bit为1个故障)
//函数功能	: 获取接收到主控的故障信息
//注意事项	:
//=============================================================================================
u16 GetPGroupRcvErrInfoAPI(u8 group, u8 index);

#endif
#endif
