/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : PileUserAPI.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 堆控用户接口任务模块
** @Instructions : 
**===============================================================================================*/
#ifndef _PILEUSERAPI_H
#define _PILEUSERAPI_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"
#include "PileUpMsg.h"
#include "PileDnMsg.h"
#include "PileCatlMsg.h"

#if(1 == PILE_MANAG_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void PileAllUserInit(void)
** @Input     : void
** @Output    : void
** @Function  : 堆控所有任务初始化
** @The notes : 用户初始化调用
**===============================================================================================*/
void PileAllUserInit(void);

/*=================================================================================================
** @Name      : void PileAllTimer10msTask(void *p)
** @Input     : *p:输入参数需要
** @Output    : void
** @Function  : 堆控总定时10ms周期任务
** @The notes : 创建10ms任务
**===============================================================================================*/
void PileAllTimer10msTask(void *p);

/*=================================================================================================
** @Name      : void PileSysIoUpDnCtrlTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池堆系统按钮启停控制任务
** @The notes : 1s周期
**===============================================================================================*/
void PileSysIoUpDnCtrlTask(void);

/*=================================================================================================
** @Name      : void PileSysPwrOffProTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池堆系统关机下电保护任务
** @The notes : 1s周期
**===============================================================================================*/
void PileSysPwrOffProTask(void);

//=============================================================================================
//函数名称	: void PileSetSelfGroupOperAuthCmdAPI(u8 index, u16 password)
//输入参数	: port:设置端口[0,4]CAN口 [5,9]RS485口 index:子索引[0,1] password:操作权限密码
//输出参数	: void
//函数功能	: 堆控设置自身电池组操作权限命令
//注意事项	: 主索引85
//=============================================================================================
void PileSetSelfGroupOperAuthCmdAPI(u8 port, u8 index, u16 password);

//=============================================================================================
//函数名称	: void PileSetSelfGroupSysCtrlCmdAPI(u8 index, u8 cmd)
//输入参数	: index:子索引[0,2] cmd:系统控制命令
//输出参数	: void
//函数功能	: 堆控设置自身电池组系统控制命令
//注意事项	: 主索引86
//=============================================================================================
void PileSetSelfGroupSysCtrlCmdAPI(u8 index, u8 cmd);

//=============================================================================================
//函数名称	: void PileSetSelfGroupUserCtrlCmdAPI(u8 index, u8 len, u16 *cmd)
//输入参数	: index:子索引[0,7] len:子索引长度 *cmd:用户控制命令
//输出参数	: void
//函数功能	: 堆控设置自身电池组用户控制命令
//注意事项	: 主索引87
//=============================================================================================
void PileSetSelfGroupUserCtrlCmdAPI(u8 index, u8 len, u16 *cmd);

//=============================================================================================
//函数名称	: void PileSetSelfGroupSysDebugCmdAPI(u8 index, u8 len, u16 *cmd)
//输入参数	: index:子索引[0,7] len:子索引长度 *cmd:系统调试命令
//输出参数	: void
//函数功能	: 堆控设置自身电池组系统调试命令
//注意事项	: 主索引88
//=============================================================================================
void PileSetSelfGroupSysDebugCmdAPI(u8 index, u8 len, u16 *cmd);

/*=================================================================================================
** @Name      : u8 GetPileSysRunFlagAPI(void)
** @Input     : void
** @Output    : 扩展堆控系统运行标志 0:未启用 1:运行为扩展堆控
** @Function  : 获取扩展堆控系统运行标志
** @The notes : 判断是否为并机主机系统
**===============================================================================================*/
u8 GetPileSysRunFlagAPI(void);

/*=================================================================================================
** @Name      : u8 GetPileButStopReqFlagAPI(void)
** @Input     : void
** @Output    : 扩展堆控请求停机标志 0:未请求 1:请求停机
** @Function  : 获取扩展堆控请求停机标志
** @The notes : 判断是否需要高压下电停机
**===============================================================================================*/
u8 GetPileButStopReqFlagAPI(void);

//=============================================================================================
//函数名称	: u8 GetPileGPowerOnStateAPI(void)
//输入参数	: void
//输出参数	: 堆控控制主控供电电源状态 0:断开 1:闭合
//函数功能	: 获取堆控控制主控供电电源状态
//注意事项	: 堆控控制主控低压供电电源
//=============================================================================================
u8 GetPileGPowerOnStateAPI(void);

/*=================================================================================================
** @Name      : void PileRcvUpMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum)
** @Input     : ID:CANID *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : 堆控上层(PCS)CAN通信报文接收处理任务
** @The notes : 用户放在CAN接收处理HOOK接口调用
**===============================================================================================*/
extern void PileRcvUpMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum);

/*=================================================================================================
** @Name      : void PileRcvDnMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum)
** @Input     : ID:CANID *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : 堆控下层(主控)CAN通信报文接收处理任务
** @The notes : 用户放在CAN接收处理HOOK接口调用
**===============================================================================================*/
extern void PileRcvDnMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum);

//================================== ===========================================================
//函数名称	: u8 PileSendDnGroupBreathMsg_API(void)
//输入参数	: void
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发心跳帧报文
//注意事项	: 向CAN0发报文(1s)
//=============================================================================================
extern u8 PileSendDnGroupBreathMsg_API(void);

//================================== ===========================================================
//函数名称	: u8 PileSendDnGroupOperAuthCmdMsg_API(u8 group, u8 auth)
//输入参数	: group:组号[0,15] 0xff:广播所有组 auth:权限命令(0:普通 1:运维 2:高级 3:超级)
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发操作权命令报文
//注意事项	: 向CAN0发报文(主索引85,不包括控制自身所在组)
//=============================================================================================
extern u8 PileSendDnGroupOperAuthCmdMsg_API(u8 group, u8 auth);

//================================== ===========================================================
//函数名称	: u8 PileSendDnGroupSysCtrlCmdMsg_API(u8 group, u8 index, u16 cmd)
//输入参数	: group:组号[0,15] 0xff:广播所有组 index:子索引号[0,2] cmd:命令
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发系统控制命令报文
//注意事项	: 向CAN0发报文(主索引86,不包括控制自身所在组)
//=============================================================================================
extern u8 PileSendDnGroupSysCtrlCmdMsg_API(u8 group, u8 index, u16 cmd);

//================================== ===========================================================
//函数名称	: u8 PileSendDnGroupUserCtrlCmdMsg_API(u8 group, u8 index, u8 len, u16 *cmd)
//输入参数	: group:组号[0,15] 0xff:广播所有组 index:起始子索引号[0,7] len:子索引长度[0, 8] *cmd:命令
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发用户控制命令报文
//注意事项	: 向CAN0发报文(主索引87,不包括控制自身所在组)
//=============================================================================================
extern u8 PileSendDnGroupUserCtrlCmdMsg_API(u8 group, u8 index, u8 len, u16 *cmd);

//=============================================================================================
//函数名称	: u8 PileSendDnGroupSysDebugCmdMsg_API(u8 group, u8 index, u8 len, u16 *cmd)
//输入参数	: group:组号[0,15] 0xff:广播所有组 index:起始子索引号[0,7] len:子索引长度[0, 8] *cmd:命令
//输出参数	: TRUE:成功 FALSE:失败
//函数功能	: 堆控向电池组下发系统调试命令报文
//注意事项	: 向CAN0发报文(主索引88,不包括控制自身所在组)
//=============================================================================================
extern u8 PileSendDnGroupSysDebugCmdMsg_API(u8 group, u8 index, u8 len, u16 *cmd);

/*=================================================================================================
** @Name      : void PileCanRcvCatlMsgHandleAPI(t_CANMSG *msg, u8 canNum)
** @Input     : msg:接收到的报文 canNum:接收CAN通道号
** @Output    : void
** @Function  : 兼容CATL电池协议CAN报文接收处理
** @The notes : CAN接收回调函数调用
**===============================================================================================*/
extern void PileCanRcvCatlMsgHandleAPI(t_CANMSG *msg, u8 canNum);

#endif
#endif
