/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : AuxDevTactic.c
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 辅助设备控制策略模块
** @Instructions :
**===========================================================================================*/
#ifndef _AUXDEVTACTIC_H
#define _AUXDEVTACTIC_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define IMEU2_SHUTFAN_CTRL_T        (5)    /*IMEU2百叶风机控制(状态改变)必须间隔时间,1s(默认10s)*/
#define IMEU2_SHUTFAN_VENT_T        (120)   /*IMEU2百叶风机通风开启时长,1s(默认60s)*/
#define IMEU2_SHUTFAN_WAIT_T        (30)    /*IMEU2百叶风机通风间隔时长,1天(默认30天)*/

extern u16 MU2KeepPowerMode;   //保供电模式
extern s16 sAvgCurr1min;
extern u16 MU2CellTemSpePoinCmd;
extern u8 MU2ResetAFE_SOC_Flag;            //重置AFE状态时是否校准SOC标志
extern u8 PcsFanDuty;
extern u8 PduFanDuty;

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*IMLU2灯带颜色*/
typedef enum
{
	e_Imlu2_Black = 0,
	e_Imlu2_White,
	e_Imlu2_Yellow,
	e_Imlu2_Blue,
	e_Imlu2_Red,
	e_Imlu2_Green,
	e_Imlu2_Orange
}e_Imlu2Color;
/*辅助设备控制异常标志位*/
typedef enum
{
    eAuxErr_ShutOn  = 0,                /*bit0:开启泄爆阀异常 */
	eAuxErr_ShutOff = 1,                /*bit1:关闭泄爆阀异常*/
	eAuxErr_Fan   = 2,                  /*bit2:排气扇异常*/
	eAuxErr_AirWarn = 3,                /*bit3:空调告警*/

	eAuxErr_BitLen
}e_AuxErrBit;

/*辅助设备通信异常标志位*/
typedef enum
{
    eAuxComErr_Air  = 0,                /*bit0:空调 */
	eAuxComErr_TH1  = 1,                /*bit1:温湿度传感器1*/
	eAuxComErr_TH2  = 2,                /*bit2:温湿度传感器2*/
	eAuxComErr_TH3  = 3,                /*bit3:温湿度传感器3*/
	eAuxComErr_Gas1 = 4,                /*bit4:气体传感器1*/
	eAuxComErr_Gas2 = 5,                /*bit5:气体传感器2*/
	eAuxComErr_Gas3 = 6,                /*bit6:气体传感器3*/

	eAuxComErr_BitLen
}e_AuxComErrBit;
/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void TacAuxDevManagTask(void)
** @Input     : void
** @Output    : void
** @Function  : 辅助板管理任务
** @The notes : 500ms驱动1s周期
**===========================================================================================*/
void TacAuxDevManagTask(void);

/*使能IMEU2通信交互*/
#if(1 == BMU_IMEU_COM_EN)
/*=============================================================================================
** @Name      : void TacSetAuxDevAirTypeAPI(u8 type)
** @Input     : flag:空调类型 0:黑盾 1:同飞
** @Output    : void
** @Function  : 设置空调类型
** @The notes :
**===========================================================================================*/
void TacSetAuxDevAirTypeAPI(u8 type);

/*=================================================================================================
** @Name      : void TacRcvImeuMsgAddAPI(u8 addr)
** @Input     : addr:设备地址
** @Output    : void
** @Function  : 接收IMEU2通信信息地址数目计数
** @The notes : 接收到IMEU2报文时调用
**===============================================================================================*/
//void TacRcvImeuMsgAddAPI(u8 addr);
#endif

/*=============================================================================================
** @Name      : void TacSetAuxShutUserCmdAPI(u8 cmd)
** @Input     : void
** @Output    : 百叶风机用户控制命令(0:关闭 1:开启)
** @Function  : 设置百叶风机用户控制命令
** @The notes : IMEU2控制
**===========================================================================================*/
void TacSetAuxShutUserCmdAPI(u8 cmd);

/*=============================================================================================
** @Name      : void TacSetAuxRackLightCmdAPI(u8 cmd)
** @Input     : void
** @Output    : 电池柜照明用户控制命令( 0:自动控制 1:手动开启   2:手动关闭)
** @Function  : 设置电池柜照明用户强制控制命令
** @The notes : IMEU2控制
**===========================================================================================*/
void TacSetAuxRackLightCmdAPI(u8 cmd);

/*=============================================================================================
** @Name      : void TacSetAuxZHSAForceCmdAPI(u8 cmd)
** @Input     : void
** @Output    : 声光报警器用户控制命令( 0:自动控制 1:强制开启 2:强制关闭)
** @Function  : 设置声光报警器用户强制控制命令
** @The notes : IMEU2控制
**===========================================================================================*/
void TacSetAuxZHSAForceCmdAPI(u8 cmd);

/*=============================================================================================
** @Name      : void TacSetAuxFireTrigCmdAPI(u8 cmd)
** @Input     : void
** @Output    : 气溶胶消防器用户触发命令( 0:自动触发 1:手动触发)
** @Function  : 设置气溶胶消防器用户触发命令
** @The notes : IMEU2控制
**===========================================================================================*/
void TacSetAuxFireTrigCmdAPI(u8 cmd);
/*=============================================================================================
** @Name      : u16 TacGetAuxDevErrFlagAPI(void)
** @Input     : void
** @Output    : 辅助设备异常标志(bit0:开启百叶异常 bit1:开启风机异常 bit2:空调告警 bit8:关闭百叶异常 bit9:关闭风机异常 bit10:空调通信中断)
** @Function  : 获取辅助设备异常标志
** @The notes : IMEU2控制设备
**===========================================================================================*/
u16 TacGetAuxDevErrFlagAPI(void);

/*=============================================================================================
** @Name      : u8 TacGetAuxComErrFlagAPI(void)
** @Input     : void
** @Output    : 辅助设备通信异常标志 bit0:空调 bit1:温湿度传感器1 bit2:温湿度传感器1 bit3:温湿度传感器 bit4:气体传感器1 bit5:气体传感器2 bit6:气体传感器3
** @Function  : 获取辅助设备通讯异常标志
** @The notes : IMEU2控制设备
**===========================================================================================*/
u8 TacGetAuxComErrFlagAPI(void);
/*=============================================================================================
** @Name      : void TacSetPwmFanUserCmdAPI(u8 id, u8 duty)
** @Input     : id:[0:2]:风扇ID, 0XFF:所有风扇   duty:控制转速占空比[0,100]1%
** @Output    : 设置调速风扇用户控制命令
** @Function  : 设置声光报警器用户强制控制命令
** @The notes : 第一路：PDU风扇 第二路：PCS散热风扇  第三路：泄爆阀排气扇
**===========================================================================================*/
void TacSetPwmFanUserCmdAPI(u8 id, u8 duty);
/*=============================================================================================
** @Name      : void TacSetAirDebugCmdAPI(u8 cmd)
** @Input     : void
** @Output    : 空调调试用户控制命令( 0:自动控制 1:强制制热  2:强制制冷 3：自循环)
** @Function  : 空调用户强制控制命令
** @The notes : IMEU3控制
**===========================================================================================*/
void TacSetAirDebugCmdAPI(u8 cmd);
/*=============================================================================================
** @Name      : u8 TacGetSpdErrFlagAPI(void)
** @Input     : void
** @Output    : SPD告警标志 0：正常 1：告警
** @Function  : 获取辅助设备通讯异常标志
** @The notes : IMEU2控制设备
**===========================================================================================*/
u8 TacGetSpdErrFlagAPI(void);
//#if(BMU_IMLU2_EN == 1)
/*=================================================================================================
** @Name      : void RcvMU2LightColorCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取灯带颜色
** @The notes : 通过MU2下发指令和BMU自身充放电状态综合判断
**===============================================================================================*/
void RcvMU2LightColorCmdAPI(u16 Data);
/*=================================================================================================
** @Name      : void RcvMU2PcsAirCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取模块侧空调开关机指令
** @The notes : 通过MU2下发指令控制空调模块测液路开关机
**===============================================================================================*/
void RcvMU2PcsAirCmdAPI(u16 Data);
/*=================================================================================================
** @Name      : void RcvMU2CellAirCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取电池侧空调开关机指令
** @The notes : 通过MU2下发指令控制空调电池侧液路开关机
**===============================================================================================*/
void RcvMU2CellAirCmdAPI(u16 Data);
/*=================================================================================================
** @Name      : void RcvMU2AirNoiseCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取空调降噪指令
** @The notes : 通过MU2下发指令控制空调降噪开启或关闭
**===============================================================================================*/
void RcvMU2AirNoiseCmdAPI(u16 Data);
/*=================================================================================================
** @Name      : void void RcvMU2_TFAirON_OFF_ResetCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取TF空调开关机及报警复位指令
** @The notes : 通过MU2下发指令控制TF空调开关机及报警复位
**===============================================================================================*/
void RcvMU2_TFAirON_OFF_ResetCmdAPI(u16 Data);
/*=================================================================================================
** @Name      : void  RcvMU2_TFAir_Type_CmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取TF空调模式选择指令
** @The notes : 通过MU2下发指令控制TF空调选择高收益还是长寿命模式
**===============================================================================================*/
void RcvMU2_TFAir_Type_CmdAPI (u16 Data);
/*=================================================================================================
** @Name      : void  RcvMU2_XMAir_Type_CmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取XM空调模式选择指令
** @The notes : 通过MU2下发指令控制XM空调选择高收益还是长寿命模式
**===============================================================================================*/
void RcvMU2_XMAir_Type_CmdAPI (u16 Data);
/*=================================================================================================
** @Name      : void RcvMU2CellTemSpeCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取电池特殊点位温度屏蔽指令
** @The notes : 通过MU2下发指令控制是否屏蔽电池特殊点位的温度
**===============================================================================================*/
void RcvMU2CellTemSpeCmdAPI(u16 Data);
/*=================================================================================================
** @Name      : void RcvMU2Eu3CellWaterPump_ManualCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制电池水泵标志
** @The notes : 通过MU2下发指令控制是否手动控电池水泵标志
**===============================================================================================*/
void RcvMU2Eu3CellWaterPump_ManualCmdAPI(u16 Data);      
/*=================================================================================================
** @Name      : void RcvMU2Eu3CellWaterPump_SpdCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制电池水泵转速 单位：1%
** @The notes : 通过MU2下发指令手动控制水泵转速
**===============================================================================================*/
void RcvMU2Eu3CellWaterPump_SpdCmdAPI(u16 Data);     
/*=================================================================================================
** @Name      : void RcvMU2Eu3ModWaterPump_ManualCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制模块水泵标志
** @The notes : 通过MU2下发指令手动控制模块水泵
**===============================================================================================*/
void RcvMU2Eu3ModWaterPump_ManualCmdAPI(u16 Data);      
/*=================================================================================================
** @Name      : void RcvMU2Eu3ModWaterPump_SpdCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制模块水泵转速 单位：1%
** @The notes : 通过MU2下发指令手动控制模块水泵转速
**===============================================================================================*/
void RcvMU2Eu3ModWaterPump_SpdCmdAPI(u16 Data);         
/*=================================================================================================
** @Name      : void RcvMU2ElecExpValve_ManualCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制主电子膨胀阀标志
** @The notes : 通过MU2下发指令手动控制主电子膨胀阀标志
**===============================================================================================*/
void RcvMU2ElecExpValve_ManualCmdAPI(u16 Data);    
/*=================================================================================================
** @Name      : void RcvMU2ElecExpValve_PulseCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制主电子膨胀阀开度
** @The notes : 通过MU2下发指令手动控制主电子膨胀阀开度
**===============================================================================================*/
void RcvMU2ElecExpValve_PulseCmdAPI(u16 Data);  
/*=================================================================================================
** @Name      : void RcvMU2Fan_ManualCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制风机标志
** @The notes : 通过MU2下发指令手动控制风机标志
**===============================================================================================*/
void RcvMU2Fan_ManualCmdAPI(u16 Data);                  
/*=================================================================================================
** @Name      : void RcvMU2Fan_SpdCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制风机转速
** @The notes : 通过MU2下发指令手动控制风机转速
**===============================================================================================*/
void RcvMU2Fan_SpdCmdAPI(u16 Data);   
/*=================================================================================================
** @Name      : void RcvMU2Compressor_ManualCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制压缩机频率标志
** @The notes : 通过MU2下发指令手动控制压缩机频率标志
**===============================================================================================*/
void RcvMU2Compressor_ManualCmdAPI(u16 Data);      
/*=================================================================================================
** @Name      : void RcvMU2Compressor_FreqCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制压缩机频率
** @The notes : 通过MU2下发指令手动控制压缩机频率(HZ)
**===============================================================================================*/
void RcvMU2Compressor_FreqCmdAPI(u16 Data);    
/*=================================================================================================
** @Name      : void RcvMU2CellHeat_ManualCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制电加热标志
** @The notes : 通过MU2下发指令手动控制电加热标志
**===============================================================================================*/
void RcvMU2CellHeat_ManualCmdAPI(u16 Data);      
/*=================================================================================================
** @Name      : void RcvMU2CellHeat_OnOffCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制电加热
** @The notes : 通过MU2下发指令手动控制电加热
**===============================================================================================*/
void RcvMU2CellHeat_OnOffCmdAPI(u16 Data);     
/*=================================================================================================
** @Name      : void RcvMU2BatHeatFilm_ManualCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制曲轴电加热标志
** @The notes : 通过MU2下发指令手动控制曲轴电加热标志
**===============================================================================================*/
void RcvMU2BatHeatFilm_ManualCmdAPI(u16 Data);      
/*=================================================================================================
** @Name      : void RcvMU2BatHeatFilm_OnOffCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制曲轴电加热
** @The notes : 通过MU2下发指令手动控制曲轴电加热
**===============================================================================================*/
void RcvMU2BatHeatFilm_OnOffCmdAPI(u16 Data);      
/*=================================================================================================
** @Name      : void RcvMU2CompDrvFan_ManualCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制压缩机驱动器散热风机标志
** @The notes : 通过MU2下发指令手动控制压缩机驱动器散热风机标志
**===============================================================================================*/
void RcvMU2CompDrvFan_ManualCmdAPI(u16 Data);     
/*=================================================================================================
** @Name      : void RcvMU2CompDrvFan_SpdCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制压缩机驱动器散热风机转速
** @The notes : 通过MU2下发指令手动控制压缩机驱动器散热风机转速
**===============================================================================================*/
void RcvMU2CompDrvFan_SpdCmdAPI(u16 Data);    
/*=============================================================================
** @Name      : void RcvMU2DiagKeepPowerModeCmdAPI(u16 Data)
** @Input     : Data: MU2下发的保供电模式指令数据 (0: 正常模式, 1: 保供电模式)
** @Output    : void
** @Function  : 接收并设置保供电模式状态
**===========================================================================*/
void RcvMU2DiagKeepPowerModeCmdAPI(u16 Data);  
/*=================================================================================================
** @Name      : void RcvMU2ManualCalibration_SOCCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动校准SOC
** @The notes : 通过MU2下发指令手动校准SOC
**===============================================================================================*/
void RcvMU2ManualCalibration_SOCCmdAPI(u16 Data);    
/*=================================================================================================
** @Name      : void RcvMU2ResetAFEstatusCmdAPI(u16 Data)
** @Input     : Data:MU2下发的指示灯状态
** @Output    : void
** @Function  : 获取手动控制重置AFE状态
** @The notes : 通过MU2下发指令手动控制重置AFE状态
**===============================================================================================*/
void RcvMU2ResetAFEstatusCmdAPI(u16 Data);    
/*=================================================================================================
** @Name      : void RcvMU2ResetBSUstatusCmdAPI(u16 Data)
** @Input     : Data:下发的从控序号
** @Output    : void
** @Function  : 获取手动控制重置BSU状态
** @The notes : 通过MU2下发指令手动控制重置BSU状态
**===============================================================================================*/
void RcvMU2ResetBSUstatusCmdAPI(u16 Data);   
/*=================================================================================================
** @Name      : u8 JudgeImlu2LightStripColor(void)
** @Input     : void
** @Output    : void
** @Function  : 判断IMLU2灯带颜色显示
** @The notes : 通过MU2下发指令和BMU自身充放电状态综合判断
**===============================================================================================*/
u8 JudgeImlu2LightStripColor(void);
/*=================================================================================================
** @Name      : void RcvImeu2MsgAddAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 接收IMLU2信息时调用
** @The notes : 接收到信息时调用
**===============================================================================================*/
void RcvImeu2MsgAddAPI(void);
/*=================================================================================================
** @Name      : void ClearImeu2MsgAddAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清空IMLU2通信计数
** @The notes : 接收到信息时调用
**===============================================================================================*/
void ClearImeu2MsgAddAPI(void);
/*=================================================================================================
** @Name      : u8 GetImeu2MsgAddAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 获取IMLU2通信计数
** @The notes :
**===============================================================================================*/
u8 GetImeu2MsgAddAPI(void);
//#endif
//#if(BMU_LEAKAGE_EN == 1)
/*=================================================================================================
** @Name      : void TacLeakageConnTask(void)
** @Input     : void
** @Output    : void
** @Function  : 漏电流传感器通信任务
** @The notes : 1s,通过RS485通信执行
**===============================================================================================*/
void TacLeakageConnTask(void);
//#endif
#endif

