/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : CANUser.c
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : CAN通信包用户接口
** @Instructions :
**===============================================================================================*/

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "BSPUserAPI.h"
#include "PublicPara.h"
#include "GroupPara.h"
#include "PublicInfo.h"
#include "GroupInfo.h"
#include "CANInterface.h"
#include "CANUser.h"

/*=================================================================================================
** @Global variable definition
**===============================================================================================*/
/*=======================================校时信息=================================================*/
u16 gCANVerTime_0[CANINDEX0_LEN] =
{
    2020,                           /*系统时间-年*/
    0x0101,                         /*系统时间-月/日*/
    0x0,                            /*系统时间-时/分*/
    0x0                             /*系统时间-毫秒*/
};

/*=======================================设备信息=================================================*/
u16 gCANDevInfo_1[CANINDEX1_LEN] =
{
    BMU_DEV_ID,                     /*设备识别码*/
    BMU_BAS_DEVADDR,                /*设备地址*/
    BMU_HW_VER,                     /*硬件版本号*/
    BMU_SW_VERL,                    /*软件支线版本号*/
    BMU_SW_VERH ,                   /*软件主线版本号*/
    0x0100,                         /*BSP版本号*/
    0x0100,                         /*CAN协议包版本号*/
    0x0100                          /*ModBus协议包版本号*/
};

/*=======================================序列号信息===============================================*/
u8 gCANSerialNum_2[CANINDEX2_LEN] =
{
    0x0                             /*设备序列号信息(最高字符在低位)*/
};

/*=======================================基本配置信息=============================================*/
u8 gCANBaseDef_3[CANINDEX3_LEN] =
{
    CAN_DEVTAB_NUM,                 /*通信设备表数目*/
    BMU_INDEX_NUM,                  /*主控主索引数目*/
    CAN_TRTAB_NUM,                  /*收发通信表数目*/
    CAN_TX_VER_NUM,                 /*主动发送校时帧信息配置组数*/
    CAN_TX_BRE_NUM,                 /*主动上传心跳帧信息配置组数*/
    CAN_TX_MUL_NUM,                 /*主动更新发送长帧配置组数*/
    CAN_TX_SIN_NUM,                 /*主动更新发送单帧配置组数*/
    CAN_TX_CEL_NUM,                 /*主动上传单体信息配置组数*/
    CAN_TX_PAR_NUM                  /*主动上传参数信息配置组数*/
};

/*=======================================CAN路由信息==============================================*/
u8 gCANRoutDef_4[CANINDEX4_LEN] =
{
    0,                              /*路由功能使能*/
    CAN_ROUTE_NUM,                  /*路由CAN通道数*/

    eCAN0,                          /*路由口1通道号*/
    CAN_ROUTE0_NUM,                 /*路由口1转发通道数*/
    eCAN1,                          /*路由口1转发通道1*/

    eCAN1,                          /*路由口2通道号*/
    CAN_ROUTE1_NUM,                 /*路由口2转发通道数*/
    eCAN0                           /*路由口2转发通道1*/
};

/*=======================================校时帧发送配置===========================================*/
u8 gCANTxVerDef_10[CANINDEX10_LEN] =
{
    1                               /*校时帧发送方式(0:不转发不发送 1:仅转发 2:转发和周期发)*/

    /*CAN1口1s周期*/
    /*eCAN1,*/                      /*第1组校时帧发送通道*/
    /*232,*/                        /*第1组校时帧发送周期L(1ms)*/
    /*3*/                           /*第1组校时帧发送周期H(1ms)*/
};

/*=======================================心跳帧发送配置===========================================*/
u8 gCANTxBreDef_11[CANINDEX11_LEN] =
{
    1,                              /*心跳帧发送使能(0:禁止 1:使能)*/

    /*CAN0口1s周期 */
    eCAN0,                          /*第1组心跳帧发送通道*/
    232,                            /*第1组心跳帧发送周期L(1ms)*/
    3,                              /*第1组心跳帧发送周期H(1ms)*/

    /*CAN1口1s周期 */
    eCAN1,                          /*第2组心跳帧发送通道*/
    232,                            /*第2组心跳帧发送周期L(1ms)*/
    3,                              /*第2组心跳帧发送周期H(1ms)*/

    /*CAN2口1s周期 */
    eCAN2,                          /*第3组心跳帧发送通道*/
    232,                            /*第3组心跳帧发送周期L(1ms)*/
    3                               /*第3组心跳帧发送周期H(1ms)*/
};

/*=======================================主动更新(长帧)发送配置====================================*/
u8 gCANTxMulDef_12[CANINDEX12_LEN] =
{
    1,                              /*主动更新长帧发送使能(0:禁止 1:使能)*/

    #if(eCAN0 != CAN_UPDATE_PORT)    /*监控不在CAN0口(多个CAN共用的信息CAN0口也发送)*/
    /*第1组:主索引40(项目信息),CAN0口20s周期 */
    40,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    SINDEX40_LEN,                   /*主动更新长帧子索引长度*/
    0x20,                           /*主动更新长帧发送周期L(1ms)*/
    0x4e,                           /*主动更新长帧发送周期H(1ms)*/
    eCAN0,                          /*主动更新长帧发送通道*/
    0xff,                           /*主动更新长帧发送目标地址*/

    /*第2组:主索引 80(权限信息),CAN0口10s周期 */
    80,                             /*主动发送长帧主索引号*/
    0,                              /*主动发送长帧起始子索引号*/
    GINDEX80_LEN,                   /*主动发送长帧子索引长度*/
    0x10,                           /*主动发送长帧发送周期L(1ms)*/
    0x27,                           /*主动发送长帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送长帧发送通道*/
    0xff,                           /*主动发送长帧发送目标地址*/

    /*第3组:主索引 81(控制结果信息),CAN0口1s周期 */
    81,                             /*主动发送长帧主索引号*/
    0,                              /*主动发送长帧起始子索引号*/
    GINDEX81_LEN,                   /*主动发送长帧子索引长度*/
    0xe8,                           /*主动发送长帧发送周期L(1ms)*/
    0x03,                           /*主动发送长帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送长帧发送通道*/
    0xff,                           /*主动发送长帧发送目标地址*/

    /*第4组:主索引 82(调试结果),CAN0口1s周期 */
    82,                             /*主动发送长帧主索引号*/
    0,                              /*主动发送长帧起始子索引号*/
    GINDEX82_LEN,                   /*主动发送长帧子索引长度*/
    0xe8,                           /*主动发送长帧发送周期L(1ms)*/
    0x03,                           /*主动发送长帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送长帧发送通道*/
    0xff,                           /*主动发送长帧发送目标地址*/

    /*第5组:主索引 83(校准结果),CAN0口1s周期 */
    83,                             /*主动发送长帧主索引号*/
    0,                              /*主动发送长帧起始子索引号*/
    GINDEX83_LEN,                   /*主动发送长帧子索引长度*/
    0xe8,                           /*主动发送长帧发送周期L(1ms)*/
    0x03,                           /*主动发送长帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送长帧发送通道*/
    0xff,                           /*主动发送长帧发送目标地址*/
    #endif

    /*第1组:主索引40(项目信息),CAN0口20s周期 */
    40,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    SINDEX40_LEN,                   /*主动更新长帧子索引长度*/
    0x20,                           /*主动更新长帧发送周期L(1ms)*/
    0x4e,                           /*主动更新长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
    0xff,                           /*主动更新长帧发送目标地址*/

    /*第2组:主索引 45(历史故障),CAN0口60s周期 */
    45,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    GINDEX45_LEN,                   /*主动更新长帧子索引长度*/
    0x60,                           /*主动更新长帧发送周期L(1ms)*/
    0xea,                           /*主动更新长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
    0xff,                           /*主动更新长帧发送目标地址*/

    /*第3组:主索引 46(历史事件),CAN0口65s周期 */
    46,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    GINDEX46_LEN,                   /*主动更新长帧子索引长度*/
    0xe8,                           /*主动更新长帧发送周期L(1ms)*/
    0xfd,                           /*主动更新长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
    0xff,                           /*主动更新长帧发送目标地址*/

    /*第4组:主索引 53(告警信息),CAN0口65s周期 */
    53,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    GINDEX53_LEN,                   /*主动更新长帧子索引长度*/
    0xe8,                           /*主动更新长帧发送周期L(1ms)*/
    0x03,                           /*主动更新长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
    0xff,                           /*主动更新长帧发送目标地址*/

    /*第5组:主索引 82(调试结果),CAN0口2s周期 */
    82,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    GINDEX82_LEN,                   /*主动更新长帧子索引长度*/
    0xD0,                           /*主动更新长帧发送周期L(1ms)*/
    0x07,                           /*主动更新长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
    0xff,                           /*主动更新长帧发送目标地址*/

    /*第6组:主索引 83(校准结果),CAN0口1s周期 */
    83,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    GINDEX83_LEN,                   /*主动更新长帧子索引长度*/
    0xe8,                           /*主动更新长帧发送周期L(1ms)*/
    0x03,                           /*主动更新长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
    0xff,                           /*主动更新长帧发送目标地址*/

    /*第7组:主索引 80(权限信息),CAN0口10s周期 */
    80,                             /*主动发送长帧主索引号*/
    0,                              /*主动发送长帧起始子索引号*/
    GINDEX80_LEN,                   /*主动发送长帧子索引长度*/
    (CAN_UP80_T & 0xff),            /*主动发送长帧发送周期L(1ms)*/
    ((CAN_UP80_T >> 8) & 0xff),     /*主动发送长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送长帧发送通道*/
    0xff,                           /*主动发送长帧发送目标地址*/

    /*第8组:主索引 81(控制结果信息),CAN0口1s周期 */
    81,                             /*主动发送长帧主索引号*/
    0,                              /*主动发送长帧起始子索引号*/
    GINDEX81_LEN,                   /*主动发送长帧子索引长度*/
    (CAN_UP81_T & 0xff),            /*主动发送长帧发送周期L(1ms)*/
    ((CAN_UP81_T >> 8) & 0xff),     /*主动发送长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送长帧发送通道*/
    0xff,                           /*主动发送长帧发送目标地址*/

	/*使能自研从控BSU CAN通信信息才测内阻*/
	#if((1 == BMU_BSU_COM_TYPE) && (0 == BMU_BSU_CAN_TYPE))
	/*第9组:主索引 96(电池内阻信息),CAN0口60s周期 */
    96,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    GINDEX92_LEN,                   /*主动更新长帧子索引长度*/
    0x60,                           /*主动更新长帧发送周期L(1ms)*/
    0xea,                           /*主动更新长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
    0xff,                           /*主动更新长帧发送目标地址*/

#if(0)
	/*第10组:主索引 98(采样前端sr状态信息),CAN0口256ms周期 */
    98,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    GINDEX92_LEN,                   /*主动更新长帧子索引长度*/
    0x00,                           /*主动更新长帧发送周期L(1ms)*/
    0x01,                           /*主动更新长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
    0xff,
#endif

    /*单体电压和温度均超过240*/
    #if(GINDEX93_LEN > 0)
	/*第9组:主索引 97(电池内阻信息),CAN0口60s周期 */
    97,                             /*主动更新长帧主索引号*/
    0,                              /*主动更新长帧起始子索引号*/
    GINDEX93_LEN,                   /*主动更新长帧子索引长度*/
    0x60,                           /*主动更新长帧发送周期L(1ms)*/
    0xea,                           /*主动更新长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
    0xff,                           /*主动更新长帧发送目标地址*/

    /*第10组:主索引 99(采样前端sr状态信息),CAN0口60s周期 */
	99,                             /*主动更新长帧主索引号*/
	0,                              /*主动更新长帧起始子索引号*/
	GINDEX93_LEN,                   /*主动更新长帧子索引长度*/
	0x60,                           /*主动更新长帧发送周期L(1ms)*/
	0xea,                           /*主动更新长帧发送周期H(1ms)*/
	CAN_UPDATE_PORT,                /*主动更新长帧发送通道*/
	0xff,
    #endif
    #endif

    /*第10组:主索引 55(故障定位),CAN0口3s周期 */
    55,                             /*主动发送长帧主索引号*/
    0,                              /*主动发送长帧起始子索引号*/
    GINDEX55_LEN,                   /*主动发送长帧子索引长度*/
    (CAN_UP55_T & 0xff),            /*主动发送长帧发送周期L(1ms)*/
    ((CAN_UP55_T >> 8) & 0xff),     /*主动发送长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送长帧发送通道*/
    0xff,                            /*主动发送长帧发送目标地址*/

    /*第11组:主索引 209(PACK环境信息),CAN0口3s周期 */
    209,                             /*主动发送长帧主索引号*/
    0,                              /*主动发送长帧起始子索引号*/
    GINDEX209_LEN,                   /*主动发送长帧子索引长度*/
    (CAN_UP209_T & 0xff),            /*主动发送长帧发送周期L(1ms)*/
    ((CAN_UP209_T >> 8) & 0xff),     /*主动发送长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送长帧发送通道*/
    0xff,                            /*主动发送长帧发送目标地址*/


    /*第12组:主索引 210(PACK高压互锁信息),CAN0口3s周期 */
    210,                             /*主动发送长帧主索引号*/
    0,                              /*主动发送长帧起始子索引号*/
    GINDEX210_LEN,                   /*主动发送长帧子索引长度*/
    (CAN_UP210_T & 0xff),            /*主动发送长帧发送周期L(1ms)*/
    ((CAN_UP210_T >> 8) & 0xff),     /*主动发送长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送长帧发送通道*/
    0xff,                            /*主动发送长帧发送目标地址*/

    /*第13组:主索引 211(PACK气溶胶信息),CAN0口3s周期 */
    211,                             /*主动发送长帧主索引号*/
    0,                               /*主动发送长帧起始子索引号*/
    GINDEX211_LEN,                   /*主动发送长帧子索引长度*/
    (CAN_UP211_T & 0xff),            /*主动发送长帧发送周期L(1ms)*/
    ((CAN_UP211_T >> 8) & 0xff),     /*主动发送长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                 /*主动发送长帧发送通道*/
    0xff,                            /*主动发送长帧发送目标地址*/

    /*第14组:主索引 223(PACK枚举数目信息),CAN0口3s周期 */
    223,                             /*主动发送长帧主索引号*/
    0,                               /*主动发送长帧起始子索引号*/
    GINDEX223_LEN,                   /*主动发送长帧子索引长度*/
    (CAN_UP223_T & 0xff),            /*主动发送长帧发送周期L(1ms)*/
    ((CAN_UP223_T >> 8) & 0xff),     /*主动发送长帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                 /*主动发送长帧发送通道*/
    0xff                             /*主动发送长帧发送目标地址*/

};

/*=======================================主动发送(单帧)发送配置====================================*/
u8 gCANTxSinDef_13[CANINDEX13_LEN] =
{
    1,                              /*主动更新单帧发送使能(0:禁止 1:使能)*/

    #if(eCAN0 != CAN_UPDATE_PORT)   /*监控不在CAN0口(保护信息和辅助芯片需要的信息CAN0口必须发送)*/
//    /*第1组:主索引 50(状态信息),CAN0口100ms周期 */
//    50,                             /*主动发送单帧主索引号*/
//    0,                              /*主动发送单帧起始子索引号*/
//    GINDEX50_LEN,                   /*主动发送单帧子索引长度*/
//    (CAN_UP50_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
//    ((CAN_UP50_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
//    eCAN0,                          /*主动发送单帧发送通道*/
//    0xff,                           /*主动发送单帧发送目标地址*/
//
//    /*第2组:主索引 51(电流限值),CAN0口100ms周期 */
//    51,                             /*主动发送单帧主索引号*/
//    0,                              /*主动发送单帧起始子索引号*/
//    GINDEX51_LEN,                   /*主动发送单帧子索引长度*/
//    (CAN_UP51_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
//    ((CAN_UP51_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
//    eCAN0,                          /*主动发送单帧发送通道*/
//    0xff,                           /*主动发送单帧发送目标地址*/
//
//    /*第3组:主索引 52(电压限值),CAN0口500ms周期 */
//    52,                             /*主动发送单帧主索引号*/
//    0,                              /*主动发送单帧起始子索引号*/
//    GINDEX52_LEN,                   /*主动发送单帧子索引长度*/
//    (CAN_UP52_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
//    ((CAN_UP52_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
//    eCAN0,                          /*主动发送单帧发送通道*/
//    0xff,                           /*主动发送单帧发送目标地址*/
//
//    /*第4组:主索引 60(整体信息),CAN0口100ms周期 */
//    60,                             /*主动发送单帧主索引号*/
//    0,                              /*主动发送单帧起始子索引号*/
//    GINDEX60_LEN,                   /*主动发送单帧子索引长度*/
//    (CAN_UP60_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
//    ((CAN_UP60_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
//    eCAN0,                          /*主动发送单帧发送通道*/
//    0xff,                           /*主动发送单帧发送目标地址*/

    /*第1组:主索引 76(SOS信息),CAN0口1s周期 */
    76,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX76_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP76_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP76_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第2组:主索引 75(DOD信息),CAN0口5s周期 */
    75,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX75_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP75_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP75_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第3组:主索引 70(时间信息),CAN0口5s周期 */
    70,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX70_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP70_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP70_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第4组:主索引 67(绝缘信息),CAN0口1s周期 */
    67,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX67_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP67_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP67_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第5组:主索引 53(告警信息),CAN0口500ms周期 */
    53,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX53_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP53_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP53_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第6组:主索引 54(故障信息),CAN0口500ms周期 */
    54,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX54_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP54_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP54_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第7组:主索引 56(开关量信息),CAN0口500ms周期 */
    56,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX56_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP56_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP56_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第8组:主索引 66(低压采样值),CAN0口1s周期 */
    66,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX66_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP66_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP66_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    eCAN0,                          /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/
    #endif

    /*第1组:主索引 50(状态信息),CAN0口100ms/500ms周期 */
    50,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX50_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP50_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP50_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第2组:主索引 51(电流限值),CAN0口100ms/500ms周期 */
    51,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX51_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP51_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP51_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第3组:主索引 52(电压限值),CAN0口500ms、1s周期 */
    52,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX52_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP52_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP52_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第4组:主索引 53(告警信息),改为长帧发送 */
   // 53,                             /*主动发送单帧主索引号*/
   // 0,                              /*主动发送单帧起始子索引号*/
   // GINDEX53_LEN,                   /*主动发送单帧子索引长度*/
   // (CAN_UP53_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
   // ((CAN_UP53_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
   // CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
   // 0xff,                           /*主动发送单帧发送目标地址*/

    /*第4组:主索引 54(故障信息),CAN0口500ms/1s周期 */
    54,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX54_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP54_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP54_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第5组:主索引 56(IO信息),CAN0口500ms/1s周期 */
    56,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX56_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP56_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP56_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第6组:主索引 60(整体信息),CAN0口100ms/500ms周期 */
    60,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX60_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP60_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP60_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第7组:主索引 61(电能量信息),CAN0口300ms周期 */
    61,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX61_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP61_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP61_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第8组:主索引 62(单体特征信息),CAN0口300ms周期 */
    62,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX62_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP62_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP62_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第9组:主索引 63(电压最值),CAN0口200ms周期 */
    63,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX63_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP63_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP63_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第10组:主索引 64(温度最值),CAN0口200s周期 */
    64,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX64_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP64_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP64_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第11组:主索引 65(电流温度),CAN0口1s周期 */
    65,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX65_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP65_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP65_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第12组:主索引 66(低压采样值),CAN0口1s周期 */
    66,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX66_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP66_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP66_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第13组:主索引 67(直流电路值),CAN0口1s周期 */
    67,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX67_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP67_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP67_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第14组:主索引 68(驱动电流值1),CAN0口1s/2s周期 */
    68,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX68_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP68_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP68_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第15组:主索引 69(驱动电流值2),CAN0口1s/2s周期 */
    69,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX69_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP69_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP69_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第16组:主索引 70(时间统计),CAN0口5s/10s周期 */
    70,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX70_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP70_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP70_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第17组:主索引 71(故障统计),CAN0口5s/10s周期 */
    71,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX71_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP71_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP71_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第18组:主索引 72(单次电量统计),CAN0口5s/10s周期 */
    72,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX72_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP72_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP72_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第19组:主索引 73(累计电量统计),CAN0口5s/10s周期 */
    73,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX73_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP73_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP73_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第20组:主索引 74(累计电能统计),CAN0口5s/10s周期 */
    74,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX74_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP74_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP74_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第21组:主索引 75(放电深度信息),CAN0口1s周期 */
    75,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX75_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP75_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP75_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                           /*主动发送单帧发送目标地址*/

    /*第22组:主索引 76(SOS信息),CAN0口500ms/1s周期 */
    76,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
    GINDEX76_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP76_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP76_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                            /*主动发送单帧发送目标地址*/

    /*第23组:主索引 225(漏电流传感器信息),CAN0口500ms/1s周期 */
    225,                             /*主动发送单帧主索引号*/
    0,                              /*主动发送单帧起始子索引号*/
	GINDEX225_LEN,                   /*主动发送单帧子索引长度*/
    (CAN_UP225_T & 0xff),            /*主动发送单帧发送周期L(1ms)*/
    ((CAN_UP225_T >> 8) & 0xff),     /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单帧发送通道*/
    0xff,                            /*主动发送单帧发送目标地址*/

    /*index 77: EKF upload data (curr/min/avg/max cell volt), CAN0 500ms*/
    77,                             /*periodic tx frame index*/
    0,                              /*periodic tx frame start sub-index*/
    CANINDEX77_LEN,                 /*periodic tx frame sub-index num*/
    (CAN_UP77_T & 0xff),            /*periodic tx frame period L(1ms)*/
    ((CAN_UP77_T >> 8) & 0xff),     /*periodic tx frame period H(1ms)*/
    CAN_UPDATE_PORT,                /*periodic tx frame channel*/
    0xff,                            /*periodic tx frame dest addr*/

    /*index 78: EKF upload data (temp/soc/existSoc/refSoc), CAN0 500ms*/
    78,                             /*periodic tx frame index*/
    0,                              /*periodic tx frame start sub-index*/
    CANINDEX78_LEN,                 /*periodic tx frame sub-index num*/
    (CAN_UP78_T & 0xff),            /*periodic tx frame period L(1ms)*/
    ((CAN_UP78_T >> 8) & 0xff),     /*periodic tx frame period H(1ms)*/
    CAN_UPDATE_PORT,                /*periodic tx frame channel*/
    0xff,                            /*periodic tx frame dest addr*/

    /*index 84: EKF upload data (nowCap/remCap), CAN0 500ms*/
    84,                             /*periodic tx frame index*/
    0,                              /*periodic tx frame start sub-index*/
    CANINDEX84_LEN,                 /*periodic tx frame sub-index num*/
    (CAN_UP84_T & 0xff),            /*periodic tx frame period L(1ms)*/
    ((CAN_UP84_T >> 8) & 0xff),     /*periodic tx frame period H(1ms)*/
    CAN_UPDATE_PORT,                /*periodic tx frame channel*/
    0xff                            /*periodic tx frame dest addr*/
};

/*=======================================主动发送(单体)发送配置===================================*/
u8 gCANTxCelDef_14[CANINDEX14_LEN] =
{
    1,                              /*主动更新单体发送使能(0:禁止 1:使能)*/

    /*第1组:主索引 92(单体电压1),CAN0口1s周期 */
    92,                             /*主动发送单体主索引号*/
    0,                              /*主动发送单体起始子索引号*/
    GINDEX92_LEN,                   /*主动发送单体子索引长度*/
    50,                             /*主动发送单体映射起始主索引号*/
    0xE8,                           /*主动发送单体发送周期L(1ms)*/
    0x03,                           /*主动发送单体发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单体发送通道*/
    0xff,                           /*主动发送单体发送目标地址*/

    /*第2组:主索引 93(单体电压2),CAN0口1s周期 */
    93,                             /*主动发送单体主索引号*/
    0,                              /*主动发送单体起始子索引号*/
    (u8)GINDEX93_LEN,               /*主动发送单体子索引长度*/
    110,                            /*主动发送单体映射起始主索引号*/
    0xE8,                           /*主动发送单体发送周期L(1ms)*/
    0x03,                           /*主动发送单体发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单体发送通道*/
    0xff,                           /*主动发送单体发送目标地址*/

    /*第3组:主索引 94(单体温度1),CAN0口1s周期 */
    94,                             /*主动发送单体主索引号*/
    0,                              /*主动发送单体起始子索引号*/
    GINDEX94_LEN,                   /*主动发送单体子索引长度*/
    150,                            /*主动发送单体映射起始主索引号*/
    0xE8,                           /*主动发送单体发送周期L(1ms)*/
    0x03,                           /*主动发送单体发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单体发送通道*/
    0xff,                           /*主动发送单体发送目标地址*/

    /*第4组:主索引 95(单体温度2),CAN0口1s周期 */
    95,                             /*主动发送单体主索引号*/
    0,                              /*主动发送单体起始子索引号*/
    GINDEX95_LEN,                   /*主动发送单体子索引长度*/
    210,                            /*主动发送单体映射起始主索引号*/
    0xE8,                           /*主动发送单体发送周期L(1ms)*/
    0x03,                           /*主动发送单体发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单体发送通道*/
    0xff,                           /*主动发送单体发送目标地址*/

    /*第5组:主索引 90(充电均衡),CAN0口3s周期 */
    90,                             /*主动发送单体主索引号*/
    0,                              /*主动发送单体起始子索引号*/
    GINDEX90_LEN,                   /*主动发送单体子索引长度*/
    0,                              /*主动发送单体映射起始主索引号*/
    0xb8,                           /*主动发送单体发送周期L(1ms)*/
    0x0b,                           /*主动发送单体发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单体发送通道*/
    0xff,                           /*主动发送单体发送目标地址*/

#if(0)
	#if((1 == BMU_BSU_COM_TYPE) && (0 == BMU_BSU_CAN_TYPE))
	/*第7组:主索引 224(afe工作模式信息),CAN0口3s周期 */
	224,                            /*主动发送单体主索引号*/
	0,                              /*主动发送单体起始子索引号*/
	(GINDEX92_LEN+GINDEX93_LEN+1)/2,/*主动发送单体子索引长度*/
	20,                             /*主动发送单体映射起始主索引号*/
	0xb8,                           /*主动发送单体发送周期L(1ms)*/
	0x0b,                           /*主动发送单体发送周期H(1ms)*/
	CAN_UPDATE_PORT,                /*主动发送单体发送通道*/
	0xff,                            /*主动更新长帧发送目标地址*/
	#endif
#endif
    /*第6组:主索引 91(放电均衡),CAN0口3s周期 */
    91,                             /*主动发送单体主索引号*/
    0,                              /*主动发送单体起始子索引号*/
    GINDEX91_LEN,                   /*主动发送单体子索引长度*/
    10,                             /*主动发送单体映射起始主索引号*/
    0xb8,                           /*主动发送单体发送周期L(1ms)*/
    0x0b,                           /*主动发送单体发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单体发送通道*/
    0xff,                            /*主动发送单体发送目标地址*/

    /*第7组:主索引 110(Safe状态),CAN0口10A周期 */
    110,                             /*主动发送单体主索引号*/
    0,                              /*主动发送单体起始子索引号*/
    GINDEX110_LEN,                   /*主动发送单体子索引长度*/
    20,                             /*主动发送单体映射起始主索引号*/
    0x10,                           /*主动发送单体发送周期L(1ms)*/
    0x27,                           /*主动发送单体发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送单体发送通道*/
    0xff                            /*主动发送单体发送目标地址*/
};

/*=======================================主动发送(参数)发送配置===================================*/
u8 gCANTxParDef_15[CANINDEX15_LEN] =
{
    0,                              /*主动更新参数发送使能(0:禁止 1:使能)*/

    /*第1组:主索引 100(系统通用参数),CAN0口10s周期 */
    100,                            /*主动发送参数主索引号*/
    0,                              /*主动发送参数起始子索引号*/
    SINDEX100_LEN,                  /*主动发送参数子索引长度*/
    0,                              /*主动发送参数映射起始主索引号*/
    0x10,                           /*主动发送单帧发送周期L(1ms)*/
    0x27,                           /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送参数发送通道*/
    0xff,                           /*主动发送参数发送目标地址*/

    /*第2组:主索引 101(系统硬件参数),CAN0口10s周期 */
    101,                            /*主动发送参数主索引号*/
    0,                              /*主动发送参数起始子索引号*/
    SINDEX101_LEN,                  /*主动发送参数子索引长度*/
    25,                             /*主动发送参数映射起始主索引号*/
    0x10,                           /*主动发送单帧发送周期L(1ms)*/
    0x27,                           /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送参数发送通道*/
    0xff,                           /*主动发送参数发送目标地址*/

    /*第3组:主索引 102(主控通用参数),CAN0口10s周期 */
    102,                            /*主动发送参数主索引号*/
    0,                              /*主动发送参数起始子索引号*/
    GINDEX102_LEN,                  /*主动发送参数子索引长度*/
    50,                             /*主动发送参数映射起始主索引号*/
    0x10,                           /*主动发送单帧发送周期L(1ms)*/
    0x27,                           /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送参数发送通道*/
    0xff,                           /*主动发送参数发送目标地址*/

    /*第4组:主索引 103(主控高级参数),CAN0口10s周期 */
    103,                            /*主动发送参数主索引号*/
    0,                              /*主动发送参数起始子索引号*/
    GINDEX103_LEN,                  /*主动发送参数子索引长度*/
    75,                             /*主动发送参数映射起始主索引号*/
    0x10,                           /*主动发送单帧发送周期L(1ms)*/
    0x27,                           /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送参数发送通道*/
    0xff,                           /*主动发送参数发送目标地址*/

    /*第5组:主索引 104(主控硬件参数),CAN0口10s周期 */
    104,                            /*主动发送参数主索引号*/
    0,                              /*主动发送参数起始子索引号*/
    GINDEX104_LEN,                  /*主动发送参数子索引长度*/
    100,                            /*主动发送参数映射起始主索引号*/
    0x10,                           /*主动发送单帧发送周期L(1ms)*/
    0x27,                           /*主动发送单帧发送周期H(1ms)*/
    CAN_UPDATE_PORT,                /*主动发送参数发送通道*/
    0xff                            /*主动发送参数发送目标地址*/
};

/*=======================================参数批量配置状态信息=====================================*/
u8 gCANParCfgStat_20[CANINDEX20_LEN] =
{
    0,                              /*参数配置状态(0:未操作 1:正在读 2:读成功 3:读失败 4:等待写 5:写成功 6:写失败 7:正在备份 8:备份成功 9:备份失败)*/
    0                               /*参数配置异常信息(0:无异常 其它:异常码)*/
};

/*=======================================参数批量配置读取信息=====================================*/
u8 gCANParCfgRInfo_21[CANINDEX21_LEN] =
{
    0,                              /*读参数起始EEPROM地址L*/
    0,                              /*读参数起始EEPROM地址H*/
    0,                              /*读参数总字节数(地址长度)*/
    0,                              /*读取参数1*/
    0,                              /*读取参数2*/
    0,                              /*读取参数N*/
    0,                              /*读取参数校验码L*/
    0                               /*读取参数校验码H*/
};

/*=======================================参数批量配置写入信息=====================================*/
u8 gCANParCfgWInfo_22[CANINDEX22_LEN] =
{
    0,                              /*读写参数命令(0:退出 1:读参数 2:写参数 3:备份参数)*/
    0,                              /*读写参数起始EEPROM地址L*/
    0,                              /*读写参数起始EEPROM地址H*/
    0,                              /*读写参数总字节数(地址长度)*/
    0,                              /*写入参数1*/
    0,                              /*写入参数2*/
    0,                              /*写入参数N*/
    0,                              /*写入参数校验码L*/
    0                               /*写入参数校验码H*/
};

/*=======================================事件记录监测状态(数目)信息===============================*/
u16 gCANRcdNum_30[CANINDEX30_LEN] =
{
    0,                              /*故障记录条数*/
    0,                              /*事件记录条数*/
    0,                              /*故障录波条数*/
    0                               /*DOD记录条数*/
};

/*=======================================故障记录监测详细信息=====================================*/
u16 gCANSofInfo_31[CANINDEX31_LEN] =
{
    0,                              /*故障记录序号*/
    0,                              /*故障码L*/
    0,                              /*故障码H*/
    0,                              /*故障时间-年*/
    0,                              /*故障时间-月/日*/
    0,                              /*故障时间-时/分*/
    0,                              /*故障时间-秒*/
    0,                              /*故障附加信息1*/
    0,                              /*故障附加信息2*/
    0,                              /*故障附加信息3*/
    0,                              /*故障附加信息4*/
    0                               /*故障附加信息5*/
};

/*=======================================事件记录监测详细信息=====================================*/
u16 gCANSoeInfo_32[CANINDEX32_LEN] =
{
    0,                              /*事件记录序号*/
    0,                              /*事件码L*/
    0,                              /*事件码H*/
    0,                              /*事件时间-年*/
    0,                              /*事件时间-月/日*/
    0,                              /*事件时间-时/分*/
    0,                              /*事件时间-秒*/
    0,                              /*事件附加信息1*/
    0,                              /*事件附加信息2*/
    0,                              /*事件附加信息3*/
    0,                              /*事件附加信息4*/
    0                               /*事件附加信息5*/
};

/*=======================================故障录波监测详细信息=====================================*/
u16 gCANSowInfo_33[CANINDEX33_LEN] =
{
    0,                              /*故障录波序号*/
    0,                              /*故障录波代码*/
    0,                              /*故障录波时间-年*/
    0,                              /*故障录波时间-月/日*/
    0,                              /*故障录波时间-时/分*/
    0,                              /*故障录波时间-秒*/
    0,                              /*故障录波记录值1*/
    0,                              /*故障录波记录值2*/
    0,                              /*故障录波记录值3*/
    0                               /*故障录波记录值50*/
};

/*=======================================DOD记录监测详细信息=====================================*/
u16 gCANDodInfo_34[CANINDEX34_LEN] =
{
    0,                              /*DOD记录序号*/
    0,                              /*DOD记录波时间-年*/
    0,                              /*DOD记录时间-月/日*/
    0,                              /*DOD记录时间-时/分*/
    0,                              /*DOD记录时间-秒*/
    0,                              /*DOD记录值*/
    0,                              /*充电量记录值*/
    0,                              /*放电量记录值*/
    0,                              /*充电能记录值*/
    0                               /*放电能记录值*/
};

/*=======================================运行数据存储总状态信息===================================*/
u16 gCANSodNum_35[CANINDEX35_LEN] =
{
    0,                              /*运行数据记录天数*/
    0,                              /*运行数据记录总条数*/
    0                               /*运行数据今日记录条数*/
};

/*=======================================运行数据存储日状态信息===================================*/
u16 gCANSodDay_36[CANINDEX36_LEN] =
{
    0,                              /*运行数据记录当前读取日期*/
    0,                              /*运行数据指定日期记录条数*/
    0,                              /*运行数据前1天记录条数*/
    0,                              /*运行数据前2天记录条数*/
    0,                              /*运行数据前N天记录条数*/
    0                               /*运行数据前30天记录条数*/
};

/*=======================================运行数据存储查询详细信息==================================*/
u16 gCANSodInfo_37[CANINDEX37_LEN] =
{
    0,                              /*运行数据记录序号*/
    0,                              /*运行数据记录时间-年*/
    0,                              /*运行数据记录时间-月/日*/
    0,                              /*运行数据记录时间-时/分*/
    0,                              /*运行数据记录时间-秒*/
    0,                              /*运行数据记录信息1*/
    0,                              /*运行数据记录信息2*/
    0,                              /*运行数据记录信息N*/
    0                               /*运行数据记录信息51*/
};

/*=======================================历史记录读写操作命令=====================================*/
u16 gCANSoxOper_39[CANINDEX39_LEN] =
{
    0,                              /*切换读取记录日期(0:今天 1-30:前1-30日)*/
    0,                              /*清除数据记录日期(0-30:前1-30当天记录清除 0xff:所有记录全部清除)*/
    0x5b,                           /*清除故障记录日期(0-30:前1-30当天记录清除 0x5b:远程读一条记录清除 0xff:所有记录全部清除)*/
    0x5b,                           /*清除事件记录日期(0-30:前1-30当天记录清除 0x5b:远程读一条记录清除 0xff:所有记录全部清除)*/
    0x5b,                           /*清除故障录波日期(0-30:前1-30当天记录清除 0x5b:远程读一条记录清除 0xff:所有记录全部清除)*/
    0x5b                            /*清除历史DOD记录(0x5b:远程读一条记录清除 0xff:所有记录全部清除)*/
};

/*=======================================用户自定义信息(通信协议)=================================*/
extern u16 gSProjecInfo_40[];       /*项目参数信息数组*/
extern u16 gGHisErrInfo_45[];       /*历史故障记录信息查询数组*/
extern u16 gGHisEventInfo_46[];     /*历史事件记录信息查询数组*/
extern u16 gGHisWaveInfo_47[];      /*历史故障录波信息查询数组*/
extern u16 gGHisDodInfo_48[];       /*历史DOD记录信息查询数组*/

extern u16 gGSysStateInfo_50[];     /*系统状态信息数组*/
extern u16 gGLimCPInfo_51[];        /*电流功率限值数组*/
extern u16 gGLimVInfo_52[];         /*电压限值信息数组*/
extern u16 gGAlarmInfo_53[];        /*告警信息数组*/
extern u16 gGFaultInfo_54[];        /*故障信息数组*/
extern u16 gGErrDetail_55[];        /*故障定位信息数组*/
extern u16 gGPortStateInfo_56[];    /*输入输出口状态信息数组*/

extern s16 gGSysMainInfo_60[];      /*系统整体信息数组*/
extern u16 gGSysCapInfo_61[];       /*系统电量信息数组*/
extern u16 gGSysCellInfo_62[];      /*系统单体信息数组*/
extern u16 gGVoltCharInfo_63[];     /*电压特征信息数组*/
extern s16 gGTempCharInfo_64[];     /*温度特征信息数组*/
extern s16 gGDcCTInfo_65[];         /*直流电流温度信息数组*/
extern u16 gGLVSampInfo_66[];       /*低压采样信息数组*/
extern u16 gGFstLeakInfo_67[];      /*直流电路信息数组*/
extern s16 gGHsCurrInfo_68[];       /*高边驱动电流信息数组1*/
extern s16 gGHsCurrInfo_69[];       /*高边驱动电流信息数组2*/
extern u16 gGStatistTime_70[];      /*时间统计信息数组*/
extern u16 gGStatistErr_71[];       /*故障统计信息数组*/
extern u16 gGStatistCapEner_72[];   /*当前能量统计信息数组*/
extern u32 gGStatistHisCap_73[];    /*累计电量统计信息数组*/
extern u32 gGStatistHisEner_74[];   /*累计电能统计信息数组*/
extern u16 gGStatistDodInfo_75[];   /*放电深度统计信息数组*/
extern u16 gGStatistSosInfo_76[];   /*安全等级统计信息数组*/
extern s16 gCANEkfInfo_77[];        /*EKF upload: curr/min/avg/max cell volt*/
extern s16 gCANEkfInfo_78[];        /*EKF upload: temp/soc/existSoc/refSoc*/
extern u32 gCANEkfInfo_84[];        /*EKF upload: nowCap/remCap*/

extern u16 gGAuthorInfo_80[];       /*权限级别状态信息数组*/
extern u16 gGCtrlResult_81[];       /*控制结果状态信息数组*/
extern u16 gGDebugResult_82[];      /*调试结果状态信息数组*/
extern u16 gGCalibrResult_83[];     /*校准结果状态信息数组*/

extern u16 gGAuthorCtrl_85[];       /*权限密码登录信息数组*/
extern u16 gGSysCmdCtrl_86[];       /*系统控制命令信息数组*/
extern u16 gGUserCtrl_87[];         /*用户控制命令信息数组*/
extern u16 gGDebugCtrl_88[];        /*系统调试命令信息数组*/
extern u16 gGCalibrCtrl_89[];       /*采样校准命令信息数组*/

extern u16 gGChgBalanInfo_90[];     /*充电均衡状态信息数组*/
extern u16 gGDhgBalanInfo_91[];     /*放电均衡状态信息数组*/
extern u16 gGCellVoltInfo_92[];     /*电池单体电压信息数组*/
extern s16 gGCellTempInfo_94[];      /*电池单体温度信息数组*/
extern u16 gGBsuSafeInfo_110[];     /*Safe状态信息数组*/
//使能自研从控BSU CAN通信信息才测内阻
#if((1 == BMU_BSU_COM_TYPE) && (0 == BMU_BSU_CAN_TYPE))
extern u16 gGCellResisInfo_96[];    /*电池单体内阻信息数组*/
extern u16 gGSrStateInfo_98[];		/*采样前端sr状态信息数组*/
extern u16 gGCellResisRInfo_226[];  /*电池单体内阻实部信息数组*/
extern u16 gGCellResisIInfo_228[];  /*电池单体内阻虚部信息数组*/
#endif

extern s16 gGReferSampInfo_200[];   /*参考采集信息*/

extern u16 gEu3AirInfo_202[];       /*EU3空调控制信息*/
extern u16 gEu3AirState_203[];       /*EU3空调状态信息*/
//ZQD808添加
extern u16 gLiqudCoolAirInfo_206[];  /*液冷空调控制信息*/
extern u16 gLiqudCoolAirSta_207[];   /*液冷空调状态信息*/
extern u16 gLiqudCoolAirErr_208[];   /*液冷空调故障和告警信息*/


extern s16 PackEnvInfo_209[];        /*液冷PACK环境信息*/
extern u16 PackMsdInfo_210[];		 /*液冷PACK高压互锁信息*/
extern u16 PackAerosolInfo_211[];    /*液冷PACK气溶胶信息*/


extern u16 gTFAirUserParaInfo_212[];  /*TF液冷空调用户参数信息*/
extern u16 gTFAirStateInfo_213[];     /*TF液冷空调状态信息*/
extern u16 gTFAirErrInfo_214[];       /*TF液冷空调故障信息*/
extern u16 XinMiaoAirSta_215[];      /*新淼空调状态信息*/
extern u16 XinMiaoAirPara_216[];     /*新淼空调配置信息*/



extern u16 gSysGenParaRO_100[];     /*系统通用参数设置*/
extern u16 gSysHigParaRO_101[];     /*系统硬件参数设置*/
extern u16 gGBmuGenPara_102[];      /*主控通用参数值*/
extern u16 gGBmuHigLevPara_103[];   /*主控高级参数值*/
extern u8 gGHardPara_104[];         /*主控硬件参数值*/

extern u16 gSysGenParaRW_105[];     /*系统通用设置*/
extern u16 gSysHigParaRW_106[];     /*系统高级设置*/
extern u16 gGBmuGenParaWR_107[];    /*主控通用参数值*/
extern u16 gGBmuHigLevParaWR_108[]; /*主控高级参数值*/
extern u8 gGHardParaWR_109[];       /*主控硬件参数值*/

extern u8 gBsuBotTopCount_223[];	/*从控afe枚举信息*/
#if((1 == BMU_BSU_COM_TYPE) && (0 == BMU_BSU_CAN_TYPE))
extern u8 gGAfeWorkModeInfo_224[];	/*采样前端工作模式信息数组*/
#endif
extern u16 gLeakageInfo_225[]; 	    /*漏电流传感器信息*/

/*=======================================通信信息主索引表(BMU)====================================*/
const t_CANIndexTab Filed_BMUTab[BMU_INDEX_NUM] =
{
    /*内部信息 23个主索引*/
    DeclareIndexTableEntry(CAN_READONLY, 0,  gCANVerTime_0,   CAN_DT_U16, CANINDEX0_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 1,  gCANDevInfo_1,   CAN_DT_U16, CANINDEX1_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE,  2,  gCANSerialNum_2, CAN_DT_U8,  CANINDEX2_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 3,  gCANBaseDef_3,   CAN_DT_U8,  CANINDEX3_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 4,  gCANRoutDef_4,   CAN_DT_U8,  CANINDEX4_LEN),

    DeclareIndexTableEntry(CAN_READONLY, 10, gCANTxVerDef_10, CAN_DT_U8,  CANINDEX10_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 11, gCANTxBreDef_11, CAN_DT_U8,  CANINDEX11_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 12, gCANTxMulDef_12, CAN_DT_U8,  CANINDEX12_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 13, gCANTxSinDef_13, CAN_DT_U8,  CANINDEX13_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 14, gCANTxCelDef_14, CAN_DT_U8,  CANINDEX14_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 15, gCANTxParDef_15, CAN_DT_U8,  CANINDEX15_LEN),

    DeclareIndexTableEntry(CAN_READONLY, 20, gCANParCfgStat_20,  CAN_DT_U8, CANINDEX20_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 21, gCANParCfgRInfo_21, CAN_DT_U8, CANINDEX21_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE,  22, gCANParCfgWInfo_22, CAN_DT_U8, CANINDEX22_LEN),

    DeclareIndexTableEntry(CAN_READONLY, 30, gCANRcdNum_30,   CAN_DT_U16, CANINDEX30_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 31, gCANSofInfo_31,  CAN_DT_U16, CANINDEX31_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 32, gCANSoeInfo_32,  CAN_DT_U16, CANINDEX32_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 33, gCANSowInfo_33,  CAN_DT_U16, CANINDEX33_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 34, gCANDodInfo_34,  CAN_DT_U16, CANINDEX34_LEN),

    DeclareIndexTableEntry(CAN_READONLY, 35, gCANSodNum_35,   CAN_DT_U16, CANINDEX35_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 36, gCANSodDay_36,   CAN_DT_U16, CANINDEX36_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 37, gCANSodInfo_37,  CAN_DT_U16, CANINDEX37_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE,  39, gCANSoxOper_39,  CAN_DT_U16, CANINDEX39_LEN),

    /*用户常规信息38个索引*/
    DeclareIndexTableEntry(CAN_READONLY, 40, gSProjecInfo_40, CAN_DT_U16, SINDEX40_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 45, gGHisErrInfo_45, CAN_DT_U16, GINDEX45_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 46, gGHisEventInfo_46, CAN_DT_U16, GINDEX46_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 47, gGHisWaveInfo_47, CAN_DT_U16, GINDEX47_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 48, gGHisDodInfo_48, CAN_DT_U16, GINDEX48_LEN),

    DeclareIndexTableEntry(CAN_READONLY, 50, gGSysStateInfo_50, CAN_DT_U16, GINDEX50_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 51, gGLimCPInfo_51, CAN_DT_U16, GINDEX51_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 52, gGLimVInfo_52, CAN_DT_U16, GINDEX52_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 53, gGAlarmInfo_53, CAN_DT_U16, GINDEX53_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 54, gGFaultInfo_54, CAN_DT_U16, GINDEX54_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 55, gGErrDetail_55, CAN_DT_U16, GINDEX55_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 56, gGPortStateInfo_56, CAN_DT_U16, GINDEX56_LEN),

    DeclareIndexTableEntry(CAN_READONLY, 60, gGSysMainInfo_60, CAN_DT_S16, GINDEX60_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 61, gGSysCapInfo_61, CAN_DT_U16, GINDEX61_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 62, gGSysCellInfo_62, CAN_DT_U16, GINDEX62_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 63, gGVoltCharInfo_63, CAN_DT_U16, GINDEX63_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 64, gGTempCharInfo_64, CAN_DT_S16, GINDEX64_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 65, gGDcCTInfo_65, CAN_DT_S16, GINDEX65_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 66, gGLVSampInfo_66, CAN_DT_U16, GINDEX66_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 67, gGFstLeakInfo_67, CAN_DT_U16, GINDEX67_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 68, gGHsCurrInfo_68, CAN_DT_S16, GINDEX68_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 69, gGHsCurrInfo_69, CAN_DT_S16, GINDEX69_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 70, gGStatistTime_70, CAN_DT_U16, GINDEX70_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 71, gGStatistErr_71, CAN_DT_U16, GINDEX71_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 72, gGStatistCapEner_72, CAN_DT_U16, GINDEX72_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 73, gGStatistHisCap_73, CAN_DT_U32, GINDEX73_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 74, gGStatistHisEner_74, CAN_DT_U32, GINDEX74_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 75, gGStatistDodInfo_75, CAN_DT_U16, GINDEX75_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 76, gGStatistSosInfo_76, CAN_DT_U16, GINDEX76_LEN),

    DeclareIndexTableEntry(CAN_READONLY, 77, gCANEkfInfo_77, CAN_DT_S16, CANINDEX77_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 78, gCANEkfInfo_78, CAN_DT_S16, CANINDEX78_LEN),

    DeclareIndexTableEntry(CAN_READONLY, 80, gGAuthorInfo_80, CAN_DT_U16, GINDEX80_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 81, gGCtrlResult_81, CAN_DT_U16, GINDEX81_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 82, gGDebugResult_82, CAN_DT_U16, GINDEX82_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 83, gGCalibrResult_83, CAN_DT_U16, GINDEX83_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 84, gCANEkfInfo_84, CAN_DT_U32, CANINDEX84_LEN),

    DeclareIndexTableEntry(CAN_UPWRITE, 85, gGAuthorCtrl_85, CAN_DT_U16, GINDEX85_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE, 86, gGSysCmdCtrl_86, CAN_DT_U16, GINDEX86_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE, 87, gGUserCtrl_87, CAN_DT_U16, GINDEX87_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE, 88, gGDebugCtrl_88, CAN_DT_U16, GINDEX88_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE, 89, gGCalibrCtrl_89, CAN_DT_U16, GINDEX89_LEN),

    /*用户单体信息5个索引*/
    DeclareIndexTableEntry(CAN_READONLY, 90, gGChgBalanInfo_90, CAN_DT_U16, GINDEX90_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 91, gGDhgBalanInfo_91, CAN_DT_U16, GINDEX91_LEN),

    DeclareIndexTableEntry(CAN_READONLY, 92, gGCellVoltInfo_92, CAN_DT_U16, GINDEX92_LEN),

    #if(GINDEX93_LEN > 0)
    DeclareIndexTableEntry(CAN_READONLY, 93, &gGCellVoltInfo_92[GINDEX92_LEN], CAN_DT_U16, (u8)GINDEX93_LEN),
    #endif

    DeclareIndexTableEntry(CAN_READONLY, 94, gGCellTempInfo_94, CAN_DT_S16, GINDEX94_LEN),

    #if(GINDEX95_LEN > 0)
    DeclareIndexTableEntry(CAN_READONLY, 95, &gGCellTempInfo_94[GINDEX94_LEN], CAN_DT_S16, GINDEX95_LEN),
    #endif

	/*使能自研从控BSU CAN通信信息才测内阻*/
    #if((1 == BMU_BSU_COM_TYPE) && (0 == BMU_BSU_CAN_TYPE))
    DeclareIndexTableEntry(CAN_READONLY, 96, gGCellResisInfo_96, CAN_DT_U16, GINDEX92_LEN),
    //DeclareIndexTableEntry(CAN_READONLY, 98, gGSrStateInfo_98, CAN_DT_U16, GINDEX92_LEN),

    #if(GINDEX93_LEN > 0)
    DeclareIndexTableEntry(CAN_READONLY, 97, &gGCellResisInfo_96[GINDEX92_LEN], CAN_DT_U16, (u8)GINDEX93_LEN),
    //DeclareIndexTableEntry(CAN_READONLY, 99, &gGSrStateInfo_98[GINDEX92_LEN], CAN_DT_U16, (u8)GINDEX93_LEN),
    #endif
    #endif

    /*用户参数信息10个索引*/
    DeclareIndexTableEntry(CAN_READONLY, 100, gSysGenParaRO_100, CAN_DT_U16, SINDEX100_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 101, gSysHigParaRO_101, CAN_DT_U16, SINDEX101_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 102, gGBmuGenPara_102, CAN_DT_U16, GINDEX102_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 103, gGBmuHigLevPara_103, CAN_DT_U16, GINDEX103_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 104, gGHardPara_104, CAN_DT_U8, GINDEX104_LEN),

    DeclareIndexTableEntry(CAN_UPWRITE, 105, gSysGenParaRW_105, CAN_DT_U16, SINDEX105_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE, 106, gSysHigParaRW_106, CAN_DT_U16, SINDEX106_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE, 107, gGBmuGenParaWR_107, CAN_DT_U16, GINDEX107_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE, 108, gGBmuHigLevParaWR_108, CAN_DT_U16, GINDEX108_LEN),
    DeclareIndexTableEntry(CAN_UPWRITE, 109, gGHardParaWR_109, CAN_DT_U8, GINDEX109_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 110, gGBsuSafeInfo_110, CAN_DT_U16, GINDEX110_LEN),
    /*用户内部信息16个索引*/
    DeclareIndexTableEntry(CAN_READONLY, 200, gGReferSampInfo_200, CAN_DT_S16, GINDEX200_LEN),
	DeclareIndexTableEntry(CAN_READONLY, 202, gEu3AirInfo_202, CAN_DT_U16, GINDEX202_LEN),
	DeclareIndexTableEntry(CAN_READONLY, 203, gEu3AirState_203, CAN_DT_U16, GINDEX203_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 206, gLiqudCoolAirInfo_206, CAN_DT_U16, GINDEX206_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 207, gLiqudCoolAirSta_207, CAN_DT_U16, GINDEX207_LEN),
	DeclareIndexTableEntry(CAN_READONLY, 208, gLiqudCoolAirErr_208, CAN_DT_U16, GINDEX208_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 209, PackEnvInfo_209, CAN_DT_S16, GINDEX209_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 210, PackMsdInfo_210, CAN_DT_U16, GINDEX210_LEN),
	DeclareIndexTableEntry(CAN_READONLY, 211, PackAerosolInfo_211, CAN_DT_U16, GINDEX211_LEN),

	DeclareIndexTableEntry(CAN_READONLY, 212, gTFAirUserParaInfo_212, CAN_DT_U16, GINDEX212_LEN),
	DeclareIndexTableEntry(CAN_READONLY, 213, gTFAirStateInfo_213, CAN_DT_U16, GINDEX213_LEN),
	DeclareIndexTableEntry(CAN_READONLY, 214, gTFAirErrInfo_214, CAN_DT_U16, GINDEX214_LEN),
	DeclareIndexTableEntry(CAN_READONLY, 215, XinMiaoAirSta_215, CAN_DT_U16, GINDEX215_LEN),
	DeclareIndexTableEntry(CAN_READONLY, 216, XinMiaoAirPara_216, CAN_DT_U16, GINDEX216_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 223, gBsuBotTopCount_223, CAN_DT_U8, GINDEX223_LEN),
    //#if((1 == BMU_BSU_COM_TYPE) && (0 == BMU_BSU_CAN_TYPE))
	//DeclareIndexTableEntry(CAN_READONLY, 224, gGAfeWorkModeInfo_224, CAN_DT_U8, (u8)(GINDEX92_LEN+GINDEX93_LEN+1)/2),
	//#endif
	DeclareIndexTableEntry(CAN_READONLY, 225, gLeakageInfo_225, CAN_DT_U16, GINDEX225_LEN),
	/*使能自研从控BSU CAN通信信息才测内阻*/
    #if((1 == BMU_BSU_COM_TYPE) && (0 == BMU_BSU_CAN_TYPE))
    DeclareIndexTableEntry(CAN_READONLY, 226, gGCellResisRInfo_226, CAN_DT_U16, GINDEX92_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 228, gGCellResisIInfo_228, CAN_DT_U16, GINDEX92_LEN)
    #if(GINDEX93_LEN > 0)
    DeclareIndexTableEntry(CAN_READONLY, 227, gGCellResisRInfo_226, CAN_DT_U8, GINDEX92_LEN),
    DeclareIndexTableEntry(CAN_READONLY, 229, gGCellResisIInfo_228, CAN_DT_U8, GINDEX92_LEN)
    #endif
    #endif

};

/*=================================================================================================
** @Static function declaration
**===============================================================================================*/

/*=================================================================================================
** @Interface function definition
**===============================================================================================*/
/*=================================================================================================
** @Name      : void CANDeviceTableInit(void)
** @Input     : void
** @Output    : void
** @Function  : CAN通信设备表初始化
** @The notes : CAN通信包总初始化调用
**===============================================================================================*/
void CANDeviceTableInit(void)
{
    /*将通信主索引表创建到设备表*/
    CANDevTabEntryInit_API((u8)gCANDevInfo_1[eCANDev1_Addr], BMU_INDEX_NUM, Filed_BMUTab, 0);
}

/*=================================================================================================
** @Name      : void CANCommuPortUserInit(void)
** @Input     : void
** @Output    : void
** @Function  : CAN通信口用户初始化
** @The notes : CAN通信包总初始化调用
**===============================================================================================*/
void CANCommuPortUserInit(void)
{
    /*用户配置波特率重新初始化*/
    DEVCANResetInit(eCAN0);     /*初始化CAN0*/
    DEVCANResetInit(eCAN1);     /*初始化CAN1*/
    DEVCANResetInit(eCAN2);     /*初始化CAN2*/
}

/*=================================================================================================
** @Name      : void CANSetMsgRouteTransEnAPI(u8 state)
** @Input     : state:0禁止转发 1使能转发
** @Output    : void
** @Function  : 设置CAN通信包路由转发功能使能状态
** @The notes :
**===============================================================================================*/
void CANSetMsgRouteTransEnAPI(u8 state)
{
    /*禁止*/
    if(0 == state)
    {
        gCANRoutDef_4[0] = 0;
    }
    /*使能*/
    else
    {
        gCANRoutDef_4[0] = 1;
    }
}

/*=================================================================================================
** @Name      : void CANSetMsgCycleTxEnAPI(u8 state)
** @Input     : state:0禁止发送 1使能发送
** @Output    : void
** @Function  : 设置CAN通信包周期上传所有信息使能状态
** @The notes :
**===============================================================================================*/
void CANSetMsgCycleTxEnAPI(u8 state)
{
    /*禁止*/
    if(0 == state)
    {
        gCANTxVerDef_10[0] = 0;
        gCANTxBreDef_11[0] = 0;
        gCANTxMulDef_12[0] = 0;
        gCANTxSinDef_13[0] = 0;
        gCANTxCelDef_14[0] = 0;
        gCANTxParDef_15[0] = 0;
    }
    /*使能*/
    else
    {
        gCANTxVerDef_10[0] = 1;
        gCANTxBreDef_11[0] = 1;
        gCANTxMulDef_12[0] = 1;
        gCANTxSinDef_13[0] = 1;
        gCANTxCelDef_14[0] = 1;
        gCANTxParDef_15[0] = 0;
    }
}

/*=================================================================================================
** @Name      : void CANSetCellCycleTxEnAPI(u8 state)
** @Input     : state:0禁止发送 1使能发送
** @Output    : void
** @Function  : 设置CAN通信包周期上传单体信息使能状态
** @The notes :
**===============================================================================================*/
void CANSetCellCycleTxEnAPI(u8 state)
{
    /*禁止*/
    if(0 == state)
    {
        gCANTxCelDef_14[0] = 0;
    }
    /*使能*/
    else
    {
        gCANTxCelDef_14[0] = 1;
    }
}

/*=================================================================================================
** @Name      : void CANSetParaCycleTxEnAPI(u8 state)
** @Input     : state:0禁止发送 1使能发送
** @Output    : void
** @Function  : 设置CAN通信包周期上传参数信息使能状态
** @The notes :
**===============================================================================================*/
void CANSetParaCycleTxEnAPI(u8 state)
{
    /*禁止*/
    if(0 == state)
    {
        gCANTxParDef_15[0] = 0;
    }
    /*使能*/
    else
    {
        gCANTxParDef_15[0] = 1;
    }
}

/*=================================================================================================
** @Static function definition
**===============================================================================================*/
